{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Carbon neutrality and tackling misinformation in red meat - Jason Strong, Meat and Livestock Australia", "subtitle": "Carbon neutrality and tackling misinformation in red meat - Jason Strong, Meat and Livestock Australia", "summary": "<div>Red meat is increasingly seen as the “bad guy” when it comes to climate change. Undoubtedly, animal agriculture has an impact on the environment, with 10 percent of Australia’s greenhouse gas emissions coming from livestock. But Australia's leading red meat marketing and R&amp;D organization, <a href=\"https://www.mla.com.au/\" target=\"_blank\">Meat and Livestock Australia</a> (MLA) says the negative environmental impacts from red meat are often overblown.</div><div><br /></div><div>While lamb and beef are still very popular in Australia, and cattle farmers are currently enjoying record prices, red meat consumption is becoming more contentious, and conversations about sustainable food and agriculture are increasingly susceptible to emotional debates and even misinformation.</div><div><br /></div><div>In this episode, MLA’s Managing Director, Jason Strong speaks about:</div><ul><li>The MLA’s commitment to become carbon neutral by 2030, and how the red meat industry plans to use technology and improvements in animal husbandry to achieve it</li><li>The battle between the Australian meat industry and the plant-based protein industry over the use of the word “meat” on labels</li><li>Jason’s experience with groups that he claims are unfairly “denigrating” red meat as they push their own products and agendas</li><li>Why the MLA isn’t supportive of regulations to meet environmental targets</li><li><br /></li></ul><div>For more information and links to resources mentioned in the podcast, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/10/misinformation-carbon-neutrality-red-meat\" target=\"_blank\">website</a></div>", "publicationDate": "Wed, 11 Aug 2021 20:01:00 +0000", "duration": "00:42:42", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/069b67fc-6a97-11ec-9291-12fdf81a27ad/images/main.png?1668664903228", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/10/misinformation-carbon-neutrality-red-meat", "audio": [{"url": "https://backtracks.fm/tenacious/pr/068a7abe-6a97-11ec-9291-12fdf81a27ad/888835.mp3?s=1&sd=1&u=1640995750", "size": "41288483", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}