{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Ep 64 Pete Nelson on partnering with growers to build better agtech", "subtitle": "Ep 64 Pete Nelson on partnering with growers to build better agtech", "summary": "<div>This week Sarah is joined by a guest host, Cass Mao, Principal Advisor at AgThentic, to chat with Pete Nelson of AgLaunch about how growers and agtech companies can work together in a model that they call \"farmer-centric innovation\"</div><div><br /></div><div>Pete Nelson, originally a farmer and an English major at University, has been actively involved in building the support ecosystem for new agricultural enterprises for over 15 years. He has worked with a variety of public and private sector partners and helped to launch multiple startup companies. More recently he's been working on sector-specific initiatives to fund, incubate, and accelerate agricultural companies with high growth potential. </div><div><br /></div><div><a href=\"http://aglaunch.com/\" target=\"_blank\">AgLaunch</a>, which includes accelerator programs, a fund, and more, is focused on commercializing early stage agricultural innovation by working <i>with </i>farmers.</div><div><br /></div><div>Cass and Sarah wanted to speak with Pete after writing a report last year on innovation ecosystems, and how best practices in the US can be applied to Australia. Rather than just look at hotspots like Silicon Valley, the report explored ag-focused places, like St. Louis and Tennessee, where AgLaunch is located. The report, called Building a globally Recognised AgTech ecosystem in Australia, is available here: <a href=\"https://agthentic.com/reports\" target=\"_blank\">https://agthentic.com/reports</a></div><div><br /></div><div>In this episode, Pete explains what  “farmer-centric innovation” means, how AgLaunch is driving it, and how having growers at the table fundamentally changes outcomes for startups and regional communities. </div><div><br /></div><div>For additional resources and info, check out our blog: www.agtechsowhat.com/agtechsowhatepisodes/2020/4/8/ep-64-pete-nelson-on-partnering-with-growers-to-build-better-agtech</div>", "publicationDate": "Wed, 08 Apr 2020 20:22:00 +0000", "duration": "00:40:25", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/0f6eceb4-6a97-11ec-b350-12fcae752039/images/main.png?1669665046728", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2020/4/8/ep-64-pete-nelson-on-partnering-with-growers-to-build-better-agtech", "audio": [{"url": "https://backtracks.fm/tenacious/pr/0f688536-6a97-11ec-b350-12fcae752039/619173.mp3?s=1&sd=1&u=1640995766", "size": "39097269", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}