{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Episode 37: Anthony Rudd, I-AG", "subtitle": "Episode 37: Anthony Rudd, I-AG", "summary": "<p>\n</p><p>This week's conversation is with Leeton, NSW based managing director of I-AG Pty Ltd Anthony Rudd. </p>\n<p> </p>\n<p>Anthony Rudd has a unique insight into the integration of machine automation and data adoption in agriculture and has worked in this space for John Deere Australia, a Chinese company and also in software writing and development. </p>\n<p> </p>\n<p>In 2008 Anthony was employed as John Deere Australia's first ever integrated solutions manager. The concept was extremely new but it had been tested in the United States. Basically his work involved joining technology to the dealership and then to the grower, so essentially moving from machine guidance to full automation and then into integrated data.</p>\n<p> </p>\n<p>He tells Sarah Nolet that his company I-AG is busy working with an external partner developing software that will hopefully unlock the efficiencies in the space at the moment. </p>\n<p> </p>\n<p>\"We've built the base software, so it will ingest data from anywhere and any type you can store it safely and you can share it safely with whoever you want to share it with at the moment, in a few weeks we will have the map generation module available.\"</p>\n<p> </p>\n<p>Anthony's website explains that \"I-AG specialize in providing data and software solutions tailored to suit your individual operations. From simple data management all the way to building complex software to enable you to access the data you need instantly and easily enabling our clients to make quick informed decisions based on what their data is telling them.\"</p>\n<p> </p>\n<p><a href=\"http://i-ag.com.au/\">You can find more information on I-AG here</a></p>\n<p> </p>\n<p><a href=\"https://twitter.com/I_AGSOLUTIONS\">You can find I-AG on twitter here </a></p>\n<p> </p>\n<p><a href=\"https://twitter.com/AnthonyRudd11\">You can find Anthony here on Twitter. </a></p>\n<p> </p>\n<p><a href=\"https://www.linkedin.com/in/anthony-rudd-08a60615a/\">View Anthony's LinkedIn Profile here</a> </p>\n<p> </p>\n<p> </p>\n<p></p>", "publicationDate": "Mon, 18 Mar 2019 12:57:00 +0000", "duration": "01:04:41", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/2d474a4c-6a97-11ec-b350-12fcae752039/images/main.png?1668664910166", "link": "https://player.whooshkaa.com/episode?id=357323", "audio": [{"url": "https://backtracks.fm/tenacious/pr/2d407d5c-6a97-11ec-b350-12fcae752039/357323.mp3?s=1&sd=1&u=1640995814", "size": "62395500", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}