{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Episode 33: Matt Roesner", "subtitle": "Episode 33: Matt Roesner", "summary": "<p> </p>\n<p>Matt Roesner is the technical director for his family's machinery business Roesner Pty Ltd. based in Harvey, Western Australia has been in existence for more than 100 years.. </p>\n<p> </p>\n<p>The Marshall Multi Spread was the first Australian multi purpose fertiliser spreading machine spreading lime and gypsum at the same time. Since that time 10,000 machines have been built by Matt's family.</p>\n<p> </p>\n<p>Matt says, \"we've stayed relevant by spending a lot of time getting to know what our customer base wants and what their needs are. I think one of the challenges these days is the cost of capital equipment, it's continually rising and they are spending large amounts of money on machinery that can only be used for a few months of the year and so we have concentrated on building something simple, that is easy to maintain, that will last multiple seasons and has a long service life.\"</p>\n<p> </p>\n<p>These days the business is reputable as a leader in the development of agricultural technical data. A few years ago the business built a mobile app for IOS and Andriod to send out calibration data to its client base.</p>\n<p> </p>\n<p>\"We got a really good response and so we decide to build a variable controller app for an Ipad and there was immediately a lot of interest in it too,\" says Matt.</p>\n<p> </p>\n<p>\"We see the importance of the data ecosystems that exist around our products is important to the growth of our business so in March 2018 we purchased the <a href=\"http://precisionag.com.au/\">Precision Agronomics Australia</a> business, based in Esperance, WA <a href=\"http://i4m.tech/web_html5/index.html\">and formed the i4M (Internet For Machines) brand</a> - with the aim of having flexible and open systems that are simple and cost effective and independent from other brands. Our whole plan is to be able to have equipment talking back to the internet to allow applied data usage.\"</p>\n<p> </p>\n<p>Matt speaks with Sarah about the importance of the agricultural agronomist keeping up with the rapidly developing pace of technology, why he's eagerly awaiting the arrival of artificial intelligence and, the opportunity for Australia to become leaders in autonomous agriculture and how trust between growers and service providers will be pivotal in the evolution of data use in precision farming.</p>\n<p> </p>\n<p>Download the <a href=\"https://roesner.com.au/app/\">Marshall Multi Spreader App here</a></p>\n<p> </p>\n<p>Watch the <a href=\"https://roesner.com.au/latest-news/\">Marshall Multi Spreader YouTube Channel here</a></p>\n<p> </p>\n<p>Learn <a href=\"https://roesner.com.au/about/\">more about the Marshall Pty Ltd business at roesner.com.au</a></p>\n<p> </p>\n<p> </p>\n<p> </p>", "publicationDate": "Mon, 25 Feb 2019 09:42:00 +0000", "duration": "00:49:55", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/673fa6f4-6a97-11ec-a114-12fcae752039/images/main.png?1669665054094", "link": "https://player.whooshkaa.com/episode?id=357327", "audio": [{"url": "https://backtracks.fm/tenacious/pr/673a9a56-6a97-11ec-a114-12fcae752039/357327.mp3?s=1&sd=1&u=1640995911", "size": "48219651", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}