{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Episode 24- Brooke Sauer On Closing The Gap Between Growers, Agronomists And Technology", "subtitle": "Episode 24- Brooke Sauer On Closing The Gap Between Growers, Agronomists And Technology", "summary": "<p>Brooke Sauer is on a mission to close the gap between growers, agronomists, and technologies. Brooke is a digital agriculture manager at McGregor Goulay, an agricultural services company that offers cropping inputs, agronomic services and, increasingly, digital ag solutions. Although Brooke's background is in agricultural genetics, she is rapidly becoming an expert in precision agriculture, as she supports farmers to explore and adopt precision agriculture tools.</p>\n<p>In talking to Brooke on this episode, it's clear that she cares a lot about her farmers. She knows just how important it is to build personal relationships in the world of AgTech. In this episode, we explore the significance of people skills in an industry that can sometimes be too focused on flashy technologies. We also talk a lot about adoption precision ag technologies, Brooke's journey with drones, and her experience of working with startups, including:</p>\n<ul>\n<li>\n<p>an honest story about drone usage, and how Brooke encourages startups and farmers to be more focused on the data, rather than the machines</p>\n</li>\n<li>\n<p>how important farmers' confidence is in the adoption and success of precision ag technology</p>\n</li>\n<li>\n<p>the ups and downs of working with fast-paced, high-energy startups</p>\n</li>\n<li>\n<p>how Brooke exercises interpersonal skills on a daily basis to build trust with growers</p>\n</li>\n</ul>", "publicationDate": "Wed, 06 Jun 2018 08:25:17 +0000", "duration": "00:39:42", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/2f1f12be-6a97-11ec-a114-12fcae752039/images/main.png?1668664911772", "link": "https://player.whooshkaa.com/episode?id=357338", "audio": [{"url": "https://backtracks.fm/tenacious/pr/2f15e482-6a97-11ec-a114-12fcae752039/357338.mp3?s=1&sd=1&u=1640995820", "size": "38412868", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}