{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Episode 29: Will MacSmith", "subtitle": "Episode 29: Will MacSmith", "summary": "<p> </p>\n<p>Will MacSmith is a farmer from Manildra in Central West New South Wales.</p>\n<p>Will and his business partner Hamish are trying to develop a system to realise profit margins for sheep through the collection of real time data of feed efficiency and conversion for individuals rather than the mob.</p>\n<p>They're doing this through trial and error in confinement and feedlotting on Will's family farm where he's been living and working for the last 10 years. Over a period of two years they have been building a facility, using microcontrollers, that measures individual feed intake and live weight at the same time, in real time.</p>\n<p>\"Every time the animal leaves the stall where they feed from that piece of information gets sent to the cloud and allocated against that individual animal's tag number,\" says Will.</p>\n<p>\"We had sheep in the feedlot and we would have varying levels of performance and we found that using growth rates as an indicator for performance was a bit flawed, and doesn't really tell you much about feeding efficiency and cost efficiency.\"</p>\n<p>It's about finding better ways to feed, and better varieties of feed and also looking at the effects of environmental factors such as shearing or heat or lack of water and measuring that against cost benefits and of course they also consider genetics. Will also says similar systems that are already available on the market are cost prohibitive for most farmers.</p>\n<p>\"At this stage in Australia we can't really get around the cost of labour for the construction of individual stalls on a large scale. At the moment the question probably is, 'would it be cheaper to build it overseas.\"</p>\n<p>Will is working with feed companies interested in comparing and monitoring their feed products and he says there is a lot of interesting coming for sire evaluation and the genetics side of the industry as well.</p>\n<p>In this podcast, will also speaks about pushing the Ag industry in Australia forward, and the challenges of ageing demographic in farming.</p>\n<p>Will is new to Twitter and so the best place to contact him or his business partner Hamish is via email </p>\n<p><a>william@crownagriculture.com.au</a></p>\n<p><a>hamish@crownagriculture.com.au</a></p>\n<p> </p>\n<p> </p>\n<p> </p>", "publicationDate": "Sun, 06 Jan 2019 07:50:26 +0000", "duration": "00:46:21", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/6e2f8ede-6a97-11ec-b350-12fcae752039/images/main.png?1669665054767", "link": "https://player.whooshkaa.com/episode?id=357331", "audio": [{"url": "https://backtracks.fm/tenacious/pr/6e2677fe-6a97-11ec-b350-12fcae752039/357331.mp3?s=1&sd=1&u=1640995940", "size": "44803730", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}