{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Episode 36: The Digital Ag Collective", "subtitle": "Episode 36: The Digital Ag Collective", "summary": "<p><b>The Digital Ag Collective with Kelly Pearce and Tanya Kilminster from the West Australian wheatbelt. </b></p>\n<p> </p>\n<p>This podcast conversation is about the development of an Australian farmer owned and controlled group that utilises and shares the most relevant data systems and programs available in the Ag Tech sector. </p>\n<p> </p>\n<p>Kelly Pearce and Tanya Kilminster both live and farm in the West Australian wheatbelt. More notably they both hold Agricultural Science PhD's with the CSIRO. </p>\n<p> </p>\n<p>In their chat with Sarah Nolet they explain the climatic and economic imperatives that are changing the way farmers in their regions conduct business. </p>\n<p> </p>\n<p>Tanya works with the WA Department of Agriculture and Food and says, \"in the last decade we have really had some challenges from a climatic and economic point of view - so every decision we make has to be really critically thought out. We really need to utilised the data available us to make much more informed decisions. From about 2010 onwards we have had some really 'doozey's' of seasons and so farmers have really challenged us as a Department for solutions.\"</p>\n<p> </p>\n<p>Both Kelly and Tanya have been interested in making better use of the business intelligence becoming available to their own farming systems and found that once they delved deeper they became frustrated with what they found. </p>\n<p> </p>\n<p>This has led to the establishment of the <a href=\"https://digitalagcollective.com/\">Digital Ag Collective (DAC).</a></p>\n<p> </p>\n<p>\"We went to Sydney and we put a call out there for data scientist, analysts, IT experts come and meet with a group of WA producers who are really interested in pursing technology for data integration and business intelligence and we were overwhelmed with the response,\" says Kelly who is the Collectives chairperson.</p>\n<p> </p>\n<p>Kelly says the aim of the DAC is to, \"drive industry wide, producer led frameworks and standards for providers to incentivise and allow us the opportunity to give our experience, to be involved in the assessment of these technologies, share our pain points and help co-develop solutions together.\"</p>\n<p> </p>\n<p>\"What we are proposing that farmers are a critical part of the solution and that tech needs to be developed from the ground up.\"</p>\n<p> </p>\n<p>Right now the Collective is busy working out who are their best collaborators and partner as well as setting up their right legal entity to allow for a true hub of business intelligence - that is owned and run by farmers. </p>\n<p> </p>\n<p>You can find Kelly <a href=\"https://twitter.com/kellypearce7?lang=en\">here on Twitter </a></p>\n<p>You can find Tanya <a href=\"https://www.linkedin.com/in/tanya-kilminster-03655993/\">here on LinkedIn</a></p>\n<p> </p>\n<p>For anyone interested in more information about the Digital Ag Collective you can email Kelly at <a href=\"http://pearcekelly@bigpond.com/\">http://pearcekelly@bigpond.com</a></p>\n<p> </p>\n<p>The Digital Ag Collective can be found <a href=\"https://digitalagcollective.com/\">https://digitalagcollective.com/</a></p>", "publicationDate": "Thu, 14 Mar 2019 10:22:20 +0000", "duration": "00:42:23", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/67384364-6a97-11ec-b350-12fcae752039/images/main.png?1669665053552", "link": "https://player.whooshkaa.com/episode?id=357324", "audio": [{"url": "https://backtracks.fm/tenacious/pr/67322326-6a97-11ec-b350-12fcae752039/357324.mp3?s=1&sd=1&u=1640995911", "size": "40990871", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}