{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Getting Off the Commodities Treadmill - Loran Steinlage", "subtitle": "Getting Off the Commodities Treadmill - Loran Steinlage", "summary": "<div>Loran Steinlage has been labeled a ‘regenerative’ farmer and branded a conservationist, yet as a farmer in Iowa, in many ways he’s far from the stereotypical image of either. He lives in the heart of the Iowa corn belt, but says he now doesn’t care whether he grows corn or not.</div><div><br /></div><div>In this episode, Loran shares how his drive for innovation has come from a series of difficult and life-changing events in his personal life. This, coupled with his love of tinkering with machines has helped him unlock new ways of farming, such as cover cropping, interseeding and relay cropping, that have not only won him awards and improved profitability, but also caught the attention of machinery manufacturers and helped him spend more time with his family.</div><div><br /></div><div>While other farmers in the area are focused on growing row crops at scale, Loran is focused on increased crop diversity, reducing the costs of production, and ultimately getting off the commodities treadmill.</div><div>In this podcast, Loran talks about:</div><ul><li>How he’s able to grow a crop 365 days a year, even under snow.</li><li>How modifying equipment has allowed him to reduce inputs and run a low cost production system.</li><li>Why he hopes sharing his innovations will help other farmers consider alternative farming practices and different markets.</li></ul><div><br /></div><div>For more information, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/9/8/getting-off-the-commodities-treadmill\" target=\"_blank\">website.</a></div><div><br /></div><div>Also, we want to hear from YOU! We're planning our 100th episode and are looking for stories about how you have used any of the agtech or food innovation ideas discussed on this podcast in your business or workplace. Did it work? Or did it fail?</div><div>You can record a short voice message by following the link on our website <a href=\"https://www.agtechsowhat.com/\" target=\"_blank\">here</a>, and you might just end up on the show!</div>", "publicationDate": "Wed, 08 Sep 2021 20:01:00 +0000", "duration": "00:38:26", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/00a1ce18-6a97-11ec-a8f0-12fdf81a27ad/images/main.png?1668664902909", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2021/9/8/getting-off-the-commodities-treadmill", "audio": [{"url": "https://backtracks.fm/tenacious/pr/0099f67a-6a97-11ec-a8f0-12fdf81a27ad/900784.mp3?s=1&sd=1&u=1640995742", "size": "37203076", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}