{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Investing Beyond the Farmgate with Ben Barlow, New Edge Microbials", "subtitle": "Investing Beyond the Farmgate with Ben Barlow, New Edge Microbials", "summary": "<div>Biologicals in agriculture have a wildly exciting future. It’s a segment responding to innovation in science, changes in markets, and the urgent pressures of adapting to climate change. New startups coming into the space are generating plenty of buzz, but there are also established players with products in the hands of farmers today.</div><div><br /></div><div>Ben Barlow is a veteran executive and the Managing Director of New Edge Microbials, a company that has been supplying farmers with legume inoculants and other biologicals for over 20 years. Growing a business in the biologicals space has been just one more step on Ben’s path from his early days as a bank teller with a front-row seat to new opportunities both on and off-farm, and through to expanding his investment thesis to include companies along the value chain globally.</div><div><br /></div><div>While Ben has plenty to share about the realities of corporate agribusiness for founders and executives, his story as a family farmer investing beyond the farmgate has lessons for producers as well.</div><div><br /></div><div>In this episode, Ben shares:</div><div><br /></div><ul><li>How farmers can diversify their portfolio to manage for the seasonality and cyclicality of farm production</li><li>Trends in the biologicals market, and what it takes to succeed in a sector with high barriers to entry and costs for R&amp;D</li><li>What it takes for globalized agribusiness to succeed in local markets where people and communities are</li><li>What will be needed for Australia to avoid having a massive disadvantage in biologicals in the coming years</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 23 Mar 2022 19:00:00 +0000", "duration": "00:32:17", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/cf018a44-aadb-11ec-bde9-0e8742d2b355/images/main.png?1669665027746", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2022/23/ben-barlow-new-edge-microbials-biologicals-agriculture", "audio": [{"url": "https://backtracks.fm/tenacious/pr/cefe294e-aadb-11ec-bde9-0e8742d2b355/973606.mp3?s=1&sd=1&u=1648062171", "size": "31300829", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}