{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Legacy Finance Eyes Agtech, with Wells Fargo", "subtitle": "Legacy Finance Eyes Agtech, with Wells Fargo", "summary": "<p>While early-stage agtech tends to play in the venture world, it pays to check in with how folks sitting in banking think about their role as partners to startups. Traditional lenders can draw on the best part of a century of connection to agriculture, and potentially offer significant options for financing the growth of later-stage companies.</p><p>This week we heard from Romie Basra, Senior VP, National Sustainable Tech Practice Leader, and Karol Aure-Flynn, Food and Agribusiness Industries Advisor at Wells Fargo. As investors and lenders in traditional agriculture, as well as to other tech movements that have boomed (and busted) in recent memory, Romie and Karol joined to speak about:</p><ul><li>Cleantech vs. agtech. How investors in the previous waves of cleantech think about the challenges facing the new generation of startups in ag</li><li>Financing options for startups. What role a legacy provider of finance like Wells Fargo wants to play for growing agtech companies</li><li>Scaling in indoor ag. How a bank thinks about the barriers to scale for companies in a space like indoor agriculture</li><li>Value props to institutional lenders. Why the “unsexy” elements of startup scale matter most to institutional lenders</li></ul><p>For more useful resources, visit our <a href=\"https://tenacious.ventures/insights\">website</a>.</p>", "publicationDate": "Wed, 05 Oct 2022 19:00:00 +0000", "duration": "00:28:36", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/d427c98e-4469-11ed-bc50-121646647d51/images/main.png?1669665021032", "link": "https://tenacious.ventures/podcast-episodes/legacy-finance-eyes-agtech-with-wells-fargo", "audio": [{"url": "https://backtracks.fm/tenacious/pr/d4245ed4-4469-11ed-bc50-121646647d51/ep148_asw_wellsfargo.mp3?s=1&sd=1&u=1664945818", "size": "41199589", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}