{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Navigating Economic Development and the Social Fabric of Agriculture, with Elizabeth Brennan, Wide Open Agriculture", "subtitle": "Navigating Economic Development and the Social Fabric of Agriculture, with Elizabeth Brennan, Wide Open Agriculture", "summary": "<div>Every decision made by founders, farmers, and leaders in agriculture shapes the future of our food system. Whether it’s the cost per hectare of a biological or the value of a ton of carbon sequestered, the different goals and outcomes that end up in business plans inevitably define how time, energy, and capital are spent.</div><div><br /></div><div>But there are many outcomes of a healthy food system that don’t fit in a business plan. How do leaders today account for the broad connections between people, ideas, and identities? It’s this fabric that reflects who we are, what we value as a society, and how we interact as humans along the agricultural value chain.</div><div><br /></div><div><a href=\"https://www.linkedin.com/in/amoeaba/\" target=\"_blank\">Elizabeth Brennan</a> is Non-Executive Director of publicly-listed regenerative food company <a href=\"https://www.wideopenagriculture.com.au/\" target=\"_blank\">Wide Open Agriculture</a>. She is a leader across many other organizations dedicated to innovation, equality, and diversity in our agrifood system, and has a long connection to the Western Australian wheat belt, as well as communities overseas.</div><div><br /></div><div>In this episode Liz shares her insights on:</div><div><br /></div><ul><li>What Australian farmers can learn from other cultures, communities, and different forms of agriculture less geared toward the economics of export</li><li>How her definition of “impact” helps her navigate multiple roles of influence across publicly-listed companies, not-for-profits, and family farming business</li><li>How her experience working in subsistence agricultural communities in Papua New Guinea applies to her work in Australian agriculture today</li><li>What the role social fabric in rural and regional communities means, and how to make sure it isn’t lost in the future</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 20 Apr 2022 20:00:00 +0000", "duration": "00:31:12", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/d34a6782-c0e4-11ec-94ff-0a8491f70b41/images/main.png?1669665026817", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2022/4/21/wide-open-agriculture-liz-brennan-women-australian-agriculture", "audio": [{"url": "https://backtracks.fm/tenacious/pr/d3464daa-c0e4-11ec-94ff-0a8491f70b41/983965.mp3?s=1&sd=1&u=1650484963", "size": "30249108", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}