{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "\"Not a cheerleader, not the enemy\",  journalist Sarah Mock on making windows in the walls around agriculture", "subtitle": "\"Not a cheerleader, not the enemy\",  journalist Sarah Mock on making windows in the walls around agriculture", "summary": "<div>Sarah Mock isn’t afraid of having tough conversations and shining light on thorny issues in the agriculture industry. A journalist with experience in international development and agtech, Sarah recently began a Twitter firestorm with an article asserting that all farming is inherently exploitative.</div><div><br /></div><div>While sometimes accused of being anti-farming, Sarah says this couldn’t be further from the truth. She describes herself as being “not a cheerleader; not the enemy”. Sarah grew up on a farm in Wyoming and has worked in agriculture her entire career - from high profile agtech startups such as Farmers Business Network, to reporting on ag politics under the Trump administration.</div><div><br /></div><div>In this episode, Sarah Mock discusses:</div><ul><li>The reluctance of some farmers to change their farming practices, despite strong data evidence indicating the benefits.</li><li>Why the agriculture industry needs to start telling the truth about what farming looks like, and start addressing what customers want.</li><li>How agriculture policy and incentives can actually lead to poor business decisions & outcomes.</li><li>What it feels like to stick up for controversial beliefs, and the pushback she receives from being provocative and “making windows in the walls around farming”.</li></ul>", "publicationDate": "Wed, 07 Oct 2020 19:01:00 +0000", "duration": "00:48:11", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/05efc50a-6a97-11ec-a502-0e1130976a5f/images/main.png?1669665042327", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/not-a-cheerleader-not-the-enemy-sarah-mock", "audio": [{"url": "https://backtracks.fm/tenacious/pr/05e9a846-6a97-11ec-a502-0e1130976a5f/741478.mp3?s=1&sd=1&u=1640995750", "size": "46565426", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}