{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "On-Farm Climate Risks and the Future of Ag Finance with Clay Govier", "subtitle": "On-Farm Climate Risks and the Future of Ag Finance with Clay Govier", "summary": "<p>For a year that has already seen so much downside for US farmers in the form of extreme weather - from droughts to soaring temperatures - there’s another risk looming: rising interest rates. <br /><br />Adapting to an increasingly unpredictable and extreme climate is not cheap or easy. For farmers planning for the resilience and longevity of their business, the intersection of climate and fiscal risk has us wondering: how are farmers financing future growth, and where does resilience to climate change factor in?<br /><br />This week’s bonus episode gets into the details of how one farmer is planning for growth in the midst of enormous uncertainty. <a href=\"https://www.linkedin.com/in/cgovier/\">Clay Govier</a> is a multi-generational farmer in Nebraska growing a diversified mix of grains, and he joins to speak about:</p><ul><li>Extreme weather in 2022 - What Clay’s exposure to heat and drought has meant for his business this year</li><li>Financing resilience - What financing options Clay and his family have used for generations, and what is driving change in the future</li><li>Generational transition - Why the $500B of US farmland changing hands in the next 10 years is driving new strategic thinking from farmers</li><li>Alternative financing models - What the risks, opportunities, and skepticism looks like toward new modes of finance&nbsp;</li></ul><p>For more useful resources, visit our <a href=\"https://tenacious.ventures/insights#podcast-episodes\">website</a>.</p>", "publicationDate": "Wed, 12 Oct 2022 19:00:00 +0000", "duration": "00:30:40", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/0e4b1c1a-49ba-11ed-a9e4-0eba35063233/images/main.png?1668664898400", "link": "https://tenacious.ventures/podcast-episodes/on-farm-climate-risks-and-the-future-of-ag-finance-with-clay-govier", "audio": [{"url": "https://backtracks.fm/tenacious/pr/0e481772-49ba-11ed-a9e4-0eba35063233/ep149_claygovier_farmfinancev2_1.mp3?s=1&sd=1&u=1665530020", "size": "44244265", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}