{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "Services and Software for On-Farm Autonomy, with Iftach Birger of FieldIn", "subtitle": "Services and Software for On-Farm Autonomy, with Iftach Birger of FieldIn", "summary": "<div>There are many different views about the future of autonomous farming. One is that, out of the emerging autonomous equipment providers and established blue chip suppliers, there will be clear winners and losers in the battle for on-farm dominance. Another is that farming in the future will involve all kinds of autonomous solutions. This second possibility presents tons of opportunities to add value for farmers.</div><div><br /></div><div>Our guest on this week’s episode is <a href=\"https://www.linkedin.com/in/iftachbirger/\" target=\"_blank\">Iftach Birger</a>, Co-Founder and COO at <a href=\"https://www.fieldin.com/\" target=\"_blank\">FieldIn</a>, a farm data and autonomous equipment startup founded in Israel. Rather than wade into the fray playing out between new autonomous equipment players and established corporations, FieldIn is attempting to create a platform that allows a mixed fleet of equipment to interact seamlessly.</div><div><br /></div><div>Iftach joins us to speak about:</div><ul><li>Lessons for the agtech world from being born and raised on a high-value crop farm in Israel</li><li>What’s more important for a scaling agtech startup - building what customers say they want, what they actually need, and what is even possible within the present day constraints</li><li>The intricacies of the farm labor debate as it relates to on-farm autonomy</li><li>How to provide the service alongside the software in an industry that values (but might not pay for) boots-on-the-ground partners in the future</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 04 May 2022 20:00:00 +0000", "duration": "00:34:53", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/2192660a-cbe5-11ec-aaf4-123a0633baf7/images/main.png?1669665026524", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2022/5/5/farm-autonomy-fieldin-iftach", "audio": [{"url": "https://backtracks.fm/tenacious/pr/218d68a8-cbe5-11ec-aaf4-123a0633baf7/989483.mp3?s=1&sd=1&u=1651694557", "size": "33789008", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}