{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "The Future of Fertilizer - Nitrogen: Part 2, with Jupiter Ionics and Kula Bio", "subtitle": "The Future of Fertilizer - Nitrogen: Part 2, with Jupiter Ionics and Kula Bio", "summary": "<p>Today we're tackling part two of our future of Nitrogen fertilizer discussion, focusing on the realm of business models and strategies. We chat with two companies exploring how we might reimagine the way farmers around the world buy and sell this critical input, including through distributed, rather than centralized, supply chains. <br /><br /></p><p>We’ll continue our conversation with <a href=\"https://www.linkedin.com/in/bill-brady-b6953118/\">Bill Brady</a>, CEO and Director at <a href=\"https://kulabio.com/\">Kula Bio</a> and <a href=\"https://www.linkedin.com/in/charlie-day-melbourne/\">Charlie Day</a>, CEO at <a href=\"https://www.jupiterionics.com/\">Jupiter Ionics</a>*&nbsp;We also add in some on the ground perspective around how farmers are handling the pressures of the fertilizer market right now by chatting with Jason McNeese, software specialist for the Asia Pacific region at Trimble Agriculture, and Darren Walford, APAC Sales Manager for Trimble Global Positioning.<br />In this episode, our guests speak about:</p><p>A future of small scale production of N, and how farmers have reacted to potential changes away from today’s centralized model<br />What benefits, especially in terms of Scope-3 emissions, might be realized by thinking differently about how and where fertilizer is made<br />How new N companies are tackling the challenge of creating trustworthy brands and products in the face of the many false starts in the fertilizer space.</p><p><br /></p><p>For more useful resources please visit our website.</p><p><br /></p><p><i>*Disclaimer: Jupiter Ionics is a portfolio company of Tenacious Ventures</i></p><p><br /><i>This episode is brought to you in partnership with <a href=\"https://agriculture.trimble.com/\">Trimble Agriculture</a>, who are building technology to make farming better through precision.</i><br /></p><p><br /><br /></p>", "publicationDate": "Wed, 02 Nov 2022 19:00:00 +0000", "duration": "00:31:06", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/eeb07b66-5a26-11ed-82e5-0a2e2947cbb1/images/main.png?1669665019324", "link": "https://tenacious.ventures/podcast-episodes/the-future-of-fertilizer-nitrogen-part-2-with-jupiter-ionics-and-kula-bio", "audio": [{"url": "https://backtracks.fm/tenacious/pr/eeaafd08-5a26-11ed-82e5-0a2e2947cbb1/ep152_futureofnfertilizer_part2.mp3?s=1&sd=1&u=1667335939", "size": "44843327", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}