{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "The Future of Insurance in Agriculture, with Damon Johnson, Global Ag Risk Solutions", "subtitle": "The Future of Insurance in Agriculture, with Damon Johnson, Global Ag Risk Solutions", "summary": "<div>For a traditionally low innovation industry, things are starting to heat up in agricultural insurance.</div><div><br /></div><div>While it remains something of a black box for many people in agriculture, the forces of climate change and technological innovation are creating the right mix of incentives that could change how the whole industry approaches risk.</div><div><br /></div><div>This second episode of our exploration of ag insurance (check out the first, a 101 on ag insurance, here!) considers a digitally-native product in the hands of farmers today. Reimagining insurance like this will be the difference between farmers spending hours, days, and weeks dealing with brokers and getting payouts, compared to almost instant quotes, claims, and reimbursements.</div><div><br /></div><div>In this episode, our guest Damon Johnson, Director of Strategic Projects at Global Ag Risk Solutions, speaks about:</div><div><br /></div><ul><li>What incentives are changing to increase the use of more data in agricultural insurance</li><li>How parametric insurance works as an alternative to traditional agricultural products</li><li>What’s involved in developing a parametric product to create new value for customers as well as vendors</li><li>Where digitally-native insurance products might emerge as a value-add for sustainable farming systems and inputs</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 15 Jun 2022 20:00:00 +0000", "duration": "00:34:25", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/188c1b06-ece6-11ec-a3e2-0a6e3957604d/images/main.png?1668664899962", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2022/06/16/parametric-crop-insurance-damon-johnson", "audio": [{"url": "https://backtracks.fm/tenacious/pr/1885bcb6-ece6-11ec-a3e2-0a6e3957604d/1007827.mp3?s=1&sd=1&u=1655323365", "size": "33339148", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}