{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "The Authenticity Premium in AgTech Marketing with Camille Grade from Bushel and Travis Martin from Magnetic Ag", "subtitle": "The Authenticity Premium in AgTech Marketing with Camille Grade from Bushel and Travis Martin from Magnetic Ag", "summary": "<div>AgTech companies make promises to investors to grow fast and be quick to iterate or change direction. But they also make promises to customers who think more in seasons instead of product development cycles, and who value long-term relationships with a mutual investment.</div><div><br /></div><div>These are difficult pressures for agtech marketers to manage. In this episode, we hear from Camille Grade, Chief Marketing Officer at Bushel, and Travis Martin, an agtech marketing consultant and founder of industry newsletter Magnetic Ag, on how they balance the demands of fast-growth tech with the long memory and unique market structure of agriculture.</div><div><br /></div><div>Hear both guests share their insights on:</div><div><br /></div><ul><li>Why authenticity and integrity are more important than ever when communicating your agtech brand</li><li>How to reconcile new media and marketing strategies with an industry that still relies heavily on in-person connection</li><li>What opportunities exist with your early adopters and biggest fans</li><li>How to manage your brand promise over crucial periods of growth, experimentation, and change</li></ul><div><br /></div><div>For more information and links to the resources mentioned in this podcast, visit our website.</div>", "publicationDate": "Wed, 23 Feb 2022 19:00:00 +0000", "duration": "00:34:33", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/265eb1fc-94db-11ec-b678-0ac543a6a2b7/images/main.png?1669665028415", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2022/2/29/marketing-agtech-bushel-magnetic-ag", "audio": [{"url": "https://backtracks.fm/tenacious/pr/265a34f6-94db-11ec-b678-0ac543a6a2b7/961577.mp3?s=1&sd=1&u=1645642958", "size": "33476852", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}