{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1669665018341", "link": "https://www.agtechsowhat.com/"}, "title": "What's the role of government in agtech ecosystems? Salvatore Lavallo, Abu Dhabi Investment Office", "subtitle": "What's the role of government in agtech ecosystems? Salvatore Lavallo, Abu Dhabi Investment Office", "summary": "<div>It’s fair to say most entrepreneurs (and farmers!) aren’t big fans of government rules and regulations for fear of being slowed down by red tape and bureaucracy. However, the political environment in which a startup develops can have a big impact on its ability to find investment and support, especially in agtech, where ecosystems are still very new for most countries.</div><div><br /></div><div>The United Arab Emirates is investing heavily in agtech, seeking to make Abu Dhabi the global center for innovation in agriculture. Their focus is on vertical farming, aquaculture, and hydroponics. And they’re working to be strategic in attracting investment and solving for food security, while also developing a knowledge economy.</div><div><br /></div><div><a href=\"https://www.linkedin.com/in/salvatore-lavallo-bb58771a/?originalSubdomain=ae\" target=\"_blank\">Salvatore Lavallo</a> is the Head of Foreign Direct Investment at the <a href=\"https://www.investinabudhabi.ae/\" target=\"_blank\">Abu Dhabi Investment Office</a>. He’s had a unique, and perhaps unlikely journey, to this position. Growing up in Indiana, his interest in economic development led him to become, at the age of 27, one of the youngest people to travel to every country in the world. Along the way, he became a farm owner in Tanzania, and later, a consultant with McKinsey in Africa and the Middle East.</div><div>In this episode, Salvatore discusses:</div><div><br /></div><ul><li>Challenging conventional economic indicators to understand what actually benefits local communities</li><li>Abu Dhabi’s bold plan to create Food Tech Valley, a hub for agtech innovation in desert environments.</li><li>The tension between too much government regulation and too little</li></ul><div><br /></div><div>For more information and resources from this episode, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/12/14/-government-in-agtech-ecosystems\" target=\"_blank\">website</a></div>", "publicationDate": "Wed, 15 Dec 2021 19:01:00 +0000", "duration": "00:44:21", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/f3b203e4-6a96-11ec-89dd-0e1130976a5f/images/main.png?1669665030284", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2021/12/14/-government-in-agtech-ecosystems", "audio": [{"url": "https://backtracks.fm/tenacious/pr/f3a3ce1e-6a96-11ec-89dd-0e1130976a5f/939184.mp3?s=1&sd=1&u=1640995721", "size": "42882524", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}