{"version": 5, "show": {"title": "In Search of Soil", "summary": "Exploring the mysteries of soil in search of answers that you can use in your garden or on your farm.  Each week features scientists and experts sharing insights into topics like soil science, composting, cover cropping, biochar, no-till, and fungi, among other things!   In Search of Soil is hosted and produced by Diego Footer.", "poster": "https://ssl-static.libsyn.com/p/assets/1/b/7/0/1b70f83437856db5/In_Search_of_Soil_1.jpg", "link": "http://insearchofsoil.libsyn.com/website"}, "title": "Dr. Adriano Sofo - Soil Macrofauna| In Search of Soil #20", "subtitle": "Dr. Adriano Sofo - Soil Macrofauna| In Search of Soil #20", "summary": "<p>In this episode of <em>In Search of Soil</em>, we’re talking to Italian soil Scientist Dr. Adriano Sofo to shed some light on the importance of soil macrofauna, earthworms, beetles, ants, and the like, and their roles in building healthier soil for more sustainable agriculture.</p> <p>Dr. Adriano Sofo is an associate professor in the University of Basilicata in Matera, Italy. Cited more than four thousand times, his research interests include plant-soil interactions, biogeochemistry, and environmental botany. With a passion for educating, he believes that information dissemination is the key to creating a more sustainable and regenerative agricultural landscape.</p> <p><a href=\"https://scholar.google.it/citations?user=BYC9328AAAAJ&amp;hl=en\">List of Dr. Adriano Sofo’s Works</a></p> <p> </p> <p><span style=\"font-size: 12pt;\"><strong>WATCH FULL EPISODES</strong> </span></p> <p><span style=\"font-size: 12pt;\"><a href=\"https://bit.ly/watchISOS\" title=\"YouTube https://bit.ly/watchISOS\">YouTube https://bit.ly/watchISOS</a></span></p> <p><span style=\"font-size: 12pt;\">Follow Diego <a href=\"https://www.instagram.com/diegofooter\">@diegofooter - https://www.instagram.com/diegofooter</a></span></p> <h2><span style=\"font-size: 12pt;\"><strong>In this episode of In Search of Soil</strong></span></h2> <ul> <li>Traditional agricultural practices that deplete soil organic matter and biodiversity (01:45)</li> <li>How Dr. Sofo defines minimum till (05:23)</li> <li>The band of soil that plays the greatest role in agronomy and the band of soil you don’t want to disturb (07:04)</li> <li>Incorporating organic matter into the soil vs. leaving organic matter on the soil surface (10:07)</li> <li>Completely wet soil vs. wet soil surface: is there a difference in plant health? (14:05) <ul> <li>It all depends on the root morphology and root architecture (18:15)</li> </ul> </li> <li>How different irrigation systems can affect plant growth (19:33)</li> <li>Will tillage dry out soil faster? (24:50)</li> <li>Why isn’t sustainable agriculture viewed as a better option? Why do farmers still subscribe to conventional farming practices? (27:33) <ul> <li>The soil has as much carbon as the biosphere and the atmosphere (32:38)</li> </ul> </li> <li>The importance of soil microfauna, mesofauna, macrofauna, and megafauna (33:28)</li> <li>The roles that earthworms play in soil health (39:00)</li> <li>What roles do ants play in soil health? (42:15)</li> <li>Who aerates the soil more, earthworms or ants? (44:31)</li> <li>How to increase the earthworm population in your soils (47:42)</li> <li>Why does the soil collapse with tillage but maintains its structure with the macrofauna? (49:52)</li> <li>Speeding up the reversal of compaction (57:01) <ul> <li>Aerating the soil with a broadfork (59:59)</li> </ul> </li> <li>Is it possible to get to a point where you can let nature take care of the soil? (01:01:17)</li> <li>Choosing the gentle approach over the harsh approach (01:05:10)</li> <li>Organic matter in soil: layering vs. mixing (01:06:18)</li> <li>Defining sustainable agriculture today (01:09:57)</li> <li>What Dr. Adriano Sofo wants farmers to know (01:11:18)</li> </ul>", "publicationDate": "Wed, 01 Sep 2021 09:00:00 +0000", "duration": "01:14:29", "poster": "https://ssl-static.libsyn.com/p/assets/1/5/b/f/15bfcdd50354a1a45f2e77a3093c12a1/PODCAST_-_Graphic_1_-_Square.jpg", "link": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-20-AdrianoSofo-FullEpisode.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-20-AdrianoSofo-FullEpisode.mp3?dest-id=2402825", "size": "107879866", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}