{"version": 5, "show": {"title": "In Search of Soil", "summary": "Exploring the mysteries of soil in search of answers that you can use in your garden or on your farm.  Each week features scientists and experts sharing insights into topics like soil science, composting, cover cropping, biochar, no-till, and fungi, among other things!   In Search of Soil is hosted and produced by Diego Footer.", "poster": "https://ssl-static.libsyn.com/p/assets/1/b/7/0/1b70f83437856db5/In_Search_of_Soil_1.jpg", "link": "http://insearchofsoil.libsyn.com/website"}, "title": "Dr. David Laird - The Role of Clay in Soils | In Search of Soil #17", "subtitle": "Dr. David Laird - The Role of Clay in Soils | In Search of Soil #17", "summary": "<p>In this episode of In Search of Soil, we’re talking to Dr. David Laird of Iowa State University to shed some light on what it means to have clay soil, what its benefits and drawbacks are on agricultural production, as well as de-mystifying some common misconceptions on clay soils.</p> <p>Dr. David Laird is a professor at Iowa State University Department of Agronomy. As a soil scientist, he has authored and co-authored more than 120 journal articles and book chapters on many subjects, most notably on clay mineralogy. Dr. Laird’s research interests include carbon sequestration, chemical, mineralogical, and surface properties of soil clays, nutrient leaching, and the impact of biochar on soil quality, among many others.</p> <p><a href=\"https://scholar.google.com/citations?hl=en&amp;user=3bc2xPYAAAAJ&amp;view_op=list_works\"> Dr. David Laird’s Publications</a></p> <p><span style=\"font-size: 12pt;\"><strong>WATCH FULL EPISODES</strong> </span></p> <p><span style=\"font-size: 12pt;\"><a href=\"https://bit.ly/watchISOS\" title=\"YouTube https://bit.ly/watchISOS\">YouTube https://bit.ly/watchISOS</a></span></p> <p><span style=\"font-size: 12pt;\">Follow Diego <a href=\"https://www.instagram.com/diegofooter\">@diegofooter - https://www.instagram.com/diegofooter</a></span></p> <h2><span style=\"font-size: 12pt;\"><strong>In this episode of In Search of Soil</strong></span></h2> <ul> <li>Common misconceptions around clay from an agricultural producer standpoint (02:07) <ul> <li>Clays evolve over time (04:05)</li> </ul> </li> <li>How clays affect agricultural productivity (05:42)</li> <li>Why cation exchange capacities of clay are important in agriculture (08:51) <ul> <li>Minerals: sand vs. clay (10:38)</li> </ul> </li> <li>Quartz particle size and clay particle size (14:55)</li> <li>The time it takes for a clay to dissolve like a quartz would (20:55)</li> <li>Factors affecting the evolution of clay in the Great Plains and the variation of clay and mineral contents across geographies (23:02)</li> <li>Will a plant be able to tell the difference between clays and will there be a difference in performance? (33:33)</li> <li>Are minerals in clay biologically available for microbial use? (34:34) <ul> <li>Incredibly weathered soil in the tropics and yet it supports the greatest biome on the planet (36:42)</li> </ul> </li> <li>An ecosystem with stable and accessible nutrients (38:44)</li> <li>The process of smectites being broken down (39:33)</li> <li>What in biology breaks the smectite bonds? (41:19)</li> <li>How can a positively charged ion knock off a negatively charged ion if they’re equal strength? (44:24)</li> <li>Plant absorbing the nutrients knocked off the smectites (46:53)</li> <li>Soil evolution and why row crop soils tend to acidify (50:28)</li> <li>What happens to the clay when plants are introduced into the soil? (51:20)</li> <li>Can you turn a sandy soil into a more productive loam by adding in clay? (01:01:09)</li> <li>Clay is good, but there’s such a thing as too much clay (01:05:58)</li> <li>Would it make sense to add sand to a clay-heavy soil?(01:09:06)</li> <li>Can roots make a difference in breaking up a clay-heavy soil? (01:10:17)</li> <li>Interactions between clay in the soil and organic matter (01:12:42)</li> <li>The dynamic changes occurring between clay and organic matter (01:16:19)</li> <li>Does clay always protect organic matter? (01:21:52)</li> <li>Comparing the cation exchange capacity between clays and organic matter (01:23:47)</li> <li>Roots proceed down the path of least resistance (01:27:54)</li> <li>Comparing the surface area of clay vs. the surface area of organic matter (01:29:26)</li> </ul>", "publicationDate": "Wed, 11 Aug 2021 09:00:00 +0000", "duration": "01:34:38", "poster": "https://ssl-static.libsyn.com/p/assets/1/b/7/0/1b70f83437856db5/In_Search_of_Soil_1.jpg", "link": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-17-DavidLaird-FullEpisode.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-17-DavidLaird-FullEpisode.mp3?dest-id=2402825", "size": "136879799", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}