{"version": 5, "show": {"title": "In Search of Soil", "summary": "Exploring the mysteries of soil in search of answers that you can use in your garden or on your farm.  Each week features scientists and experts sharing insights into topics like soil science, composting, cover cropping, biochar, no-till, and fungi, among other things!   In Search of Soil is hosted and produced by Diego Footer.", "poster": "https://ssl-static.libsyn.com/p/assets/1/b/7/0/1b70f83437856db5/In_Search_of_Soil_1.jpg", "link": "http://insearchofsoil.libsyn.com/website"}, "title": "Dr. Jane Fife - Applying Better Soil Microbes | In Search of Soil #16", "subtitle": "Dr. Jane Fife - Applying Better Soil Microbes | In Search of Soil #16", "summary": "<p>In this episode of In Search of Soil, we’re talking to 3Bar Biologic’s Dr. Jane Fife to shed some light on microbial biologics, realistic expectations of what they can do to our soils and our crops, and a little bit about the biological products industry.</p> <p>Dr. Jane Fife is the Chief Science Officer at 3Bar Biologics as well as an Adjunct Faculty at The Ohio State University. With more than twenty years of applied research experience, she is a proven leader in research in agricultural application technologies, biologics, and precision agriculture. Her main points of interest include more targeted delivery of agricultural inputs for safer, more sustainably produced food.</p> <p>More on 3Bar Biologics: <a href=\"https://www.3barbiologics.com/\">https://www.3barbiologics.com/</a></p> <p> </p> <p><span style=\"font-size: 12pt;\"><strong>WATCH FULL EPISODES</strong> </span></p> <p><span style=\"font-size: 12pt;\"><a href=\"https://bit.ly/watchISOS\" title=\"YouTube https://bit.ly/watchISOS\">YouTube https://bit.ly/watchISOS</a></span></p> <p><span style=\"font-size: 12pt;\">Follow Diego <a href=\"https://www.instagram.com/diegofooter\">@diegofooter - https://www.instagram.com/diegofooter</a></span></p> <h2><span style=\"font-size: 12pt;\"><strong>In this episode of In Search of Soil</strong></span></h2> <ul> <li>The limitations of applying biologicals to the seed coat and as a soil surface spray (02:00)</li> <li>Opening the spectrum of microbial biologicals by adjusting the time of application (05:10)</li> <li>Ohio State University and how 3Bar Biologics came to be (07:36)</li> <li>How difficult is it to culture beneficial microbes? (09:22)</li> <li>Dry formulations of microbials (11:08)</li> <li>Efficacy between wet and dry-formulated products (12:28)</li> <li>Regionality and efficacy of microbes (13:40)</li> <li>Realistic expectations in applying microbial biologicals (15:36)</li> <li>A sweet spot where microbes can really help (18:03)</li> <li>How much agricultural practices affect the microbes already present in the soil (22:31)</li> <li>Will there be significant improvements on the crop if there were no application constraints on microbial biologicals? (26:22)</li> <li>How much microbes are taken in by the plant through foliar feeding? (28:48)</li> <li>Effectivity of foliar feeding vs. root feeding (31:08)</li> <li>How much of the biologicals is actually wasted in the soil? (33:07)</li> <li>Why can’t soil microbes stay and proliferate in the soil if they’re already soil-borne? (35:30)</li> <li>Healthiest when there’s a large diversity of microbes (39:12)</li> <li>Soil organisms that proved to be interesting hence 3Bar was born (40:52)</li> <li>What live microbe technology would look like on the farm (43:50)</li> <li>Grow the microbes as close to the point of use as possible (46:25)</li> <li>3Bar’s Biostimulant (47:00)</li> <li>Are microbial biologicals targeted for specific crops? (48:53)</li> <li>Optimum application for microbial biologicals (50:24)</li> <li>For transplanted crops, would it make sense to apply microbials in a nursery setting? (52:06)</li> <li>What information should growers look for when seeking out microbial biologicals? (53:19)</li> <li>Snake oil, regulations, and the agricultural microbials industry (57:10)</li> <li>Having appropriate and realistic expectations with 3Bar’s microbial technology (59:52)</li> <li>Farmers willing to try and experiment in their own farms and see for themselves (01:01:37)</li> <li>Where would the agricultural microbials industry be in 10 years’ time? (01:04:40)</li> <li>The rough cost per acre of application of 3Bar’s microbial technologies (01:06:58)</li> <li>Where to go to learn more about 3Bar, what they’re doing, and what they’re offering (01:07:53)</li> </ul>", "publicationDate": "Wed, 04 Aug 2021 09:00:00 +0000", "duration": "01:10:19", "poster": "https://ssl-static.libsyn.com/p/assets/7/c/9/e/7c9ec6c199e99c9016c3140a3186d450/PODCAST_-_Graphic_1_-_Square.jpg", "link": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-16-JaneFife-FullEpisode.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-16-JaneFife-FullEpisode.mp3?dest-id=2402825", "size": "101862327", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}