{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "55: Enlightened agriculture, sustainable economies, and regenerative businesses", "subtitle": "55: Enlightened agriculture, sustainable economies, and regenerative businesses", "summary": "As we bring this episode to you, we know that the Coronavirus pandemic is putting many of the farmers and growers out there are under more pressure than ever to provide food for your local communities and to rapidly find new markets for your produce – all whilst being concerned with the health of those around you. So we wanted to take a moment to say as ever we and so many others are grateful for all the work you do: thank you - Farmerama is made for you! \n\nThis month, we go back to the Oxford Real Farming Conference (ORFC) one last time, this time to focus on the economic system and ask the question: what form does our economy need to take if we want to support a regenerative farming future? To start helping us answer this question, we hear from biologist, author and co-founder of the ORFC Colin Tudge, who helps us understand today’s dominant economic paradigm, and shares his vision for an economy that supports regenerative farming.\n\nNext, we speak to Tony Greenham, a finance professional, economist, sustainability consultant and Executive Director at South West Mutual, who explains how, in his view, the economy has failed us and what he thinks a more sustainable economy might look like. We share some of the final episode of CEREAL, the 6-part series we released at the end of last year, to illustrate how everything Colin and Tony spoke about is embedded in our food systems, including in our bread.\n\nTwo of the key characters in CEREAL were baker and regenerative retailer at Small Food Bakery, Kimberly Bell, and Fred Price, farmer at Gothelney Farm. They both run regenerative businesses that produce food to nourish people, bring joy, promote healthy lifestyles and build communities. We hear from them about what shifting towards regenerative business and a regenerative economy means to them. \n\nThis episode of Farmerama was made by Abby Rose, Louis Hudson and Hanna Soderlund. With me Jo Barratt and Katie Revell. We’re extremely grateful to our Patreon supporters, who help us make the show. If you'd like to support Farmerama, visit patreon.com/Farmerama. Community support is provided by Hanna Soderlund, Fran Bailey, Annie Landless, Eliza Jenkins and Olivia Oldham. Our theme music is by Owen Barratt.", "publicationDate": "Sun, 26 Apr 2020 13:51:01 +0000", "duration": "00:37:02", "poster": "https://i1.sndcdn.com/artworks-Tbd9G3rY8xtxPf6g-rCX21w-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/55-enlightened-agriculture-sustainable-economies-and-regenerative-businesses", "audio": [{"url": "https://feeds.soundcloud.com/stream/807498817-farmerama-radio-55-enlightened-agriculture-sustainable-economies-and-regenerative-businesses.mp3", "size": "35560384", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}