{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "69: COP 26: Glasgow growing, participatory action research and migrant worker solidarity", "subtitle": "69: COP 26: Glasgow growing, participatory action research and migrant worker solidarity", "summary": "This month, we’re heading to Glasgow to bring you three stories from the fringes of the COP26 conference.\n\nWe’ll hear from Tenement Veg about the challenges of growing food in Scotland’s largest city. We’ll highlight Nourish Scotland’s involvement at the conference, and speak to Warami Jackson and Marlon Opigo, two participants in Feedback’s “participatory action research”- an innovative and inclusive project researching young people’s experience of the food system. We’ll visit the Landworkers’ Alliance’s agroecology hub, and speak to the LWA’s Catherine McAndrew about the urgent call for solidarity with migrant workers.\nThis episode of Farmerama was produced by Katie Revell, Olivia Oldham and Abby Rose.\n\nWe’re very grateful to those of you that support us and allow us to bring you these stories every month. Even the smallest contribution makes a big difference to us. If you’d like to become a supporter, visit patreon.com/Farmerama\n\nLinks:\n‘Young Seeds for your Thoughts: Towards a Just Food System’.\nwww.youtube.com/watch?v=HNkYxX90O7Y", "publicationDate": "Sun, 28 Nov 2021 16:50:49 +0000", "duration": "00:41:51", "poster": "https://i1.sndcdn.com/artworks-nJK4U1hzt9N3FcNb-lzG6AQ-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/69-cop-26-glasgow-growing-participatory-action-research-and", "audio": [{"url": "https://feeds.soundcloud.com/stream/1168271236-farmerama-radio-69-cop-26-glasgow-growing-participatory-action-research-and.mp3", "size": "40182528", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}