{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "71: Continuous Cropping, Land For Who and the Magic of Woodchip", "subtitle": "71: Continuous Cropping, Land For Who and the Magic of Woodchip", "summary": "In this month’s episode, we bring you three conversations with farmers and researchers who spoke at this year’s Oxford Real Farming Conference. \n\nFirst, we hear from John Letts  - a wheat grower and crop developer living in Buckinghamshire, known for growing heritage grains. He joins us to explain Continuous cropping, something that got a lot of attention this year at the ORFC.\n\nNext, we speak to Frances Northrop, who works for the New Economics Foundation and is an associate fellow specialising in local economies. Frances talks to us about a project she worked on last year called 'Land for Who'. She also explores the concept of 'new municipalism' - a global political movement that is all about ordinary citizens claiming power in their local and city governments - and how this relates to land. \n\nFinally, we catch up with Ben Raskin to talk about his new book.‘The Woodchip Handbook’ delves into the magic and potential of woodchip not only as a mulch but also as a way of building soil health and fertility through beneficially increasing the fungal content of the soil.\n\nThis episode of Farmerama was made by Jo Barratt, Abby Rose and Olivia Oldham. A big thanks to the rest of the farmerama team - Katie Revell, Annie Landless, Eliza Jenkins, Fran Bailey and Dora Taylor.", "publicationDate": "Sun, 30 Jan 2022 21:34:41 +0000", "duration": "00:28:48", "poster": "https://i1.sndcdn.com/artworks-xJnDWHgzN9DoqP8Z-r2d3kQ-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/71-continuous-cropping-land-for-who-and-the-magic-of-woodchip", "audio": [{"url": "https://feeds.soundcloud.com/stream/1206747547-farmerama-radio-71-continuous-cropping-land-for-who-and-the-magic-of-woodchip.mp3", "size": "27649670", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}