{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Biophysics of Soil Plant Systems with Arden Andersen", "subtitle": "Biophysics of Soil Plant Systems with Arden Andersen", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Dr. Arden Andersen, who holds a Ph.D. in Agriculture and Biophysics. In this conversation on biophysics, John and Dr. Andersen explore topics such as the role of calcium, soil compaction, pest pressure, and more from the perspective of biophysics and energy.</span></p> <p><span style=\"font-weight: 400;\">Dr. Andersen’s career in agriculture started in childhood on his family’s holistically managed dairy farm. This experience provided him with the daring to question accepted science and to forge new paths. While earning a bachelor’s degree in agriculture, Dr. Andersen noted that his father’s herd suffered from none of the dairy diseases he was studying, allowing him to draw a correlation between disease immunity and herd health. Through further study, he determined that immunity is influenced by nutrition and that this principle is the same for plants and mammals, including humans. Dr. Andersen dove into the world of biophysics, learning from pioneers such as Dr. Philip Callahan, Dr. Dan Skow, Dr. Fritz-Albert Popp, and Dr. Carey Reams, all of whom have had a vast influence on the fields of biophysics and energetics. </span></p> <p><span style=\"font-weight: 400;\">Dr. Andersen reiterates the importance of soil calcium and functional biology to plant health, but from the perspective of the energetic signals the minerals and plants are carrying. He says that calcium is the foundational messenger that allows communication within the plant/soil system at the cellular level and that if calcium is ample, foliar sprays become much more successful and effective. Similar to putting a cheater bar on the end of a wrench to gain additional torque, foliar sprays add the last touches of power to a plant that has a sufficient soil base of nutrition. </span></p> <p><span style=\"font-weight: 400;\">John and Dr. Andersen discuss clay chemistry and clay aging and how this impacts soil compaction. Clay aging is a term derived from the petroleum industry and it describes the process that develops when enough potassium chloride has been applied into the clay matrix to drive out the calcium and magnesium. At this point, the clay collapses and hardens at the molecular level, and soil compacts easily. </span></p> <p><span style=\"font-weight: 400;\">Dr. Andersen warns that high-powered artificially produced electromagnetic frequencies can exhaust antioxidants and essential nutrients. To overcome the negative impact of these frequencies, plants must have a solid foundation of biology to derive nutrition from the soil. He states that plant growth is restricted by energetic limitations, and not by time. The subtle energies that drive information exchange between and within living cells determine how fast that cell can grow. An insufficiency of harmonic energy can lead to an insufficiency of molecular movement. By harnessing these energetic life forces, plants can be grown to maturity much faster. Dr. Andersen notes that plant genetic information is carried by an energetic signature that determines the physical chemistry and describes how stray energetic current causes both plant and animal disease by interfering with the central energy signature of that living organism.</span></p> <p><span style=\"font-weight: 400;\">Dr. Andersen stresses the importance of being in tune with the soil, plants, and life in the field. He reviews the scientific component of communication between plants and the human heart and mind, stating that it’s the life force in plants that we are gaining from the food we eat which keeps us alive. Listen to this episode to explore how understanding energetic life forces can provide the key to gaining enhanced performance from our crop genetics and environment.</span></p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Mon, 13 Apr 2020 20:00:47 +0000", "duration": "01:07:49", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/biophysics-of-soil-plant-systems-with-arden-andersen/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Biophysics_of_Soil_Plant_Systems_with_Arden_Andersen.mp3?dest-id=698390", "size": "132311285", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}