{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Building Soil While Cash Cropping with Loran Steinlage", "subtitle": "Building Soil While Cash Cropping with Loran Steinlage", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Loran Steinlage of Flolo Farms in Iowa. They discuss his experience in relay cropping, interseeding, cover crops, and controlled traffic farming. Loran grows grain crops for seed, has implemented youth programs on the farm, and has experimented with 60-inch corn. Listen for practical advice from a current grain farmer. </span></p> <p><span style=\"font-weight: 400;\">Loran grew up planning to be a livestock farmer like his father, but was hit by a semi at the age of 14, causing him to change his plans. Today Loran grows corn, beans, wheat, rye, barley, buckwheat, sunflowers, and oats. Typically, they do relay cropping and interseeding, though this year they have not been able to do relay cropping due to a freeze in May of their cereal crops. </span></p> <p><span style=\"font-weight: 400;\">In 2006 Loran began interseeding while his whole farm was corn on corn. Through interseeding, he found his way into cover crops and relay cropping. In the fall there are cereal crops such as winter wheat, rye, spring malt barley, or oats. Loran watches for stand quality, sometimes rolling over into corn if the stands aren’t good enough. Otherwise, he sows soybeans at the normal time. Loran uses a 30-inch planter to give more room for the combine. In July winter wheat is harvested, then cereal rye, then malt barley. If there is a window with good weather, they add buckwheat and harvest it and the soybean crop together. </span></p> <p><span style=\"font-weight: 400;\">Loran’s method has long been to focus on seed quality for economic viability. Uniform emergence is the key that ensures all the heads mature at the same time for a high-quality harvest. Once cereal crops dry and re-wet, germination quality goes down, so they try to harvest the cereal as it dries. For a few years, they were making $7-$8 per bushel on malt barley. Food grade wheat can earn a $2-$3 premium, but with grain cleaners the value can be almost doubled. Loran receives a minimum of $10 for cereal rye seed. He utilizes controlled traffic and stays on the tramlines to avoid creating compaction or driving on the crop. </span></p> <p><span style=\"font-weight: 400;\">Controlled traffic has great results in a field, but it requires more forethought and careful management to be successful so it has not been widely adopted. Even if there’s a small yield loss, Loran avoids straying from the tramlines as much as possible. About 5 or 10 farmers participated in a tramline study with Bob Recker, with only Loran interseeding cover crops. The extra biomass in the tramlines was very valuable, and a 60-inch gap provided extremely high quality cover crops. Bob Recker did further testing of his “barcode plot” and saw that the 60-inch gap was significantly better than the 30-inch gap for cover crop production. This year, he plans to relay cereal crops into standing 60-inch corn, which in his experience has yielded equivalent or better to 30-inch corn. He attributes some of that to having a precise planter. He also questions if yield should be the ultimate goal. Loran believes growers around him who sacrifice some yield for grazing days can attain 2-3 months of grazing instead of one, which can substantially lower feed costs. </span></p> <p><span style=\"font-weight: 400;\">Loran believes kids belong in agriculture today, and that it isn’t happening enough. He believes in self-education and the importance of allowing kids to learn on-farm, rather than going off to college. In pursuit of this goal, Loran’s started a 4-H program on his farm and increased field days. Having the children working with soil scientists can inspire them so they want to enter the field, and he’s seen some success stories already. He thinks that more people need to step out of the way and let young people take their place. </span></p> <p><span style=\"font-weight: 400;\">Loran sees the future of agriculture being focused on niche markets. He wants people to build an operation to fill voids in the market, rather than taking other people’s ideas and trying to make them fit their operation. He would change government intervention in agriculture if he could. If inherent risk was returned to farming, he believes competition and innovation would return. He also wants people to learn more about practices used after the Dust Bowl and the Great Depression and to combine those with current knowledge to improve fertility and soil health. </span></p> <p><strong>Resources:<br /></strong><a href=\"https://www.lancasterfarming.com/farming/soil/the-steinlage-way-keep-a-living-plant-on-the-soil-365-days-a-year/article_5287a5d8-6402-5722-96fa-5f68d765c41f.html\"><span style=\"font-weight: 400;\">The Steinlage Way</span></a><br /> <a href=\"https://twitter.com/flolofarms?lang=en\"><span style=\"font-weight: 400;\">Loran Steinlage on Twitter</span></a><br /> <a href=\"https://practicalfarmers.org/2020/02/growing-crops-365-days-a-year-loran-steinlage/\"> <span style=\"font-weight: 400;\">Growing Crops 365 Days a Year - Loran Steinlage</span></a><br /> <a href=\"https://www.agweb.com/article/corn-maverick-cracking-mystery-60-inch-rows\"> <span style=\"font-weight: 400;\">Corn Maverick: Cracking the Mystery of 60-Inch Rows</span></a><br /> <a href=\"https://www.rhizoterra.com/Team\"><span style=\"font-weight: 400;\">Jill Clapperton, Rhizoterra</span></a></p>", "publicationDate": "Tue, 04 Aug 2020 12:06:01 +0000", "duration": "49:21", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/Building_Soil_While_Cash_Cropping_with_Loran_Steinlage.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Building_Soil_While_Cash_Cropping_with_Loran_Steinlage.mp3?dest-id=698390", "size": "96685505", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}