{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Busting food and farming myths - Rob Paarlberg on a scientific approach to food policy", "subtitle": "Busting food and farming myths - Rob Paarlberg on a scientific approach to food policy", "summary": "<div>In a world where food and farming are highly polarized issues, Rob Paarlberg’s approach is to follow the evidence. This has earned him great respect, but also means his well-researched views tend to land him in no-man’s land between traditional industry views and the new food movement.</div><div><br /></div><div>For instance, Rob supports modern commercial farming and the use of fertilizers; however, he’s not a blanket supporter of ‘Big Ag’. He is highly critical of the state of animal welfare in modern American livestock production, but he’s not against eating meat. As an author and Associate in the Sustainability Science program at the Harvard Kennedy School, Rob is renowned for debunking the popular myths about food and farming.</div><div><br /></div><div>In his latest book, <a href=\"https://www.amazon.com/Resetting-Table-Straight-Talk-About/dp/0525656448\" target=\"_blank\">“Resetting the Table: Straight Talk About the Food We Grow and Eat</a>, Rob argues that food policy, rather than farm policy, should be the focus for reform when it comes to the American food system.</div><div><br /></div><div>In this episode, Rob discusses his latest book and:</div><ul><li>Why returning to the ‘old ways’ of farming is not sustainable</li><li>How US farm subsidies make food more, not less, expensive</li><li>The cause of the obesity epidemic in America (and the food policies that could actually make a difference).</li><li>Why the agriculture industry needs to improve its treatment of animals (and the relatively low costs involved).</li></ul><div><br /></div><div>For insights and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/2/10/busting-food-and-farming-myths-with-evidence\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 10 Feb 2021 19:00:00 +0000", "duration": "00:33:13", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/0f9cdf16-6a97-11ec-9291-12fdf81a27ad/images/main.png?1668664904857", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2021/2/10/busting-food-and-farming-myths-with-evidence", "audio": [{"url": "https://backtracks.fm/tenacious/pr/0f93108a-6a97-11ec-9291-12fdf81a27ad/788903.mp3?s=1&sd=1&u=1640995764", "size": "32199141", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}