{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "‘Cereal’ Episode 5: The best thing since sliced bread? Unsliced bread", "subtitle": "‘Cereal’ Episode 5: The best thing since sliced bread? Unsliced bread", "summary": "The UK is the fifth largest economy and has some of the cheapest bread in the world - is that something to be proud of, or is it a convenient outcome of a system that prioritises shareholder profit, fobs off economically deprived people with poor quality food, and throws away a third of what it produces?\n\nIt’s so ingrained in us that cheap food is better for everyone, but in this episode we ask you to stop and really think - are we supporting a system that is efficient for lining the pockets of a few, whilst impoverishing everyone else? \n\nWhat if the real cost is our collective health, and the health of the planet? \n\nBread is not just money, bread is nourishment, deliciousness, companionship, connectedness, pride, politics.\n\nIn this episode we hear from bakers up and down the UK who are redefining the value of bread. Bakers who are making a stand for their communities and the planet.\n\nBakers from some of the most economically deprived areas who are bringing meaning, intention and joy to their baking. Bakers who are being recognised for their craft and sharing the benefits with their local communities.\n\nThis is about food networks, not food chains -- this is about reaching true efficiency that takes into account the whole system (health, environment, waste, community, joy), not just the financial balance sheet.\n\nThe radical changes that bread has undergone are revealing of much wider truths about our relationships with food, to farmers, with the land, the environment, and with each other. If you eat food, you have a stake in this story.\n\nVoices: \nChris MacCormack, Govanhill bread man\nTheo Laffargue, Riverside Bakery, Stirling, Scotland\nBen MacKinnon, E5 Bakehouse, London\nCatriona Milligan, High Rise Bakers,The Gorbals, Glasgow\nRupert Dunn, Torth y Tir, Wales\nKimberley Bell, Small Food Bakery, Nottingham", "publicationDate": "Sun, 22 Dec 2019 14:16:28 +0000", "duration": "00:45:02", "poster": "https://i1.sndcdn.com/artworks-000656830798-2a9vmg-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cereal-episode-5-the-best-thing-since-sliced-bread-unsliced-bread", "audio": [{"url": "https://feeds.soundcloud.com/stream/732304621-farmerama-radio-cereal-episode-5-the-best-thing-since-sliced-bread-unsliced-bread.mp3", "size": "64935646", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}