{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "‘Cereal’ Episode 6: Grain futures", "subtitle": "‘Cereal’ Episode 6: Grain futures", "summary": "We are the bread system. If you eat bread – or any grains – you are part of it. \n\nSo how can we all get involved, and what can we do to usher in the new grains movement to build joy, nutrition and resilience in all of our communities?\n\nIn this final episode, we explore what a more efficient, nutritious, regenerative and joyful bread system might look like. We hear some of the ways people are coming together and building networks to strengthen the movement in the UK and further afield.\n\nIt’s clear that in this beautifully complex, entangled system, even just a conversation can spark much wider change. This is a story of hope and a blueprint that has the potential to cause reverberations far beyond bread. It turns out that bread is political – and you, too, can take a stand for the world you want to live in. \n\nThis might be our final episode of Cereal, but it isn’t the end – it’s just the beginning! Join the new grains movement. Talk to your local bakers, seek out local millers, thank your farmers, be open-minded, be curious. \n\nA huge thank you to everyone who’s contributed to Cereal. As well as the voices you hear in this episode, many more conversations have helped to shape the series. \n\nThanks to Andrew Whitley (Scotland the Bread), Kim Bell (Small Food Bakery and UK Grain Lab), Mark Lea (Greenacres Farm), Fred Price (Gothelney Farmer), Steven Jacobs (Organic Farmers & Growers), Ben MacKinnon (E5 Bakehouse), Anne Parry (Felin Ganol), Rupert Dunn (Torth y Tir), Josiah Meldrum (Hodmedods), Tomaso Ferrando (University of Antwerp) and Fintan Keenan. Thanks also to the Lost Revellers and everyone who came to the Nottingham Cereal launch harvest party and lent their voices to make the Flour Ambassador's Pledge.\n\nThis series was made possible thanks to the generosity of the Roddick Foundation. Please listen, share, review and subscribe, and support the farmers instigating change. All six episodes can be found on Soundcloud and all podcasting platforms. And if you’d like to support Farmerama, visit patreon.com/farmerama.\n\nCereal is produced and edited by Katie Revell, with support from Abby Rose and Jo Barratt. Suzie MacCarthy and Hanna Söderlund also worked on the series. Our theme music is by Owen Barratt. \n\nVoices:\nAndrew Whitley, co-founder of the Real Bread Campaign, and Scotland the Bread\nKimberley Bell, founder Small Food Bakery, Nottingham\nSteven Jacobs, Business Development Manager, Organic Farmers and Growers\nBen MacKinnon, founder E5 Bakehouse, London\nAnne Parry, Felin Ganol Watermill, Wales, and Welsh Grain Forum\nRupert Dunn, Torth y Tir Community-Supported Peasant Bakery, Wales\nJosiah Meldrum, co-founder Hodmedods\nMark Lea, Greenacres Farm, Shropshire\nFred Price, Gothelney Farm, Somerset\nTomaso Ferrando, Bread as a Commons\nFintan Keenan, farmer, miller and engineer, Denmark/Ireland", "publicationDate": "Sun, 29 Dec 2019 12:33:32 +0000", "duration": "00:44:27", "poster": "https://i1.sndcdn.com/artworks-000659623585-qjm42c-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cereal-episode-6-grain-futures", "audio": [{"url": "https://feeds.soundcloud.com/stream/735351169-farmerama-radio-cereal-episode-6-grain-futures.mp3", "size": "64086770", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}