{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Changing the Risk Profile of Agriculture: a farmer's perspective on parametric insurance", "subtitle": "Changing the Risk Profile of Agriculture: a farmer's perspective on parametric insurance", "summary": "<p>We recently launched a three-episode deep dive into the future of risk and insurance in agriculture. Over the course of the series, we heard from one listener who offered to share his experience using novel insurance products to manage the risks of both too little and too much rainfall in his own farming operation. This from-the-field perspective was packed with insights, and was such a powerful contribution to our learning that we asked his permission to use the audio for this episode.</p><p><a href=\"https://mobile.twitter.com/tomferg88\">Tom Ferguson</a> is a farmer in Northern New South Wales, Australia, and this week you’ll hear a conversation between him and Tenacious Ventures Co-Founder <a href=\"https://www.linkedin.com/in/jmatthewpryor/\">Matthew Pryor</a>. They speak about:</p><ul><li>Tom’s specific exposure to climate-risk, and why this has led to him exploring new options for insurance</li><li>His process for collecting data, identifying high-impact risks to hedge against, and using this data to strike tailored, parametric policies with insurers</li><li>What the impact of using more data on the farm can be for new insurance products, and what’s holding back the integration</li><li>His adoption of new agtech on the farm, and what factors enabled or inhibited uptake within the business.</li></ul><p>For more information and resources, visit our <a href=\"https://tenacious.ventures/insights\">website</a>.<br /><br /></p>", "publicationDate": "Wed, 07 Sep 2022 06:00:00 +0000", "duration": "00:33:25", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/14f9ecf8-2e4e-11ed-8e85-0effcd285ff3/images/main.png?1668664899066", "link": "https://tenacious.ventures/podcast-episodes/changing-the-risk-profile-of-agriculture-a-farmers-perspective-on-parametric-insurance", "audio": [{"url": "https://backtracks.fm/tenacious/pr/14f66984-2e4e-11ed-8e85-0effcd285ff3/ep147_parametricinsurance_tomfarmer.mp3?s=1&sd=1&u=1662531401", "size": "48172689", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}