{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Circular Bio-Economy of Wellbeing with Prof. Jacqueline McGlade (UCL) | Ep. 19", "subtitle": "Circular Bio-Economy of Wellbeing with Prof. Jacqueline McGlade (UCL) | Ep. 19", "summary": "<p>My guest in this episode is the inspiring Jacquie McGlade, a professor of sustainability and resilience at University College London and Strathmore University in Kenya. She was formerly the Chief Scientist at the United Nations Environment Program and the Executive Director of the European Environment Agency for 10 years. Though originally from the UK, Jacquie now lives in the Masai Mara with her husband and their community.</p><p>In the episode, Jacquie shares meaningful insights into her life and career, as well as her views on how effective leadership, courage and community will shape the transition towards a more sustainable world.</p><p>The topics we cover are:</p><ul><li>The story of how Jacquie came to live in the Masai Mara in Kenya</li><li>How food insecurity and climate change are affecting their lives</li><li>How they’re adapting to these challenges</li><li>The biggest changes we need to make as humanity for sustainability</li><li>The circular bio economy of wellbeing</li><li>What kind of leadership we need to transition towards a circular bio economy of wellbeing</li><li>What personal development future leaders need to engage with</li><li>What meditation taught Jacquie about communication and conflict resolution</li><li>Where she found courage in difficult or dangerous situations</li><li>People and books that have inspired Jacquie on her path</li><li>Two projects that Jacquie is inspired by working with communities in the Masai Mara on regenerative forestry and porous alpha water purification</li><li>How the world and especially in the area of science and academia was different for a woman when she started her career</li></ul><p>Further information:<br /><br />To watch further talks from Jacquie on the topics discussed here check out: <a href=\"https://www.gresham.ac.uk/professorships/environment-professorship/\">https://www.gresham.ac.uk/professorships/environment-professorship/</a></p><p>Find more information about Jacquie on <a href=\"https://www.linkedin.com/in/jacqueline-mcglade-541a1178/\">Linkedin</a></p><p>Need support on your leadership journey? Join the next cohort of women in the Be The Change group coaching and leadership training program starting in September 2022 - get on the waitlist here: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a></p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a></p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Mon, 14 Mar 2022 10:00:00 +0100", "duration": "2393", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/10245206-circular-bio-economy-of-wellbeing-with-prof-jacqueline-mcglade-ucl-ep-19.mp3", "size": "28761281", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}