{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Collaboration, Spirit and Change, Perspectives from Ray Archuleta", "subtitle": "Collaboration, Spirit and Change, Perspectives from Ray Archuleta", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John Kempf interviews Ray Archuleta, an outspoken proponent of healthy soil systems and the founder of Understanding Ag and the Soil Health Academy. Ray has spent decades working in conservation agriculture and, in this episode, he describes his journey from seeing nature as a competitive entity, in which all else should be killed in order for the desired crop to survive, to his understanding today that nature thrives on diversity and collaboration. </span></p> <p><span style=\"font-weight: 400;\">Ray describes how new science and technology have identified many examples of collaboration in agroecology, like arbuscular mycorrhizal fungi, which share water resources and transport energy and nutrients from organism to organism. Even under stress conditions, these microbes provide water to the plant, an example of nature sharing resources rather than competing. He provides examples of research that illustrate fields with a diversity of species showing greater resilience and yields than monoculture plantings.</span></p> <p><span style=\"font-weight: 400;\">Ray attended graduate school at New Mexico State University, after which he served as a livestock specialist in the Peace Corps and then as a conservation agronomist with the NRCS. During Ray’s early years working in conservation agriculture, he started asking difficult questions: “Why is sediment the number one water quality problem in the nation? Why does it take so many acres to make a living?” Through these questions and more, reading books such as Allan Savory’s Holistic Management, and coming to Gabe Brown’s ranch in 2007, Ray had revelatory moments, realizing that robust soil ecology is the key to solving many of the challenges plaguing farms today.</span></p> <p><span style=\"font-weight: 400;\">On Gabe’s farm, Ray observed an ideal example of a thriving ecology. When he realized the crops had received no support from nitrogen or chemical fertility applications, he began to dig deep, looking for research that would explain how this ecosystem was working. What he found was that nature thrives when collaborations between compatible organisms are fostered, illustrated not only in agronomic studies such as Brown University’s paper on Stress Gradient Hypothesis but also in the real-world operations of early-adopting farmers.</span></p> <p><span style=\"font-weight: 400;\">John and Ray describe the collaboration taking place between plants, microbes, and bacteria in a healthy ecosystem as descriptive of a larger collaboration between farmers who are practicing these methods and sharing their information with other growers. Ray describes his own journey from viewing farming as drudgery to learning how the relationship between the living organisms works and feeling like he was a part of that relationship. </span></p> <p><span style=\"font-weight: 400;\">The conversation takes a deep dive into this farmer-soil-plant relationship, providing growers with the history of the soil health movement, the roles that policy, society, and agriculture play in the broader global health context, and the encouraging view on the vast gains that have been made in the field of soil health since the beginning of Ray’s career as a soil conservationist thirty years ago.</span></p> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://understandingag.com/home\"><span style=\"font-weight: 400;\">Understanding Ag</span></a></li> <li><a href=\"https://understandingag.com/soil-health-academy\"><span style=\"font-weight: 400;\">The Soil Health Academy</span></a></li> <li><a href=\"https://news.brown.edu/articles/2013/01/ecostress\"><span style=\"font-weight: 400;\">The Stress Gradient Hypothesis</span></a></li> <li><a href=\"https://savory.global/marketplace/?gclid=CjwKCAjw1v_0BRAkEiwALFkj5mwTgpqQEby0XGSlpmYy4W3VgAxbRpn8NevrrVbHx4iwggV20uS8axoC7_8QAvD_BwE\"> <span style=\"font-weight: 400;\">Holistic Management by Allan Savory</span></a></li> <li><a href=\"https://brownsranch.us/\"><span style=\"font-weight: 400;\">Gabe Brown’s Ranch</span></a></li> </ul> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Tue, 28 Apr 2020 12:20:51 +0000", "duration": "52:28", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/collaboration-spirit-and-change-perspectives-from-ray-archuleta/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Collaboration_Spirit_and_Change__Perspectives_from_Ray_Archuleta.mp3?dest-id=698390", "size": "103292869", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}