{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Conserving Nature and Our Wellbeing with Kavita Prakash-Mani | Ep. 12", "subtitle": "Conserving Nature and Our Wellbeing with Kavita Prakash-Mani | Ep. 12", "summary": "<p>My guest on the show this week is the wonderful Kavita Prakash-Mani. I had the pleasure of chatting to Kavita right before she was leaving her role as Global Conservation Director at WWF to embark on a professional sabbatical. Stepping back from it all to get some perspective. Naturally, we talked about why taking breaks is crucial, especially when you’re working on topics such as conservation or climate change which can sometimes be overwhelming. Kavita also shared her insights on the interface between conservation and the pandemic and why it’s important to integrate sustainability into the economic recovery packages. Finally, I also got to pick her brain on what each of us can do in our personal and professional lives to contribute to a better world.</p><p>Since talking to Kavita, she has moved to Singapore where she is now the CEO of Mandai Nature, an NGO dedicated to protecting threatened species, nurturing healthy ecosystems and creating vibrant communities where wildlife and people can thrive and co-exist.</p><p>The topics we chat about are:</p><ul><li>Why periodically taking a break from it all is so important to get perspective and reset</li><li>The insights and impacts from the range of fascinating projects Kavita worked on during her time at WWF</li><li>Why WWF has started focusing more on the consumer side of environmental problems</li><li>How Kavita has personally changed her behaviour as a result of her work in conservation and sustainability</li><li>The interface between zoonotic diseases like Covid-19, our food consumption and nature conservation and what action we need to take to reduce the risk of future pandemics</li><li>How we can integrating sustainable practices into the economic recovery packages</li><li>How growing up in India has influenced her career path</li><li>Kavita’s advice for people just starting their careers in sustainability</li><li>Important leadership attributes needed to tackle big global challenges</li><li>How Kavita tried to juggle her own wellbeing while working on overwhelming global challenges</li></ul><p>Further information: </p><p>Find some more information about Kavita at: <a href=\"https://events.globallandscapesforum.org/speaker/kavita-prakash-mani/\">https://events.globallandscapesforum.org/speaker/kavita-prakash-mani/</a></p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts:</p>", "publicationDate": "Tue, 18 May 2021 15:00:00 +0200", "duration": "1894", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/8540962-conserving-nature-and-our-wellbeing-with-kavita-prakash-mani-ep-12.mp3", "size": "22773821", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}