{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 4", "subtitle": "Cultivating Justice: Episode 4", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nEpisode 4 is hosted by Hester Russell and Zoe Miles, who are both from Out on the Land (OOTL), and also involved in an emerging grower’s union. In this episode, we hear more of Jass Butt and Hari Byles’s music made from recordings inside a wormery and a compost heap in East London. We also hear another clip from a a performance by artist Sin Wai Kin, commissioned by the Queer Ecologies collective. Our chorus of voices returns, reflecting on the relationships and congruences between plants and queerness. \n\nWe also hear from Natalie Tamburrini, who talks about her experience of working on a farm as an autistic person as part of a project called Eco Talent, and shares her ideas on how to make farms – and workplaces in general – more just, accessible and inclusive. She shares part of an open letter she has written to neurotypical society. \n\nThen, we chat with Maggie Cheney of Rock Steady Farm in upstate New York. They discuss how they are centering care in their work on the farm, and consider how this could be a way of queering our approach to landwork.\n\nThe Cultivating Justice podcast series is made by Sam Siva, Katie Revell, Hester Russell, Dora Taylor, Abby Rose and Nadia Mehdi. This episode featured conversations with Natalie Tamburini and Maggie Cheney; reflections from our chorus of voices – Tinisha Williams, Sasha, a.k.a. MindYourOwnPlants, Dani Foster, Dav Singh, Anna Barrett, and Nancy Winfield; clips from a performance by Sin Wai Ki mixed for the Microbe Disco and a piece from Jass Butt and Hari Byles. \n\nOur series music is by Taha Hassan. Our artwork is by @Blkmoodyboi.\n\nThank you to our funders, Farming the Future and the Roddick Foundation. And a big thank you to everyone who’s contributed in any way!\nVisit landworkersalliance.org.uk/cultivating-justice/ to find out more.\n\nHester and Zoe referenced an emerging growers’ union they are involved. Here Hester has shared a bit more information about it and links to get in touch if you are interested: “A union of landbased employees has been forming since the start of 2022. New name tbc! Together we aim to provide support for grievances, counter isolation, increase the accountability of employers, fight for better standards and to build power and solidarity across the landworking and other union movements. See our full aims here. https://docs.google.com/document/d/1RiJO5UekAXOeGPxKBnhGyjaACnWq8HeWM_-K5uBfyiU/edit?usp=drivesdk\nThis union is still very young and welcomes any landbased worker who is not an employer or a manager to join our conversations. At the moment we are conducting a workers enquiry as well as forming and strengthening our group processes.\nJoin us on discord to say hi and find out more https://discord.gg/FH9QAS42WD“", "publicationDate": "Sun, 17 Jul 2022 18:00:18 +0000", "duration": "00:48:24", "poster": "https://i1.sndcdn.com/artworks-sC0jBLDUuOxba1wX-HQ7DnA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-4", "audio": [{"url": "https://feeds.soundcloud.com/stream/1306825189-farmerama-radio-cultivating-justice-episode-4.mp3", "size": "46476288", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}