{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 6", "subtitle": "Cultivating Justice: Episode 6", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nIn the final episode of this series, our producer, Katie Revell, hosts alongside LION’s Sam Siva and OOTL’s Hester Russell, who add their reflections to the pieces throughout the episode. First, psychotherapist and grower Srikanth Narayanan shares their thoughts about the fluid ways in which we can see our relationship with land, other living creatures, plants and the natural environment. They discuss how to reconnect with the natural world as something that is not outside of us, and how trauma can be addressed and healed through our relationships to land.\n\nNext, Farmerama’s Dora Taylor and Abby Rose talk about a dissertation that Dora wrote about Black farmers in the UK. The dissertation explores the relationships between the cultural practices of Black farmers and the mainstream agroecological movement. Abby and Dora unpick themes of racial identity, the use of language around agroecological methods, and the importance of centering joy.\n\nTowards the end of the episode, we hear from our chorus of voices, who reflect on home, belonging and rurality. And finally, Sam Siva shares an emotive visioning piece, inviting us to imagine the world that we are working towards, one that centres queer, anti-racist and reparative frameworks, challenges systems of oppression, and fundamentally changes the structural experiences of marginalised groups.\n\nWe also hear a re-worked traditional folk song, and a performance piece by artist Sin Wai Kin.\n\nThe first two zines from the Cultivating Justice project, ‘TransPlants’ and ‘Gourds, Banjos and Calalloo’, are available to order now here, on LION’s website. \n\nThe Cultivating Justice podcast series is made by Abby Rose, Dora Taylor, Katie Revell, Nadia Mehdi, Sam Siva, and Hester Russell. This episode featured contributions from Srikanth Narayanan, Dora Taylor and Sam Siva; reflections from Philomena de Lima, Maymana Arefin, Sasha, a.k.a. MindYourOwnPlants, Dani Foster, Tinisha Williams, Anna Barrett, and Nancy Winfield; music by Eggclab 7 and Bianca Wilson, a.k.a. Island Girl; along with performance art by Sin Wai Kin.\n \nOur series music is by Taha Hassan, and our artwork is by @Blkmoodyboi. \n\nThank you to our funders, Farming the Future and the Roddick Foundation. And a massive thank you to everyone who’s contributed in any way!\n\nVisit landworkersalliance.org.uk/cultivating-justice to find out more.", "publicationDate": "Sun, 31 Jul 2022 16:59:43 +0000", "duration": "01:00:32", "poster": "https://i1.sndcdn.com/artworks-s59brrczyraJK9mN-ChjkWw-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-6", "audio": [{"url": "https://feeds.soundcloud.com/stream/1315252885-farmerama-radio-cultivating-justice-episode-6.mp3", "size": "58116480", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}