{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Designing Crops to Change the Plant-Based Food System - Matt Crisp, Benson Hill", "subtitle": "Designing Crops to Change the Plant-Based Food System - Matt Crisp, Benson Hill", "summary": "<div>Benson Hill is designing crops and ingredients for some of the world’s most popular plant-based food brands. But the company has no intention of becoming a brand itself. Instead, it’s focused on revolutionizing the entire food system, from how plants are grown, to what they taste like, to the range of crop varieties on offer.</div><div><br /></div><div>Founder and CEO, <a href=\"https://www.linkedin.com/in/mattcrisp/\" target=\"_blank\">Matt Crisp</a>, started <a href=\"https://bensonhill.com/\" target=\"_blank\">Benson Hill</a> nearly a decade ago as a plant biology company, using analytics and machine learning to increase yields. Now it has grown to become a technology platform as well as a vertically integrated food and ingredients business, designing high protein soybeans and yellow peas to fuel the growing plant-based protein industry.</div><div><br /></div><div>In this episode, Matt shares:</div><ul><li>His journey from venture capital in the life sciences industry, to becoming an agtech startup founder.</li><li>How the business model of Benson Hill has evolved and why it’s betting on the growth of the plant-based protein industry.</li><li>How to involve farmers in testing crops and products on a commercial scale so growers benefit, as much as the company.</li><li>Benson Hill’s recent SPAC deal and upcoming public listing on the New York Stock Exchange.</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div><div><br /></div><div>Also, we want to hear from YOU! We’re planning our 100th episode and are looking for your stories about how you have used any of the agtech or food innovation ideas discussed on this podcast in your business or workplace. Did it work? Or did it fail?</div><div><br /></div><div>You can record a short voice message by following the link on our website <a href=\"https://www.agtechsowhat.com/\" target=\"_blank\">here</a>, and you might just end up on the show!</div>", "publicationDate": "Wed, 25 Aug 2021 20:01:00 +0000", "duration": "00:40:46", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/f6026cc4-6a96-11ec-b812-12fcae752039/images/main.png?1668664903016", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system", "audio": [{"url": "https://backtracks.fm/tenacious/pr/f5fb306c-6a96-11ec-b812-12fcae752039/894522.mp3?s=1&sd=1&u=1640995722", "size": "39444877", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}