{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Developing Disease Suppressive Soil with Jill Clapperton", "subtitle": "Developing Disease Suppressive Soil with Jill Clapperton", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John Kempf interviews Dr. Jill Clapperton, a plant physiologist with an intuitive understanding of the workings of the rhizosphere and an abundance of metaphors that clearly explain these mechanisms. Dr. Clapperton worked as the Rhizosphere Ecologist at AgriFood Canada and more recently started her own company, Rhizoterra, where she researches agronomic practices and develops technologies for scientific on-farm decision making.</span></p> <p><span style=\"font-weight: 400;\">John and Dr. Clapperton delve into the science of the rhizosphere, discussing how the plant drives and controls the actions that transpire there. Each plant species exudes its own signature of carbon compounds, including sugars, amino acids, lipids, nucleic acids, and other compounds, which Dr. Clapperton refers to as ‘carbon skeletons’. The plant then works with the rhizosphere to add the ‘meat’ of mineral nutrients, oxygen, hydroxyl groups, and more to make the long or short carbon chain ‘skeletons’ functional. Dr. Clapperton describes the function of these carbon chains as having multiple “command lines” or calls to action, available in their service of the plant. These actions include things such as calling in nematodes to parasitize insect larvae that are feeding on the roots of the plant, or calling in nitrogen-fixing bacteria if the plant is a legume. </span></p> <p><span style=\"font-weight: 400;\">Dr. Clapperton also details how the nutrient density of a crop varies based on the cover crop species grown prior to the crop. The root exudates of different plant species develop entirely different colonies of soil fauna to bind the nutrition they need and deliver it to the plant. Because of this, a multi-species cover crop will provide a greater number of different nutrients available in the soil to the following crop. Dr. Clapperton outlines a detailed list of the crops with a compatible rhizobium; for example corn and canola rhizobia are incompatible.</span></p> <p><span style=\"font-weight: 400;\">Dr. Clapperton also describes the various forms that photosynthates can take within the plant structure, underscoring the need for a robust photosynthesis cycle. As a metaphor, Dr. Clapperton suggests it’s like starting with the train engine, which is the photosynthate, and then continuing to add cars onto the train by building these very different molecules from photosynthesis. In the complicated plant/mycorrhizae relationship, the mycorrhizae may need slightly more acidic root exudates in order to grow its hyphae, so it gathers minerals and transports them into the plant, trading them for more amino acids and carboxylic acids and organic acids. Scenarios occur where secondary plant compounds used for fighting disease are made, and if the plant doesn’t need them, they will be broken down and redeveloped into other compounds. </span></p> <p><span style=\"font-weight: 400;\">In addition, Dr. Clapperton describes how microbes seem to “hoard” amino acids and mineral elements and that if the soil fauna contained only microbes they would out-compete the plant for nutrients. Thus, predator/prey relationships come into play in which the plant calls for other organisms such as bacteria and fungi to eat and digest the microbes, making the nutrients being held by the microbes available for the plant. She describes the methods plants use to continually assess their needs and send chemical signals to the rhizosphere. For example, if there’s an aphid on the leaves, the plant sends a signal to ramp up secondary metabolite production to lignify the leaves.</span></p> <p><span style=\"font-weight: 400;\">Dr. Clapperton’s latest research focuses on maintaining a preventative environment in plants, finding and replicating the factors that lead to plant resistance to disease and pest attack. For example, nematodes trying to puncture the roots of an onion crop can be parasitized by fungi, and insects trying to eat the roots can be preyed upon by nematodes. Dr. Clapperton is researching these interactions and learning how we can develop the conditions for them to occur. Learn more about her research on</span> <a href=\"https://www.rhizoterra.com/\"><span style=\"font-weight: 400;\">the Rhizoterra website</span></a><span style=\"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Listen to learn:</span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How to switch plants from dependence on spoon-fed sugars to a healthy relationship with the soil rhizosphere.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How feeding sugars causes unhealthy behavior in the rhizosphere that detracts from plant disease resistance.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Why creating an environment where roots can grow rapidly inhibits plant disease incidence.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Which plants develop rhizobia that work well with each other, and which plants to avoid planting together.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How to grow crops with a proactive immunity so they acquire defense systems in place against pests. </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How to work with research organizations to measure the efficacy of new practices, and why it is critical to measure yield and quality results comparisons.</span></li> </ul> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://www.amazon.com/Physiological-Plant-Ecology-Walter-Larcher-dp-3540435166/dp/3540435166/ref=mt_hardcover?_encoding=UTF8&amp;me=&amp;qid=\"> <span style=\"font-weight: 400;\">Physiological Plant Ecology by Walter Larcher</span></a></li> <li><a href=\"https://www.amazon.com/Mineral-Nutrition-Disease-Lawrence-Datnoff/dp/0890543461/ref=sr_1_2?crid=2USYRBN9W7OT3&amp;dchild=1&amp;keywords=mineral+nutrition+and+plant+disease&amp;qid=1585148539&amp;s=books&amp;sprefix=mineral+nutrition+and+pl,stripbooks,219&amp;sr=1-2\"> <span style=\"font-weight: 400;\">Mineral Nutrition and Plant Disease by Dr. Don Huber</span></a></li> <li><a href=\"https://www.amazon.com/Mineral-Nutrition-Special-Publications-Microbiology/dp/0124735436/ref=sr_1_2?dchild=1&amp;keywords=nutrition+of+higher+plants&amp;qid=1585148592&amp;s=books&amp;sr=1-2\"> <span style=\"font-weight: 400;\">Mineral Nutrition of Higher Plants by Horst Marschner</span></a></li> <li><a href=\"https://www.youtube.com/results?search_query=gabe+brown\"><span style=\"font-weight: 400;\"> Gabe Brown on YouTube</span></a></li> <li><a href=\"https://www.youtube.com/results?search_query=jill+clapperton\"><span style=\"font-weight: 400;\"> Dr. Jill Clapperton on YouTube</span></a></li> <li><a href=\"https://www.youtube.com/results?search_query=Kris+Nichols\"><span style=\"font-weight: 400;\"> Dr. Kris Nichols on YouTube</span></a></li> <li><a href=\"https://www.youtube.com/results?search_query=christine+jones\"><span style=\"font-weight: 400;\"> Dr. Christine Jones on YouTube</span></a></li> <li><a href=\"https://www.acresusa.com/products/for-the-love-of-soil\"><span style=\"font-weight: 400;\"> For the Love of Soil: Strategies to Regenerate our Food Production Systems by Nicole Masters</span></a></li> <li><a href=\"https://www.amazon.com/Environmental-Science-Sustainability-Daniel-Sherman/dp/0393422100\"> <span style=\"font-weight: 400;\">Environmental Science and Sustainability by Daniel Sherman and David Montgomery</span></a></li> </ul> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Tue, 31 Mar 2020 20:23:07 +0000", "duration": "01:03:52", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/developing-disease-suppressive-soil-with-jill-clapperton/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Developing_Disease_Suppressive_Soil_with_Jill_Clapperton.mp3?dest-id=698390", "size": "123906959", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}