{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Diversity and Resilience in our Food Systems and our Leadership with Louise Mabulo (Founder The Cacao Project, The Philippines) | Ep. 17", "subtitle": "Diversity and Resilience in our Food Systems and our Leadership with Louise Mabulo (Founder The Cacao Project, The Philippines) | Ep. 17", "summary": "<p>My guest this week is Louise Mabulo - chef, farmer, and founder of the Cacao project, a social venture and agroforestry project working with farmers in the Philippines. At just 23 years old, she’s a Forbes Asia 30 Under 30 list maker, a  UN Environment Program Young Champion of the Earth,  and Outstanding Farmer of the Year 2018 in the Philippines. As a chef, Louise won the Best Dessert in Asia Award at the Disciples des Escoffier Young Talent Trophy and was a finalist in the TV cooking show Junior MasterChef.<br /><br />In our conversation, Louise shares her story on how she entered the world of food at a very young age, how her upbringing influenced her career from the kitchen to the field and how she founded the Cacao project after a typhoon devastated the region where she grew up. We explore the intersections of traditional and modern knowledge, and how generations can learn from each other when it comes to food systems and leading change. <br /><br />The topics we cover are:</p><ul><li>Louise’s story and how she got connected with food from a very young age</li><li>How an extreme weather event motivated her work with the Cacao Project</li><li>The goals of the Cacao Project - from sustainable agriculture to local value adding </li><li>Challenges for farmers in the Philippines and how the food system can be transformed to be more resilient </li><li>How being homeschooled influenced her attitude towards taking initiative and solving problems </li><li>What different generations can learn from each other when they collaborate The opportunities at the intersection of traditional and modern knowledge </li><li>How social stigmas about farming are engrained in society and the school system in the Philippines </li><li>How they are using Farmer-Field-Schools to tackle this stigma and offer innovative education </li><li>How Louise juggles the different roles she has as a chef, farmer, entrepreneur and activist</li><li>How Louise uses storytelling and public speaking in her work</li><li>The way that Louise’s understanding of leadership has changed along the way The topic of gender in the food system and women Louise looks up to</li></ul><p><b>Further information: </b></p><p>Find more information about Louise on her website: <a href=\"https://louisemabulo.com/\">https://louisemabulo.com/   </a><br />Read all about the Cacao Project here: https://louisemabulo.com/the-cacao-project  <br />You can follow her on Instagram @louisedgmabulo </p><p>If you are interested in food and sustainability and what you can do to create change, you might want to: </p><p>&gt;Join the next round of Be The Change, a leadership training and coaching program for aspiring women leaders. Applications closing soon: <a href=\"https://www.thegreatfull.com/bethechange\">https://www.thegreatfull.com/bethechange </a></p><p>&gt;Read The Great Full - Sustainable Eating with Purpose and Joy (including 70 vegetarian and plant based recipes along with inspiring stories of changing our food system!): <a href=\"https://www.thegreatfull.com/book\">https://www.thegreatfull.com/book </a></p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/ </a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts! </p><p> </p><p><br /><br /><br /></p>", "publicationDate": "Fri, 28 Jan 2022 18:00:00 +0100", "duration": "2272", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/9969889-diversity-and-resilience-in-our-food-systems-and-our-leadership-with-louise-mabulo-founder-the-cacao-project-the-philippines-ep-17.mp3", "size": "27311453", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}