{"version": 5, "show": {"title": "In Search of Soil", "summary": "Exploring the mysteries of soil in search of answers that you can use in your garden or on your farm.  Each week features scientists and experts sharing insights into topics like soil science, composting, cover cropping, biochar, no-till, and fungi, among other things!   In Search of Soil is hosted and produced by Diego Footer.", "poster": "https://ssl-static.libsyn.com/p/assets/1/b/7/0/1b70f83437856db5/In_Search_of_Soil_1.jpg", "link": "http://insearchofsoil.libsyn.com/website"}, "title": "Dr. Paul Zorner - Soil Microbes | In Search of Soil #13", "subtitle": "Dr. Paul Zorner - Soil Microbes | In Search of Soil #13", "summary": "<p>As farmers and growers, one of the number one things we need to take good care of to ensure good production is our soil. Now, there are a ton of practices and amendments available that supposedly make our soils healthier, from compost to compost teas, to biochar, to a lot of other things.</p> <p>Consequently, one such amendment that’s coming more and more into light these past few years is live microbial amendments. Microbial amendments help both stimulate and improve the microbial fauna in the soil that keep our crops healthy. And we have Dr. Paul Zorner of Locus Ag to talk about how microbial amendments do just that.</p> <p>Dr. Paul Zorner is an Adjunct Professor at the Department of Horticulture at North Carolina State University, as well as Chief Executive Officer and Chief Agronomist of Locus Agricultural Solutions, an agricultural company that produces microbial probiotics. Firmly believing that agriculture is one of the most sustainable ways to mitigate our current climate issues, he is also one of the key proponents to actively push for incentivizing farmers to sequester carbon in the soil to improve the global CO<sub>2</sub> emissions.</p> <p><a href=\"https://locusag.com/\">https://locusag.com/</a></p> <p> </p> <p><span style=\"font-size: 12pt;\"><strong>WATCH FULL EPISODES</strong> </span></p> <p><span style=\"font-size: 12pt;\"><a href=\"https://bit.ly/watchISOS\" title=\"YouTube https://bit.ly/watchISOS\">YouTube https://bit.ly/watchISOS</a></span></p> <p><span style=\"font-size: 12pt;\">Follow Diego <a href=\"https://www.instagram.com/diegofooter\">@diegofooter - https://www.instagram.com/diegofooter</a></span></p> <p> </p> <h2><span style=\"font-size: 12pt;\"><strong>In this episode of In Search of Soil</strong></span></h2> <ul> <li>Diego introduces the episode’s guest, Dr. Paul Zorner (00:58)</li> <li>Is our view of soil and the complex relationships within it too reductionist? (01:45) <ul> <li>The wonders of human intuition (03:42)</li> </ul> </li> <li>Mycogen, theories, and how they played out over time (06:52)</li> <li>Dr. Paul Zorner’s thoughts on weeds in their function in the succession of a landscape (10:38)</li> <li>Weeds and cover crop are closely related in terms of what they do (15:14)</li> <li>A potential net positive to plant growth competition (15:43)</li> <li>Can you get your soil healthy enough that it won’t allow weeds to grow? (18:42)</li> <li>Moving higher up in the succession with the plants you want to grow (21:20)</li> <li>Different weeds have different relationships with different microbes (25:00)</li> <li>Can the biological side of agriculture catch up to the yields from conventional agriculture? (27:27)</li> <li>Are you stunting the biological potential of the soil if you give easily accessible nutrients to plants vs. microbe food? (32:18)</li> <li>Adding microbes to help fast track building up soil (36:58)</li> <li>Putting the sugarcane back into the field—minus the sugar (39:20) <ul> <li>Quorum sensing (40:30)</li> </ul> </li> <li>Is any practice involving the addition of microbes to the soil beneficial? (45:02) <ul> <li>Environmental sequencing in a metagenome (46:18)</li> </ul> </li> <li>Getting the right microbes to get the ball rolling (47:42)</li> <li>Why adding microbial amendments yield inconsistent results (50:12)</li> <li>Why is there a need to reapply microbial amendments, can’t they reproduce in the soil in their own? (53:34)</li> <li>An increase in positive effects after application of microbial soil amendments before the eventual plateau (56:28)</li> <li>What happens to the plant after having Rhizolizer® that makes it grow more roots? (59:54)</li> <li>Will putting microbial amendments result in higher yield? (01:03:30)</li> <li>Addressing the location issue for microbial amendments (01:06:50)</li> <li>Inoculating with microbial amendments at the time of seeding (01:09:12)</li> <li>Is there a benefit to adding microbial food sources without the microbes? (01:10:32)</li> <li>Off-shelf options that feed soil microbes (01:14:02)</li> <li>Common microbes that tend to be missing in agricultural soils (01:14:52)</li> <li>Finding out to include Trichoderma in the mix (01:17:21) <ul> <li>What Trichoderma exactly does (01:18:53)</li> </ul> </li> <li>Carbon sequestration and where carbon goes (01:23:42)</li> <li>Soil microbes that absorb large amounts of CO<sub>2</sub> (01:29:35)</li> <li>CO<sub>2</sub> respired from the soil (01:30:56)</li> <li>Where the industry is right now in terms of monetizing carbo sequestration (01:32:52)</li> <li>Adopting practices that increase soil carbon sequestration (01:40:23)</li> <li>A marketplace to sell carbon sequestration credits (01:44:00)</li> <li>Where to find out more about Rhizolizer, CarbonNOW, and what Locus Ag has to offer (01:46:30)</li> </ul>", "publicationDate": "Wed, 14 Jul 2021 09:00:00 +0000", "duration": "01:51:03", "poster": "https://ssl-static.libsyn.com/p/assets/b/a/0/7/ba07fc1645fffe6016c3140a3186d450/PODCAST_-_Graphic_1_-_Square.jpg", "link": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-13-PaulZorner-FullEpisode.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/insearchofsoil/iSOS-13-PaulZorner-FullEpisode.mp3?dest-id=2402825", "size": "160514957", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}