{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Embracing the Connection Between Agriculture and Health with Zach Bush", "subtitle": "Embracing the Connection Between Agriculture and Health with Zach Bush", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Zach Bush MD, an educator and a triple board-certified physician who specializes in internal medicine, endocrinology, and hospice care. Zach brings his understanding of the systemic challenges in pharmaceuticals and farming to non-profits such as</span> <a href=\"https://farmersfootprint.us/\"><span style=\"font-weight: 400;\">Farmer’s Footprint</span></a> <span style=\"font-weight: 400;\">and</span> <a href=\"https://nontoxicneighborhoods.org/\"><span style=\"font-weight: 400;\">Non-Toxic Neighborhoods</span></a><span style=\"font-weight: 400;\">, where he works to create collaborative communities to solve these human and environmental problems. In this episode, John and Zach discuss the challenging problem of glyphosate. Zach describes the research showing the ramifications of this phosphonate compound and provides clear insights into the science of the problem before returning to an optimistic vision of regenerative agriculture as a solution. </span></p> <p><span style=\"font-weight: 400;\"><strong>Glyphosate/Roundup (around 00:02)</strong><br /></span><span style=\"font-weight: 400;\">With Zach’s background in chemotherapy and cancer research, he was on the front lines in 2005 when it was discovered that the gut microbiome, made up of fungi and bacteria, has a significant impact on whether and how cancer affects people. Joining other researchers, he began to learn the importance of supporting beneficial fungi and bacteria and realized that glyphosate damages the microbiome. Zach explains that glyphosate was originally deemed safe due to the fact that it blocked the shikimate pathway, which does not exist in humans or animals. However, in time it was discovered that glyphosate limits access to some essential amino acids needed by humans for microbiome resilience. Zach says that glyphosate targets protein structures in human cells which can lead to a leak in the gut lining, furthering chronic inflammation. He says that some widespread chronic diseases, such as asthma, Alzheimer’s, and cancer, can be traced to gut disruption and inflammation linked to glyphosate use. </span></p> <p><span style=\"font-weight: 400;\">Zach references the statistic that the Mississippi River collects 80-85% of the water-soluble residues of Roundup. The last stretch of the river is referred to as “Cancer Alley” because the surrounding regions have the highest rates of cancer in the world. When glyphosate was first widely used, it was thought of as safer than the chemistries it replaced because those were known carcinogens. What we’re seeing now, a generation of 25 years later, is that vegetables can have high enough levels of glyphosate concentrations to lead to leaky gut, which is not fully explained by historical definitions of toxicity. In addition, Zach explains that there is an epidemic of autoimmune and neurological disorders that can be attributed to glyphosate. From a study done on mice, Zach knows there are cumulative epigenetic effects of Roundup. If a first-generation is exposed to Roundup, the second generation does not need to be exposed directly to have disorders, immune dysfunction, and a shortened lifespan. The third generation of mice in the study experienced cancers and stillbirths, still without direct exposure. Chronic diseases in children have been increasing exponentially, and Zach expects that trend to continue according to the models developed from this research. </span></p> <p><span style=\"font-weight: 400;\"><strong>Sixth Extinction (Around 00:20)</strong><br /></span>John asks Zach to elaborate on the prediction that the human population will go extinct in 70 years. Zach bases this prediction on the rise of chronic disease combined with decreasing fertility. He cites the statistic that about 1 in 3 men and women are infertile. Zach explains how we are creating the sixth extinction event by destroying soils, increasing greenhouse gas levels in the atmosphere, acidifying the oceans, and other modern phenomena. </p> <p> </p> <p><span style=\"font-weight: 400;\"><strong>The Research(Around 25:00) </strong><br /></span><span style=\"font-weight: 400;\">Zach mentions that he is currently working on a book that covers this perspective. For current material, Zach recommends Stephanie Seneff’s research correlating glyphosate to chronic disease epidemics. In the last seven years, Zach’s lab has been working on the causation aspect, with that research available on</span> <a href=\"https://ionbiome.com/\"><span style=\"font-weight: 400;\">ionbiome.com</span></a><span style=\"font-weight: 400;\">. </span></p> <p><span style=\"font-weight: 400;\">Zach’s lab has shown that glyphosate disrupts the tight junctions that act as intelligent gatekeepers in a cell while inducing cells to show precancerous attributes.  White papers are available on his</span> <a href=\"https://ionbiome.com/pages/science\"><span style=\"font-weight: 400;\">website</span></a> <span style=\"font-weight: 400;\">for multiple studies he’s been involved in, including one showing that gluten intolerance is actually glyphosate toxicity. Zach has noticed a great increase in immune dysfunction, especially in children, which he attributes to the leaky gut injury caused by glyphosate. He sees this as evidence that we are destroying our ecosystem. John recalls the prediction that within 60 years we will run out of topsoil, and Zach notices that is very close to the 70-year prediction for extinction. Zach finds it very important that we regenerate soils. He says 11% of GDP is lost each year with the loss of topsoil and hopes this might motivate larger groups of people to switch to a regenerative system because it is a notable financial statistic.</span></p> <p><span style=\"font-weight: 400;\"><strong>Other Pesticides, Endocrine Disruption(around 41:00)</strong><br /></span><span style=\"font-weight: 400;\">The impact of pesticides on the endocrine system works in conjunction with the damage already done with glyphosate and can affect kidney and liver function. Zach explains that the decrease in fertility and increases in chronic diseases are also results of endocrine disruption by pesticides and other chemicals. In the process of filming the Farmer’s Footprint documentary, Zach and his team noticed that rare disorders and dysfunction were unusually common in the farming community. Rather than seeing the increase in suicide and depression in farmers as a result of financial hardship, Zach sees it as a result of glyphosate impacting gut health and contributing to mood disorders. In addition, farmers are not eating healthy, nourishing homegrown food. 90% of the land in Kansas is used for agriculture, yet 90% of the Kansas food supply is imported. A large portion of the crops grown in large-scale agriculture do not become a part of the food supply but are grown for animal feed or other products. Both Zach and John agree that the midwest is largely a food desert, as societal and economic shifts have forced the agricultural sector to specialize and centralize production. </span></p> <p><strong>The Solution (00:58)<br /></strong><span style=\"font-weight: 400;\">Zach is excited that regenerative agriculture has a comparatively rapid effect on soil health, farm profitability, and on rebuilding communities. Farmers can begin to work on becoming healthier as individuals by growing their own food and eating a varied diet. Zach describes a product he has available called Ion Biome which utilizes soil redox chemistry to fix the damage done to the microbiome by glyphosate. </span></p> <p><span style=\"font-weight: 400;\">John asks Zach what he believes is necessary for food to be medicine. Zach’s reply is that fiber is critical and that a balanced diet with nutrient-dense root vegetables, fruit, and cruciferous vegetables allows one to treat food as medicine. He also finds it important to eat food that is freshly picked, such as a tomato right off the vine, with its microbiome still intact. Zach thinks it can be really beautiful when farmers connect with their land again as regenerative farmers and recognize the importance to co-create along with Mother Nature. </span></p> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://ionbiome.com/\"><span style=\"font-weight: 400;\">Ion Biome</span></a></li> <li><a href=\"https://ionbiome.com/pages/science\"><span style=\"font-weight: 400;\">Zach’s Research</span></a></li> <li><a href=\"https://zachbushmd.com/\"><span style=\"font-weight: 400;\">Zach’s Website</span></a></li> <li><a href=\"https://farmersfootprint.us/\"><span style=\"font-weight: 400;\">Farmer’s Footprint</span></a></li> <li><a href=\"https://people.csail.mit.edu/seneff/\"><span style=\"font-weight: 400;\">Stephanie Seneff</span></a></li> <li><a href=\"https://nontoxicneighborhoods.org/\"><span style=\"font-weight: 400;\">Non-Toxic Neighborhoods</span></a></li> </ul> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Tue, 16 Jun 2020 12:12:23 +0000", "duration": "01:16:16", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/episodes/embracing-the-connection-between-agriculture-and-health-with-zach-bush/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Embracing_the_Connection_Between_Agriculture_and_Health_with_Zach_Bush.mp3?dest-id=698390", "size": "148354907", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}