{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Episode #70: Steven Bierlink", "subtitle": "Episode #70: Steven Bierlink", "summary": "<p><span style=\"font-weight: 400;\">Steven Bierlink is an apple grower located in Quincy, WA. When Steven returned to work on his family operation after graduating with a business degree, he was driven to meet the many challenges their orchard faced. Looking for solutions to bitter pit, cork spot, and lenticel rot, Steven sought out the management practices that could renew the health of their orchard.</span></p> <p><span style=\"font-weight: 400;\">Today, Steven abides by meticulous observation in his management practices that have brought many exciting successes, notably on his Honeycrisp blocks which have packed out at a stunning 160 bins per acre.</span></p> <p><span style=\"font-weight: 400;\">On this episode, Steven and John discuss:</span></p> <ul> <li><span style=\"font-weight: 400;\">Overcoming bitter pit in Honeycrisp apples by altering the interplay among excessive potassium applications, calcium timing, and manganese availability. </span></li> <li><span style=\"font-weight: 400;\">Steven’s focus on observation resulted in a shift away from his previous conventional operational methods. </span></li> <li><span style=\"font-weight: 400;\">How Steven balances data collected from fruit analysis and sap analysis to maximize marketable fruit production.</span></li> <li><span style=\"font-weight: 400;\">Managerial philosophies for happy, engaged employees, healthy work-life balance, and why he chooses to maintain a smaller-scale farm.</span></li> <li><span style=\"font-weight: 400;\">Virtually elimination of alternate-year bearing, through a combination of pruning, bud and spur management, PGR’s, nutrition, and lime-sulfur sprays.</span></li> <li><span style=\"font-weight: 400;\">The importance of growers owning the decision-making process, working alongside consultants.</span></li> </ul>", "publicationDate": "Thu, 27 May 2021 12:40:56 +0000", "duration": "01:36:59", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/RAP_Bierlink_FINAL_AUDIO.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/RAP_Bierlink_FINAL_AUDIO.mp3?dest-id=698390", "size": "139858468", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}