{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Episode #80: Kelly Mulville", "subtitle": "Episode #80: Kelly Mulville", "summary": "<p><span style=\"font-weight: 400;\">Kelly Mulville, a veteran agricultural consultant, is the Vineyard Director at Paicines Ranch in San Benito County, California. For more than 25 years, Kelly has been obtaining impressive results by merging his experience in viticulture with his understanding of Allan Savory’s holistic grazing management techniques. His approach to extended-season vineyard livestock grazing and other ecological practices continue to capture an audience of vineyard managers around the globe.</span></p> <p><span style=\"font-weight: 400;\">Kelly and John discuss in this episode:</span></p> <ul> <li><span style=\"font-weight: 400;\">How Kelly developed practices around incorporating sheep into his vineyard management.</span></li> <li><span style=\"font-weight: 400;\">Flooring a wildlife biologist with the bird population data on Kelly’s vineyard after implementing new practices.</span></li> <li><span style=\"font-weight: 400;\">The role plant-grazing animals play in reducing insect pressures.</span></li> <li><span style=\"font-weight: 400;\">Kelly’s cover cropping strategy and how it has led to a diversity of 50 species of plants growing in the vineyard.</span></li> <li><span style=\"font-weight: 400;\">The specific holistic management techniques inspired by Allan Savory’s work that have contributed to vineyard success.</span></li> <li>The adaptability of these practices on other crops like nuts and tree crops.</li> </ul> <p> </p>", "publicationDate": "Thu, 17 Mar 2022 13:50:47 +0000", "duration": "01:11:00", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://regenerativeagriculturepodcast.com/episode-80-kelly-mulville", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Kelly_Mulville_FINAL_AUDIO.mp3?dest-id=698390", "size": "136297247", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}