{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Episode #78: Adam Chappell", "subtitle": "Episode #78: Adam Chappell", "summary": "<p><span style=\"font-weight: 400;\">Adam Chappell is a regenerative grower and cover crop advocate from Cotton Plant, Arkansas. Adam started growing with his dad and brother on their 7,500 acre property in 2005, but by 2009 pigweed issues alone had nearly pushed them into bankruptcy. Knowing there had to be a better way, Adam began educating himself about the power of regenerative agriculture, implementing a cover cropping strategy that he claims saved the family farm. Today, Adam’s operation grows a variety of broadacre crops and continues to make strides in ecological health and crop performance.</span></p> <p><span style=\"font-weight: 400;\">Throughout their conversation, Adam and AEA Founder John Kempf discuss:</span></p> <ul> <li><span style=\"font-weight: 400;\">Adam’s start in agriculture and how cover cropping brought the farm “from the brink of bankruptcy to a profitable enterprise.”</span></li> <li><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Adam’s current methodologies for crop rotation and cover cropping.</span></li> <li><span style=\"font-weight: 400;\">How the adoption of regenerative practices has contributed to improved profitability.</span></li> <li><span style=\"font-weight: 400;\">Adam’s background in entomology and ecology and the shifts in insect populations he has seen over time.</span></li> <li><span style=\"font-weight: 400;\">Questioning the necessity of soil testing and becoming wary of “sales tools.”</span></li> <li><span style=\"font-weight: 400;\">Implementing Dr. Norman Lupo’s root intensification method and other row spacing strategies.</span></li> <li><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Livestock integration and the story of Adam’s first purchase of cattle.</span></li> <li><span style=\"font-weight: 400;\">Why Adam’s goals for the future include “getting smaller.”</span></li> </ul>", "publicationDate": "Thu, 30 Dec 2021 15:27:38 +0000", "duration": "53:35", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/adam-chappell.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/adam-chappell.mp3?dest-id=698390", "size": "72690336", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}