{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Facilitating Large Scale Transitions to Regenerative Agriculture with Terry McCosker", "subtitle": "Facilitating Large Scale Transitions to Regenerative Agriculture with Terry McCosker", "summary": "<p><span style=\"font-weight: 400;\">In our latest episode, John sits down with one of Australia’s most recognized thought leaders in Regenerative Agriculture, Dr. Terry McCosker. Over the course of three decades, Terry has worked with about 10,000 Australian farmers—a staggering 10% of all farmland on the continent—coaching them through an agricultural approach that emphasizes both soil nutrition & pasture ecology.</span></p> <p><span style=\"font-weight: 400;\">Terry currently serves as the director of RCS, an Australian agriculture consulting firm, but his career started at an early age when he had the opportunity to work on an Australian cattle station. Driven by a fearless pursuit of excellence, Terry found that most of the problems that faced the cattle station, as well as other operations across the country, stemmed from an outdated reductionist view of farming. As he continued his research, which included traveling to farms across the globe, he saw firsthand the power of holistic practices and their effects on livestock. Terry began challenging the paradigms of conventional farming and what he observed were results like an increase in livestock reproduction and mortality rates.</span></p> <p><span style=\"font-weight: 400;\">Throughout the episode, John and Terry discuss the work of Stan Parsons and Allan Savory, the importance of cell grazing alongside other regenerative practices, the proper strategies farmers use to approach succession planning, and the fascinating future potential of carbon sequestration.</span></p> <p><span style=\"font-weight: 400;\">“A client of mine once said that he thought he was a livestock producer. And then he came to one of our programs and went away thinking that he was a grass producer. And then over time, as he's learned more and more, he now believes he's a soil manager. If you understand that you're a soil manager, the production and the economics of your farm will actually look after itself…to be truly regenerative, a farmer needs to understand that they are a part of the ecosystem, not apart from it.” -Dr. Terry McCosker</span></p>", "publicationDate": "Wed, 02 Sep 2020 17:32:05 +0000", "duration": "01:19:22", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/REGEN_AG_PODCAST_TERRY_MCCOSKER_FINAL_AUDIO.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/REGEN_AG_PODCAST_TERRY_MCCOSKER_FINAL_AUDIO.mp3?dest-id=698390", "size": "114503120", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}