{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "From the Vault: Mark Wootton on Carbon-Neutral Farming at Jigsaw Farms", "subtitle": "From the Vault: Mark Wootton on Carbon-Neutral Farming at Jigsaw Farms", "summary": "<div>Recently the whole team here at Tenacious Ventures had the chance to get out of town and on to the farm. And not just any farm – we visited Jigsaw Farms, home to sheep farmer and long-time friend of the show Mark Wooton and his wife Eve. While out at Jigsaw, Mark and Eve gave us an update on their vision for “sustainable intensification” and their ethos for farm management.</div><div><br /></div><div>In that spirit we wanted to revisit our original conversation with Mark that was published nearly two years ago. After the recent visit to Jigsaw, it’s clear there are insights from this first discussion that are still valuable and relevant today, as Mark talks about:</div><div><br /></div><ul><li>Balancing the social imperative to farm ethically with production methods that can keep businesses profitable,</li><li>Keeping an eye on emerging trends like ecosystem services markets, and being open to the possibility of accessing premiums where they might emerge</li><li>The growing regenerative agriculture movement, and the need for farmers to think critically about guidelines and principles that are often put forward as dogma</li><li>The primacy of data in every decision that gets made on the farm</li></ul><div><br /></div><div>For more information and resources, visit our <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/2021/8/24/designing-crops-to-change-the-plant-based-food-system\" target=\"_blank\">website.</a></div>", "publicationDate": "Wed, 01 Jun 2022 20:00:00 +0000", "duration": "00:39:29", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/03682568-e1e6-11ec-a28d-0a3e35c043c7/images/main.png?1668664900175", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/6/2/mark-wootton-on-carbon-neutral-farming-sustainable-livestock", "audio": [{"url": "https://backtracks.fm/tenacious/pr/0361eaa4-e1e6-11ec-a28d-0a3e35c043c7/1003125.mp3?s=1&sd=1&u=1654113861", "size": "38207322", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}