{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "How Plants Absorb Living Microbes and Convert Soil Pathogens into Beneficials with James White", "subtitle": "How Plants Absorb Living Microbes and Convert Soil Pathogens into Beneficials with James White", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John Kempf interviews plant pathologist Dr. James White of Rutgers University, whose work provides a new perspective on plant pathology, susceptibility to soil-borne pathogens, and plant absorption of nutrients. Dr. White explains how endophytes, non-pathogenic fungal and bacterial organisms present in all plants, are a mechanism by which plants can absorb complete molecules, internalize and propagate soil-borne microbes, and nullify pathogenic organisms. </span></p> <p><span style=\"font-weight: 400;\">In the interview, Dr. White describes how plants cultivate microbes at the meristem, or root tip, where exudates are created. In this zone, these endophytes further attract and cultivate microbes from the soil in the rhizophagy cycle, from</span> <em><span style=\"font-weight: 400;\">rhizo-</span></em> <span style=\"font-weight: 400;\">meaning ‘root’ and -</span><em><span style=\"font-weight: 400;\">phagy</span></em> <span style=\"font-weight: 400;\">meaning ‘eating’. Through this process, plants attract and internalize soil-borne microbes. The microbes are then internalized by the plant and deliver nutrients from the soil directly to the roots.</span></p> <p><span style=\"font-weight: 400;\">Dr. White relates how this endophytic process encourages oxidative interaction, fostering hardier, more stress-tolerant plants, and how nitrogen applications and fertilizer decrease the incidence of these endophytes, leading to disease-susceptible crops. In cotton culture, for example, the practice of seed de-linting prior to planting effectively destroys the endophytes present on the seed. </span></p> <p><span style=\"font-weight: 400;\">Besides stimulating growth and stress tolerance within the seedling by bringing nutrients from the soil, endophytes also colonize pathogenic fungi, resulting in their reduced virulence. The endophytes don’t kill the fungi, but rather they colonize and weaken it so disease incidence is greatly reduced. In some cases, those pathogenic fungi will actually become endophytic fungi in the plant, as in the example of</span> <em><span style=\"font-weight: 400;\">Fusarium oxysporum</span></em><span style=\"font-weight: 400;\">. Once</span> <em><span style=\"font-weight: 400;\">Fusarium oxysporum</span></em> <span style=\"font-weight: 400;\">is colonized by the endophytic bacteria, it grows more slowly and onto the plant leaf surface. However, as long as the endophytic bacteria are also present, the</span> <em><span style=\"font-weight: 400;\">Fusarium</span></em> <span style=\"font-weight: 400;\">organism doesn’t cause disease. </span></p> <p><span style=\"font-weight: 400;\">Dr. White describes how researchers are just beginning to understand the significance of endophytic functions and the rhizophagy cycle. In the future, we are enabled to be more cognizant of what we're doing to the soil and plant microbiome in the process of cultivating plants. </span></p> <p><span style=\"font-weight: 400;\">In this absorbing conversation, John and James cover the science behind:</span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How plants absorb living microbes</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How endophytic microbes change potential pathogens’ behavior to provide plant nutrients rather than cause disease  </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How plants propagate soil derived-microbes </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Why cultivated varieties are more disease-susceptible than wild varieties and how this can be reversed</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How plant breeding processes can contribute to the loss of beneficial microbes on the seed coat</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">More details that will change the way you think about seeds, planting, disease, and nutrition</span></li> </ul> <p><strong>Resources:<br /></strong><span style=\"font-weight: 400;\">Research Paper:</span> <a href=\"https://www.mdpi.com/2076-2607/6/3/95\"><span style=\"font-weight: 400;\">Rhizophagy Cycle: An Oxidative Process in Plants for Nutrient Extraction from Symbiotic Microbes</span></a><br /> <span style=\"font-weight: 400;\">Research Article:</span> <a href=\"https://onlinelibrary.wiley.com/doi/10.1002/ps.5527\"><span style=\"font-weight: 400;\">Pest Management Science: Review: Endophytic microbes and their potential applications in crop management</span></a></p> <p> </p> <p><span style=\"font-weight: 400;\">Learn more about the rhizophagy cycle in a new 6-hour course from James White at <a href=\"https://www.academy.regen.ag/understanding-rhizophagy/\">https://www.academy.regen.ag/understanding-rhizophagy/</a></span></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Wed, 15 Jan 2020 02:10:59 +0000", "duration": "01:06:30", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/how-plants-absorb-living-microbes-and-convert-soil-pathogens-into-beneficials-with-james-white/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/How_Plants_Absorb_Living_Microbes_and_Convert_Soil_Pathogens_into_Beneficials_with_James_White.mp3?dest-id=698390", "size": "129684293", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}