{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Indigenous Vegetables and Finding Courage with Maureen Muketha (Founder Tule Vyema, Kenya)| Ep. 2", "subtitle": "Indigenous Vegetables and Finding Courage with Maureen Muketha (Founder Tule Vyema, Kenya)| Ep. 2", "summary": "<p>Joining me on the show today is the wonderful Maureen Muketha. Maureen is the founder of a community organisation in Kenya called Tule Vyema – which means “Let’s Eat Right” in Swahili. She started this organization in her early 20’s in parallel to finishing her studies in Nutrition.</p><p>Maureen shares how she works with her community to combat challenges of poverty and food insecurity, what helped her find the confidence to start her organisation at such a young age and how she finds the courage to keep going - even through a pandemic.</p><p>On the show we talk about:</p><ul><li>The role of indigenous vegetables in tackling malnutrition, food insecurity and in building sustainable food systems</li><li>How Tule Vyema educates women of reproductive age about eating well and supports them to grow indigenous vegetables at home, making healthy eating more accessible and cost-effective</li><li>What inspired Maureen to study nutrition and do the work she does</li><li>The key ingredients in Tule Vyema’s success</li><li>How to engage and work effectively within a community</li><li>How Tule Vyema’s work is impacted by COVID-19 and what they are doing to face the challenges</li><li>How Maureen makes eating well a lifestyle rather than an event</li><li>What helps Maureen find the courage to do the work she does and how she keeps learning and build her confidence</li><li>Maureen’s tips to not lose hope when facing big issues and how to lead yourself and others sustainably and with intention </li></ul><p><b>Further information:</b></p><p>For more information on Tule Vyema, follow @tulevyema on Facebook, Twitter and Instagram.</p><p>To read Maureen’s Oxfam article about her organisation: <a href=\"https://oxfamblogs.org/fp2p/lets-eat-right-women-tackling-malnutrition-through-urban-farming/\">https://oxfamblogs.org/fp2p/lets-eat-right-women-tackling-malnutrition-through-urban-farming/</a></p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com/\">www.thegreatfull.com</a></p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a></p><p>Don’t want to miss an episode of The Great Full? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Fri, 23 Oct 2020 14:00:00 +0200", "duration": "1656", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/6028222-indigenous-vegetables-and-finding-courage-with-maureen-muketha-founder-tule-vyema-kenya-ep-2.mp3", "size": "20781114", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}