{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Landed part 4: Places of possibilities", "subtitle": "Landed part 4: Places of possibilities", "summary": "So if, as it turns out, the family farm is a colonial concept, what are the alternatives? And if we’re to address the tangled mess of challenges we’re faced with – the climate emergency, biodiversity loss, farmer burnout, food inequality and the need for reparations – then perhaps we need to be thinking not at the scale of the individual farm, but of the entire landscape.\n\nIn this final episode, Col explores the patchwork of pre- and post-colonial land relations that already exist across Scotland. He learns more about the tried and tested model of crofting that still exists in parts of the Highlands, as well as Scotland’s community right-to-buy legislation, and asks whether, together, these could be part of a broader strategy to rethink land ownership and tenure, and even our relationship to land more broadly. \n\nIn the end, Col concludes that it’s not the case that the family farm is no longer relevant – it’s just that on its own, it’s not enough to deal with what the future has in store. Instead, the family farm must come to understand itself as part of a much broader landscape – one made up of a kaleidoscope of different understandings of, and approaches to, what it means to be Landed.\n\nLanded is produced by Col Gordon and Katie Revell, with Executive Producer Abby Rose. Our Project Manager is Olivia Oldham. Huge thanks to Josina Calliste for her guidance and input and to Sarah Nicholas for all her help and support. Thanks also to Jo Barratt. The music for Landed is by Dagger Gordon and Col Gordon.\n\nThis episode featured Marian Bruce, Helen O’Keefe, Patrick Krause, Calum MacLeod, Adam Calo, Will Frazer and Emma Whitham. \n\nFunding for the project was provided by the funding platform Necessity.\n\nFarmerama is committed to keeping all our episodes free, and to paying our team a living wage. To do so, we rely on support from you, our community of listeners. If you’d like to help us make more podcasts, you can become a Patron at patreon.com/farmerama.", "publicationDate": "Sun, 08 Aug 2021 15:29:14 +0000", "duration": "00:48:25", "poster": "https://i1.sndcdn.com/artworks-OnARJumq66UYYvNF-dMeeDA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/landed-part-4-places-of-possibilities", "audio": [{"url": "https://feeds.soundcloud.com/stream/1102405087-farmerama-radio-landed-part-4-places-of-possibilities.mp3", "size": "46485504", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}