{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Landed part 1: The family farm", "subtitle": "Landed part 1: The family farm", "summary": "“What if we’ve been getting this wrong?”\n\nCol Gordon is a farmer’s son from the Scottish Highlands. After a decade away, he’s finally returned to the place that he loves: his family farm. Now, he’s eager to start realising his vision for an agroecological future: a future in which rural areas are alive with culture, many more people work on the land, farms operate in sympathy with nature, and nutritious food is available to everyone in society.\n\nBut now that he’s back, Col’s starting to wonder whether this vision can be achieved within the existing family farm model. Increasingly, it seems the odds are stacked against farms like his. Many are struggling to survive, let alone to employ people and deliver good food affordably to local communities. As older farmers retire without succession plans, and their land is amalgamated into large industrial operations, the future of the small family farm looks pretty bleak.\n\nAs he wrangles with all of this, Col stumbles across something that throws his vision – and his very understanding of farming – into doubt. What does it mean to say that “The family farm is a colonial concept”? And might this jarring idea be the key to understanding the problem – as well as its potential solutions?\n\nLanded is produced by Col Gordon and Katie Revell, with Executive Producer Abby Rose. Our Project Manager is Olivia Oldham. Huge thanks to Josina Calliste for her guidance and input and to Sarah Nicholas for all her help and support. Thanks also to Jo Barratt. The music for Landed is by Dagger Gordon and me, Col Gordon.", "publicationDate": "Sun, 27 Jun 2021 16:01:47 +0000", "duration": "00:30:54", "poster": "https://i1.sndcdn.com/artworks-R5q92t5zuCxLklo9-lpx02A-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/landed-part-1-the-family-farm", "audio": [{"url": "https://feeds.soundcloud.com/stream/1076995291-farmerama-radio-landed-part-1-the-family-farm.mp3", "size": "29673600", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}