{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Leading the Chocolate Revolution with Christoph Inauen (Choba Choba) | Ep. 5", "subtitle": "Leading the Chocolate Revolution with Christoph Inauen (Choba Choba) | Ep. 5", "summary": "<p>In this episode I chat with Christoph Inauen, co-founder and CEO of Choba Choba, a chocolate brand with a revolutionary business model. Christoph was once responsible for sustainable sourcing at a large Swiss chocolate producer. Through his collaboration with Peruvian cocoa farmers he was able to experience the deeper challenges of the chocolate industry, leading him to co-found Choba Choba in an effort to address sustainability through an entirely new approach.</p><p>Christoph shares how Choba Choba is leading a chocolate revolution, what makes their products different and how they want to inspire change even beyond their industry. We also discuss how joy and purpose are integrated into his work and what leadership and life lessons he learned from working with farmers in the Peruvian Amazon.</p><p>On the show we talk about:</p><p>-        How Christoph and Eric decided to start their own chocolate company</p><p>-        What allowed them to take the risk</p><p>-        What makes Choba Choba revolutionary</p><p>-        How Choba Choba is tackling the social and environmental sustainability challenges in the chocolate industry</p><p>-        How we can create change the chocolate industry and even in other industries</p><p>-        The role of consumers in changing the industry</p><p>-        How to increase biodiversity in cocoa production</p><p>-        The loss of cultural connections to the cocoa plant </p><p>-        Which part of the journey has brought him the most joy</p><p>-        Leadership and life lessons he learned from the cocoa farmers</p><p>-        His biggest challenges in founding the business</p><p>-        What practices he integrates to live a life he loves while doing meaningful work</p><p>-        What living a great and full life means for Christoph</p><p>-        How their chocolate is different in terms of ingredients</p><p>Further information: </p><p>Find more information about Choba Choba on <a href=\"https://www.chobachoba.com/\">https://www.chobachoba.com/</a></p><p>You can follow them on Instagram, Twitter and Facebook @ChobaChobaChoc</p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Fri, 04 Dec 2020 11:00:00 +0100", "duration": "1753", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/6687500-leading-the-chocolate-revolution-with-christoph-inauen-choba-choba-ep-5.mp3", "size": "21079099", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}