{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "LIVE at ACRES 2018 with Ed Curry", "subtitle": "LIVE at ACRES 2018 with Ed Curry", "summary": "<p dir=\"ltr\">John Kempf and Ed Curry take the stage in Louisville, KY at the <a href=\"https://www.acresusa.com/pages/acres-u-s-a-2018-eco-ag-trade-show\"> ACRES Conference 2018</a> — a hotbed for regenerative agriculture practitioners for the last 30 years — to record the Regenerative Agriculture Podcast’s first ever LIVE show.</p> <p>The Acres Conference isn’t just another trade show or conference; this is a gathering of passionate and purposeful people working to share information and tools, and challenge the status quo in agriculture for the greater good. This is why we chose Acres 2018 for our first ever Podcast LIVE and why John and Ed make such a great pair to co-create this inaugural episode at this event.</p> <p dir=\"ltr\">Ed is an old-school breeder and grower with a new-school mentality. More than 90% of the green chiles grown in the US and Mexico are from Ed’s breeding program. He is now the only breeder of his kind in the world.</p> <p>Even if you don’t grow chiles, you can certainly learn something from this discussion.</p> <p dir=\"ltr\">The show covers important topics such as:</p> <ul> <li>The art of visual phenotyping</li> <li>Soil health’s impact on genetics</li> <li>Increase in yield by maximizing genetic potential over time</li> <li>Visually measuring the yield and quality of a chile crop within 30 days of planting</li> <li>The relationship between early vigor and crop yield</li> <li>How Ed’s management practices have brought steady decreases in Phytophthora and Xanthomonas bacterial spot</li> <li>Ed’s prediction for the coming capsaicin revolution and its many positive benefits</li> </ul> <p dir=\"ltr\">One of the most powerful things Ed says is, “The soul of farming is the soil.” We agree.</p> <p>The finale of our first season, episode #30, represents a huge milestone and our first ever Podcast LIVE. A huge THANK YOU is in order to all our amazing listeners around the world in the regenerative ag community who have supported this show and helped to make it such a success.</p> <p>We hope you have a lovely holiday and we look forward to sharing the second season of the Regenerative Agriculture Podcast with you in the new year.</p> <p>Thank you,<br /> The Regenerative Agriculture Podcast Team</p> <p> </p> <p dir=\"ltr\"> </p> <p dir=\"ltr\"><strong>Support For This Show & Helping You Grow</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/?utm_source=libsyn&amp;utm_medium=podcast&amp;utm_campaign=episode_29\" title=\"Regenerative agriculture products and services\">AEA</a>, leaders in regenerative agriculture since 2006.</p> <p>If you are a large-scale grower looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com?subject=Regenerative%20Agriculture%20Podcast%20listener%20reaching%20out\" rel=\"noopener noreferrer\" target=\"_blank\">hello@advancingecoag.com</a> or call <a href=\"\" rel=\"noopener noreferrer\" target=\"_blank\">800-495-6603 extension 344</a> to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or booking request have a Podcast episode recorded LIVE at your event -- to <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a>. You can email John directly at <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a>.</p> <p> </p> <p> </p> <p><strong>Sign Up For Special Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for our email list</a>.</p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was Directed by Geoffrey Shively, Edited by Nathan Harman, Produced by Nathan Harman, Robin Kitowski, Jenna Sodano, and Anna Kempf.</p>", "publicationDate": "Fri, 07 Dec 2018 09:49:34 +0000", "duration": "58:02", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/live-at-acres-2018-with-ed-curry/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/ACRES_Podcast_Live_-_12_7_18_4.11_AM_2.m4a?dest-id=698390", "size": "115161910", "title": "MP3 Audio (mp3)", "mimeType": "audio/mp4"}], "contributors": [{"name": "John Kempf"}]}