{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Measuring Nutrient Density with Dan Kittredge", "subtitle": "Measuring Nutrient Density with Dan Kittredge", "summary": "<p><span style=\"font-weight: 400;\">Before we present our newest episode, we have a request for you. As we complete our second season of the Regenerative Agriculture Podcast, we have a supporting base of over 5,000 listeners who engage with our episodes shortly after we post them. We now ask for your feedback on the podcast, whether there are topics you’d like to hear more about, and what suggestions you have for improvement. We’ve put together a survey that allows you to tell us what you think.</span> <a href=\"http://advancingecoag.com/podcast\"><span style=\"font-weight: 400;\">Here’s the link:</span> <span style=\"font-weight: 400;\">advancingecoag.com/podcast</span></a><span style=\"font-weight: 400;\">. We are appreciative of your feedback and we look forward to implementing it to make the Regenerative Agriculture Podcast ever better!</span></p> <p><span style=\"font-weight: 400;\">Thank you for permitting the interruption…now, on to the show notes!</span></p> <p><span style=\"font-weight: 400;\">In this episode of the podcast, John interviews Dan Kittredge, the Executive Director of the Bionutrient Food Association, whose development of sustainable agriculture techniques has connected him to farmers worldwide.</span></p> <p><span style=\"font-weight: 400;\">In this interview, John and Dan delve into the science of growing crops as it relates to human nutrition, describing how agricultural production practices can produce a better nutrient profile in our foods and the potential this holds for human health. He explains why a balanced, as well as a higher nutrient density in crops, is desirable. He discusses the complex relationships between the sun, soil, and plants that lead to these higher and balanced levels of nutrition. Dan explains that across the same food types, i.e., all carrots, wheat, milk, etc., there can be discrepancies in the reported nutritional values and how nutritional data on food packages can be wildly incorrect.</span></p> <p><span style=\"font-weight: 400;\">Over the past few years, Dan has been working on the development of a BioNutrient Meter, a handheld spectrometer which tests mineral levels in fruits and vegetables. Dan describes the science of spectroscopy, which is based on the frequencies emitted by each chemical element --this same technology helps scientists and astrophysicists determine the composition of stars six light-years away in our solar system. By measuring the frequencies and light particular elements emit, they can measure the percentage of hydrogen, helium and other gases. With the science of spectroscopy, and other new technology, Dan and his team at the BioNutrient Food Association have built a first-generation model of a miniaturized consumer-priced spectrometer for testing the nutrient levels in crops.</span></p> <p><span style=\"font-weight: 400;\">Listen to this provocative conversation between two pioneers who are truly passionate about growing food as medicine to learn:</span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How Dan founded BFA, and how this non-profit provides support and education for farmers about the use of biological systems</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The science behind plant resistance to insects, and why these resistant crops make good, in fact better, food for humans.</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The differences in nutrient density between instances of the same crop when grown on different soil under different conditions</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How soil and plant health correlates to nutrient density</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How the compounds that correlate with flavor and aroma are those that make the plant indigestible for an insect or disease</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The science of spectroscopy, and how the new BioNutrient Meter works</span></li> </ul> <p><strong>Resources</strong></p> <p><span style=\"font-weight: 400;\">The BioNutrient Food Association is having their annual Soil & Nutrition Conference in Massachusetts on November 13 to 17, 2019. For more information, visit </span><a href=\"http://soilandnutrition.org/\"><span style=\"font-weight: 400;\">soilandnutrition.org</span></a><span style=\"font-weight: 400;\">. </span></p> <p><span style=\"font-weight: 400;\">For more information on the BioNutrient Meter, visit the BioNutrient Food Association</span> <a href=\"https://bionutrient.org/site/bionutrient-meter\"><span style=\"font-weight: 400;\">website</span></a><span style=\"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Our community impact spot for this episode is provided by</span> <a href=\"https://hourglassfilms.com/fwp_portfolio/sustainable/\"><span style=\"font-weight: 400;\"> Hourglass Films</span></a><span style=\"font-weight: 400;\">. Hourglass Films has developed a documentary about regenerative agriculture called</span> <a href=\"https://hourglassfilms.com/fwp_portfolio/sustainable/\"><span style=\"font-weight: 400;\"> Sustainable</span></a><span style=\"font-weight: 400;\">, a film about the land, the people who work it and what must be done to sustain it for future generations. The film features some regenerative growers who work with AEA, and is currently available on</span> <a href=\"https://www.netflix.com/title/80134814\"><span style=\"font-weight: 400;\">Netflix</span></a><span style=\"font-weight: 400;\">,</span> <a href=\"https://itunes.apple.com/us/movie/sustainable/id1219834458\"><span style=\"font-weight: 400;\"> iTunes,</span></a> <a href=\"https://www.amazon.com/Sustainable-Marty-Travis/dp/B06WWQGH57\"><span style=\"font-weight: 400;\"> Amazon</span></a><span style=\"font-weight: 400;\">,</span> <a href=\"https://play.google.com/store/movies/details/Sustainable?id=xJuky56w7vI\"> <span style=\"font-weight: 400;\">Google Play,</span></a> <span style=\"font-weight: 400;\">and more. We hope you watch this documentary and find it engaging and useful.</span></p> <p><span style=\"font-weight: 400;\">We’ve put together a survey;</span> <a href=\"https://tracking.cirrusinsight.com/8db938e4-5cd5-4e6a-aba9-83c6da62fea9/us18-mailchimp-com-mctx-click\"> here’s the link: advancingecoag.com/podcast</a><span style=\"font-weight: 400;\">. Thanks for sharing your thoughts with us!</span></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Tue, 05 Nov 2019 11:44:33 +0000", "duration": "43:24", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/measuring-nutrient-density-with-dan-kittredge/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Measuring_Nutrient_Density_with_Dan_Kittredge.mp3?dest-id=698390", "size": "84718881", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}