{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Microbial Communities for Carbon Sequestration with David Johnson", "subtitle": "Microbial Communities for Carbon Sequestration with David Johnson", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Dr. David Johnson, a New Mexico State University research scientist, Adjunct Professor for the College of Agriculture at Chico State, and Faculty Affiliate for the Center for Regenerative Agriculture. His research clearly outlines the importance of managing the ratio between fungal and bacterial populations in the soil for plant productivity and carbon sequestration. During his research on the salinity of manure compost, Dr. Johnson and his wife, Hui-Chun Su, developed the BEAM Soil Compost Bioreactor which develops compost with high fungal populations. John and Dr. Johnson discuss carbon cycling and the capacity of biology to sequester carbon and build soil organic matter. The conversation provides a fascinating look at the role of carbon dioxide in agriculture and the environment, how the ratio of fungal to bacterial populations in the soil are key to carbon cycling, and the methodology growers can employ to actively increase soil organic matter while decreasing costs. </span></p> <p><strong>Carbon Sequestration (00:02:00)<br /></strong><span style=\"font-weight: 400;\">Dr. Johnson explains that high concentrations of carbon dioxide are problematic due to the impact on the climate, increasing the global temperature, rather than the impact of CO2 on plants, which like high concentrations of carbon. Due to those effects, carbon sequestration must be part of sustainable agriculture. John mentions that he has seen organic matter gains in the fields of half a percentage point per year, a very rapid improvement. Dr. Johnson believes that rate is possible, but only with cattle or other grazers in the system. In his experiments based solely on biology, he sees a little over a quarter of a percentage point per year increase in soil organic matter, or 10 tons of carbon per hectare. </span></p> <p><strong>The Microbial Community (00:08:00) <br /></strong><span style=\"font-weight: 400;\">In order to realize these significant results in building soil organic matter, Dr. Johnson says the microbial community must be balanced. The microbes cycle carbon, improve carbon use efficiency, and create a healthy soil system. Plowing and the use of biocides destroy fungal populations, so those need to be restored in order for soils to function appropriately. John references a slide in one of</span> <a href=\"https://media.csuchico.edu/media/0_ysqa9svw\"><span style=\"font-weight: 400;\">Dr. Johnson’s presentations</span></a> <span style=\"font-weight: 400;\">comparing fungal to bacterial biomass ratios and the partitioning of the photosynthates. The explanation is based on an experiment with compost made in the BEAM bioreactor, where fungal dominant soils were shown to utilize five times the amount of carbon in the plants than bacterial dominant soils. An average of 11% of carbon captured by a plant goes into the root, shoot, or fruit of the plant in most agricultural systems today, but in a fungal dominant soil, 55% of the captured carbon can be partitioned into the plant rather than into the soil. This can dramatically affect plant productivity and growth. Maximum productivity and carbon capture happen when the fungal to bacterial ratio is one to one, which also causes soil respiration to decrease. There can be increased crop biomass as well as more organic matter in the soil. Dr. Johnson notices that as fungal populations in the soil are restored, farmers are often happier. About 60% of a crop must be left to effectively rebuild the soil even after the soil microbes are in balance, rather than 100% removal. </span></p> <p><strong>Balanced Systems (00:27:00) <br /></strong><span style=\"font-weight: 400;\">Dr. Johnson explains that having the right microbes is a necessary first step towards building soil health, but is not the complete solution. The compost his team uses as an inoculant has over 2,500 species of bacteria and over 400 species of fungi, archaea, viruses, and more. That is a balanced community of varied microbes. The energy flow and carbon flow is also critical, and the photosynthetic rate must be increased. All of those work together to make a much more efficient, restored system. When the soil biology is in balance, the microbes can make the elemental nutrients available for the plant. That takes out the human guesswork of trying to figure out how much of each nutrient is needed. In a corn trial, the amount of applied nitrogen was decreased to 15%, or about 37 lb. per acre, and two lb. of compost per acre were added. The result was a small decrease in productivity in the first year and $80 more an acre in profits. Although only 37 lb. of nitrogen per acre were applied, 261 units of nitrogen were measured in the soil, compared to the control of 256 lb. of nitrogen. The nitrogen was made available from the soil system rather than as a purchased input. Dr. Johnson believes that healthy soil biology leads to a resilient system. He has seen dramatic changes in water absorption and retention when cover crops are used and soil biology is improved. In compacted soil, it took 10 minutes for an inch of water to infiltrate, and it now takes only seconds for that same inch of water. The first 1% increase in soil carbon is associated with a five times increase in the amount of water the soil can hold. Agriculture currently uses 70 to 80% of the freshwater on the planet, but utilizing these methods can double crop productivity and save water.</span></p> <p><strong>Importance of Observation (00:43:00)<br /></strong><span style=\"font-weight: 400;\">Dr.  Johnson explains that the information he has discussed so far was not the primary goal of his research. He was seeking a way to compost dairy manure, and his research serendipitously led him to this information. He believes that holding on to traditional methodologies is an obstacle, and that the farming of the future must be based on regular observation and be open to change. Farming for 40 years provides 40 different experiences, so paying close attention is the best way to improve. Resources he recommends include Chico’s Center for Regenerative Agriculture, John Kempf’s blog, Gabe Brown, Ray Archuleta, Allen Williams, and Will Harris. His final thought for listeners is to look at soils as a living organism, pay close attention to biology, utilize observation, and to transition to a system of regenerative agriculture to rebuild the soils. Dr. Johnson has seen that it’s possible to rebuild soils and that it has the ability to make farming fun again.  </span></p> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://www.csuchico.edu/regenerativeagriculture/bioreactor/david-johnson.shtml\"> <span style=\"font-weight: 400;\">Dr. Johnson’s Bio</span></a></li> <li><a href=\"https://www.csuchico.edu/regenerativeagriculture/\"><span style=\"font-weight: 400;\">Chico Center for Regenerative Agriculture and Resilient Systems</span></a></li> <li><a href=\"https://johnkempf.com/blog/\"><span style=\"font-weight: 400;\">John Kempf’s Blog</span></a></li> <li><a href=\"https://brownsranch.us/\"><span style=\"font-weight: 400;\">Gabe Brown’s Ranch</span></a></li> <li><a href=\"https://understandingag.com/home\"><span style=\"font-weight: 400;\">Understanding Ag, Ray Archuleta, Gabe Brown, Allen Williams </span></a></li> <li><a href=\"https://www.whiteoakpastures.com/meet-us/our-team/\"><span style=\"font-weight: 400;\">Will Harris</span></a></li> <li><a href=\"https://peerj.com/preprints/789.pdf\"><span style=\"font-weight: 400;\">Dr. Johnson’s Research Paper “Development of soil microbial communities for promoting</span></a></li> <li><a href=\"https://peerj.com/preprints/789.pdf\"><span style=\"font-weight: 400;\">sustainability in agriculture and a global carbon fix”</span></a></li> <li><a href=\"https://media.csuchico.edu/media/0_ysqa9svw\"><span style=\"font-weight: 400;\">Dr. Johnson’s Seminar at Chico State with referenced slide at 23:00</span></a></li> </ul>", "publicationDate": "Mon, 29 Jun 2020 18:13:00 +0000", "duration": "43:45", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/episodes/microbial-communities-for-carbon-sequestration-with-david-johnson/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Microbial_Communities_for_Carbon_Sequestration_with_David_Johnson.mp3?dest-id=698390", "size": "85352399", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}