{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Providing Affordable Food as Medicine At Scale with Pierre Weill", "subtitle": "Providing Affordable Food as Medicine At Scale with Pierre Weill", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews French agronomist, Pierre Weill, who created a feed company in 1992 in French Brittany with the intention of producing health-oriented animal nutrition. He then went on to co-found a nonprofit association called Bleu-Blanc-Cœur, which connects all the actors involved in the food chain to help producers and consumers connect the dots between reduction in disease and the quality of food production.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Pierre’s fascinating research trials examine the differences in human health when animal products from animals fed high-quality forage-based diets are consumed versus products from conventionally fed animals. In one group of six trials, conventionally fed animals were fed a diet of corn and soybeans, and the animals with a healthy diet were fed high-quality forages and seeds. Consumers in the trials were divided into control groups who ate milk, eggs, and other animal products from the conventionally fed animals, and experimental groups that ate the same from animals which were fed the higher-quality products. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">The two groups ate the same quantity and type of foods. The only difference was the diet of the animals. In this way, the producer’s behavior, and not the consumer’s behavior, was measured.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">As a proof of concept, the omega 6 and omega 3 levels, which correlate with the inflammatory processes, were measured in both groups of people, and a significant difference was found. The ratio of omega 6 and omega 3, which is healthy at a level of 5 and pro-inflammatory at a level of 10, was 15 in the control groups, and five in the experimental groups.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Pierre also talks about the structure of a new trial, currently underway, testing the immunity of breastfed children with the mothers’ diets being the differential, once again measuring the quality of the diets eaten by the animals whose products the mothers consumed. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">John and Pierre delve into the link between soil health and human health, and how the human gut microbiome is linked to a larger microbiome in the soil. The health of one is reflected in the health of the other.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">John and Pierre also discuss Bleu-Blanc-Cœur, and how Pierre developed this organization to address the problems of access to high food quality among populations with lower economic status and producer incentives to serve these groups. Within Bleu-Blanc-Cœur, producers pay close attention to the quality of animal health and diet and are connected with consumers who enjoy better health because of the producer’s choices.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">As an experienced animal nutritionist, Pierre provides information on the most optimal diets for hens, cows, and pigs. He discusses the impact of a healthy animal diet, on-farm economics, and describes how the longevity, higher fertility, and higher yield of milk and butterfat lead to an increase on the bottom line for farmers employing healthy animal diets.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Pierre’s recommended resources (that are not written in French):</span></p> <p><a href=\"https://michaelpollan.com/books/the-omnivores-dilemma/\"><span style=\"font-weight: 400;\"> The Omnivore’s Dilemma</span></a> <span style=\"font-weight: 400;\">by Michael Pollack</span></p> <p> </p> <p><span style=\"font-weight: 400;\">To learn more about Pierre’s work to improve the nutritional and environmental quality of our food, visit the Bleu-Blanc-Cœur website</span> <a href=\"https://www.bleu-blanc-coeur.org/c/127/What-is-Bleu-Blanc-Coeur\"><span style=\"font-weight: 400;\"> here</span></a><span style=\"font-weight: 400;\">. </span></p> <p><a href=\"https://www.researchgate.net/profile/Pierre_Weill2/publications\"><span style=\"font-weight: 400;\"> Follow Pierre’s research, and read the results of past peer-reviewed studies.</span></a></p> <p> </p> <p><span style=\"font-weight: 400;\">Our community impact spot for this episode is</span> <a href=\"http://notill.org/\"><span style=\"font-weight: 400;\">No-Till on the Plains</span></a><span style=\"font-weight: 400;\">, a non-profit organization that provides education, networking, and inspiration for growers who focus on soil health. No-till on the Plains will be hosting their annual winter conference in Wichita, Kansas, in January of 2020 where John Kempf will speak and present workshops about regenerative agriculture systems. To learn more about this conference and to register, visit the</span> <a href=\"http://notill.org/events/24th-annual-winter-conference-0\"><span style=\"font-weight: 400;\"> event information page</span></a> <span style=\"font-weight: 400;\">on the web.</span></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or a booking request: <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly: <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was recorded by John Kempf and Pierre Weill and produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Tue, 17 Sep 2019 12:22:02 +0000", "duration": "01:10:34", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/providing-affordable-food-as-medicine-at-scale-with-pierre-weill/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Food_Medicine_Pierre_Weill.mp3?dest-id=698390", "size": "137661768", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}