{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Rebuilding The Soil Carbon Sponge, and Cooling the Climate Fast with Walter Jehne", "subtitle": "Rebuilding The Soil Carbon Sponge, and Cooling the Climate Fast with Walter Jehne", "summary": "<p><span style=\"font-weight: 400;\">In this episode of The Regenerative Agriculture Podcast, John Kempf interviews Walter Jehne, an Australian soil microbiologist and the Director of Healthy Soils Australia. Walter has written and taught extensively about the earth’s soil carbon sponge and hydrology as they relate to climate change.</span></p> <p><span style=\"font-weight: 400;\">Walter provides context for the extreme weather events we are experiencing, and clearly identifies the role that water plays as a climate regulator. He describes how we can manage water to safely and naturally cool the planet and regulate climate change.</span></p> <p><span style=\"font-weight: 400;\">Walter has developed a perspective on the impact that farmers can have on the climate that is different than the dominant narrative on carbon sequestration. While carbon sequestration is an important piece of the puzzle, Walter explains how managing the way our soils retain and hold water has a much bigger impact due to the way the hydrological system functions as a regulator for the planet. Walter describes how specific tactics in the management of water in our soils can reduce extreme weather events. </span></p> <p><span style=\"font-weight: 400;\">Here are a few things Walter and John discuss in this engaging episode:</span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Why rising co2 levels are a symptom, rather than the cause, of the abnormal warming of the past 250 years</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How improving the soil’s water-holding capacity contributes to a more stable climate</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The foundational principles of atmospheric physics and the climate</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The effect of land degradation on the hydrological dynamics of the planet</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How regenerating the soil carbon sponge is the critical bridge between carbon management and hydrology management</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How increasing photosynthesis and “green longevity” is the key to restoring the hydrological balance, thus restoring climate balance and reducing extreme weather events</span></li> </ul> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or a booking request: <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly: <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was recorded by John Kempf and Walter Jehne and produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Tue, 15 Oct 2019 12:01:07 +0000", "duration": "47:18", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/rebuilding-the-soil-carbon-sponge-and-cooling-the-climate-fast-with-walter-jehne/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Rebuilding_The_Soil_Carbon_Sponge_with_Walter_Jehne.mp3?dest-id=698390", "size": "92862330", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}