{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "Regen Ag Series #1: Mark Wootton on carbon-neutral farming at Jigsaw Farms", "subtitle": "Regen Ag Series #1: Mark Wootton on carbon-neutral farming at Jigsaw Farms", "summary": "<div>Mark Wootton is well-known in the Australian agriculture industry as a pioneer in carbon-neutral farming. In 2011, <a href=\"https://www.jigsawfarms.com.au/\" target=\"_blank\">Jigsaw Farms</a>, his family property in south-west Victoria, achieved carbon neutrality - undergoing a process he openly admits was at the time, both “arduous and not necessarily commercially rewarding”.</div><div><br /></div><div>Yet, Mark and his wife Eve Kantor operate a very successful mixed grazing farm where they run 20,000 sheep for fine wool and prime lamb as well as 500 cows. The farm also incorporates a 600 hectare hardwood timber plantation and indigenous plantings for biodiversity.</div><div><br /></div><div>Mark was instrumental in the creation of the Climate Institute - a not-for-profit focused on climate science and policy in Australia. He remains a champion of finding new ways to lower methane emissions on farms - through both feed efficiencies and new technologies.</div><div><br /></div><div>His latest venture is a “Super Ewe” - where he’s using genetics to create a dual purpose sheep through focusing on muscle and fat in the selection process.</div><div><br /></div><div>In this episode Mark Wootton shares his insights on:</div><div><br /></div><ul><li>Using Sheep Freeze Brand (liquid nitrogen) as an alternative to mulesing.</li><li>Turning sustainable agriculture practices into a driver for productivity and profits.</li><li>The importance of flexibility in farming operations.</li><li>Finding the right times to make big decisions for your business.</li></ul><div><br /></div><div>Want to know more? Check out our blog and additional resources from the episode <a href=\"https://www.agtechsowhat.com/agtechsowhatepisodes/mark-wootton-on-carbon-neutral-farming\" target=\"_blank\">on our website.</a></div>", "publicationDate": "Wed, 15 Jul 2020 20:03:00 +0000", "duration": "00:37:11", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/17402d0e-6a97-11ec-a502-0e1130976a5f/images/main.png?1668664906371", "link": "https://www.agtechsowhat.com/agtechsowhatepisodes/mark-wootton-on-carbon-neutral-farming", "audio": [{"url": "https://backtracks.fm/tenacious/pr/1738d13a-6a97-11ec-a502-0e1130976a5f/697171.mp3?s=1&sd=1&u=1640995781", "size": "35993894", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}