{"version": 5, "show": {"title": "Regenerative by Design", "summary": "Regenerative by Design Podcast where we get to the root of health, climate, economics and food.  Host, Joni Kindwall-Moore, is an RN, an Ethnobotanist and the founder of Snacktivist Foods. Join us on this journey as we explore the ideas, stories and personalities behind the regenerative food system movement including climate change, human health, economics and food as well as other deeply interconnected topics. \n\nIn this podcast, we will be “going there” and leaning into topics that might make you squirm… just a little.  We want to challenge ourselves to think outside of the box and to discover the deeper side of our world’s problems so that we can better understand how to solve them. \n\nWe aim to unpack some of the most dynamic issues of our day with some of the most inspiring minds who are pushing the boundaries of our current norms and thinking paradigms. \n\nWe have seen incredibly disruptive events in the past few years like pandemics, climate events, disasters and war. These often trigger system changes that are reactionary and have short term gains. When these are practiced over the long term, they often have a degenerative effect on health and the environment.\n\nRegenerative design thinking is the opposite, and is an intentional, premeditated process that involves a high level of observation, analysis, creativity, and looking beyond reductionistic principles while embracing systems thinking and additionality to create regenerative solutions.\n\nRegenerative agriculture has become a powerful force for positive transformation and hope in todays world. And no discussion about agriculture is complete without a conversation about food. \n\nFood is the connection between people and the planet so grab a cup of coffee or your favorite running shoes and get ready to take a mental and philosophical leap into the future of food and our planet.", "poster": "https://images.transistor.fm/file/transistor/images/show/29880/full_1650028082-artwork.jpg", "link": "https://snacktivistfoods.com"}, "title": "Regenerative Agriculture, Soil Health, and the Great Plains-A Discussion with Jessica Gnad", "subtitle": "Regenerative Agriculture, Soil Health, and the Great Plains-A Discussion with Jessica Gnad", "summary": "Joni and Jessica talk about how farmers are shifting towards regenerative farming techniques and working towards healthy soil, water conservative, and better tasting food.", "publicationDate": "Thu, 21 Jul 2022 04:33:00 -0700", "duration": "3031", "poster": "https://images.transistor.fm/file/transistor/images/show/29880/full_1650028082-artwork.jpg", "link": "https://share.transistor.fm/s/d38add82", "audio": [{"url": "https://media.transistor.fm/d38add82/fc4126ce.mp3", "size": "73978538", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Joni Kindwall-Moore"}, {"name": "Joni Kindwall-Moore"}]}