{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Resilient Agriculture Models for The Future with Joel Salatin", "subtitle": "Resilient Agriculture Models for The Future with Joel Salatin", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Joel Salatin, a well-known lecturer and author and the co-owner of Polyface Farms in Swoope, Virginia. Polyface Farms is a “</span><span style=\"font-weight: 400;\">diversified, grass-based, beyond organic, direct marketing farm”.</span> <span style=\"font-weight: 400;\">Joel is well-known for his highly engaging public speaking style and is the author of twelve books relating his experience as a self-described ‘lunatic farmer’. In this episode of the podcast, we visit the challenges of mainstream, conventional agriculture through Joel’s paradigm-shifting lens, and learn why farmers are beginning to shift to a regenerative model. Joel also describes how farmers can learn the skills of marketing, communications, and public speaking, and broaches the uncomfortable topic of planning for farm inheritance and succession. </span></p> <p><span style=\"font-weight: 400;\">Joel’s worldview, informed by both real-world experience and immersion in a broad range of literature from philosophy, history, and religion, to current events and business, forms the foundation of his farming practices. Joel states that deep soils were not built with 10-10-10 chemical fertilizer, but rather built with real-time solar energy converted to carbon and vegetation that rots or is eaten and manured in place.</span> <span style=\"font-weight: 400;\">Joel describes why he does not believe such organizations as McDonald’s or Monsanto are evil, but rather thinks they have misguided beliefs concerning ecological systems and food production. Most often, employees at these organizations truly believe they are helping the world. While their understanding of agricultural processes is wrong, they are not ill-intentioned. The ability to understand the opposition is an important skill Joel developed in high school debate tournaments that helps him to build bridges with those who see agriculture differently than he does. </span></p> <p><span style=\"font-weight: 400;\">Joel and John discuss how most farmers desire to better their land and none have the intention to degrade the soil. Yet, many farmers continue to practice mainstream agriculture with its soil-degrading effects. Joel explains that for farmers to change their practices, often they need to face a crisis. He describes how the symbol for “crisis” in Japanese is the same as the symbol for “opportunity”. He sees crises as an opportunity for farmers to move towards more productive, regenerative practices. Joel also describes how we can elicit broader societal change to where regenerative farmers are viewed as the heroes within their communities.</span></p> <p><span style=\"font-weight: 400;\">The benchmark of success most used in farming is yield. Farmers also consider equipment and infrastructure as benchmarks of success. Joel’s take is that neither of these are a determinant of financial success or farm profitability. He relates an anecdote from his early years when his father, a tax preparer for the neighboring farming operations, mentioned that their own threadbare family farm was more financially stable than those farmers with large and fancy equipment and expensive facilities. </span></p> <p><span style=\"font-weight: 400;\">Joel believes the mantra that farmers must feed the world is a fallacy that encourages detrimental practices and unsustainable agriculture. The coronavirus pandemic has sharply defined the need for communities to be able to feed themselves and has placed a spotlight on the drawbacks of the current centralized system. Joel describes his belief in an intelligent creator who has loaned the world to us as an investment. In his words, no investor would accept dead zones, pollution, and species extinction. Thus, it is our responsibility to improve the land and help it become more fertile year after year. Seeing the world as an investment helps people to treat it well rather than deplete its resources for unsustainable growth. </span></p> <p><span style=\"font-weight: 400;\">The dysfunction of the current system is evidenced by the statistic that small-scale agriculture produces 70% of the global food supply with 30% of the inputs while the other 30% of the food supply is produced using 70% of the inputs. Joel makes the distinction that the size of a farming operation is not a determining factor in how regenerative or sustainable that farm can be. Rather, the sustainability of a farm can be rated on how centralized the operation is. He describes the growth of Polyface Farm as growth by duplication, rather than centralization. Although his farm is considered a large farm by the USDA, it has a small-farm feel partly due to his method of decentralizing 100,000 chickens in 300 field shelters on pasture rather than concentrating them in two giant poultry houses. He considers the ecological carrying capacity of the land when expanding, ensuring the land can absorb the livestock manure. Decentralized systems are much more resilient and much less smelly than concentrated, centralized systems. Although he cannot predict the future, Joel is certain that building healthy soil will stand the test of time. He emphasizes that an agricultural system of the future must be integrated, regionally focused, and full of complex relationships, and that it will be human and soil oriented. </span></p> <p><span style=\"font-weight: 400;\">Joel describes the profitability of growing corn versus a grass-fed beef production. Land that grows 100 bushels an acre of corn would produce grass that could support 400 cow days per year. He calculates that, no matter the price of cattle, there is approximately $300 per acre net profit for grass-fed beef, a profit never realized by corn farmers. However, very few of the farmers have actually shifted their production. That is because it is difficult for humans to make such a large change and admit to themselves that a new method could be better than their current practices. Farmer’s identities are based around what they grow and how they grow it, so it is very challenging for change to occur. The truth, though, is that farmers must adapt or die. It may require a new generation of farmers for the needed change to happen. </span></p> <p><span style=\"font-weight: 400;\">Joel raises the uncomfortable topic of farm succession. Estate planning is especially difficult for farmers due to their love for the land. The average age of a farmer today is 65, so about 50% of America’s farmland will shift in ownership in the next 15 years. At the same time, there are many young people hoping to enter the sector. While Joel has explored ways to connect young people with aging farmers who are looking for a successor, he also enforces the value of low-capital and mobile systems to help young people get started. The average American farm has $4.00 of depreciable equity for $1.00 in annual gross sales. At Polyface Farms, this ratio is $0.50 to $1.00. This more nimble style of agriculture requires no land equity, as mobile systems can be placed on land not owned by the farmer. Low-capital systems are becoming very important as young people gain the necessary experience, skills, and knowledge to start up a successful farming venture. </span></p> <p><span style=\"font-weight: 400;\">The practice of equal inheritance of farmland is a concept Joel discourages. His view is that farmland should be inherited by the person who has been stewarding the land. When the child who stayed home and held the farm together is given an equal inheritance with their siblings who pursued other careers, they must buy out their siblings to keep the farm which is an unfair burden. These conversations often don’t happen, but they are necessary for families to have. As Joel jokes, “Why should I die on my tractor so my kids can run off to Las Vegas with my money?”</span></p> <p><span style=\"font-weight: 400;\">This episode is a long conversation examining the importance of being well-informed and focusing on soil health and profitability above yields. Listen to gain a better understanding of the future of agriculture and what it will take to get there. </span></p> <p><strong>Resources:</strong><span style=\"font-weight: 400;\"><br /></span><a href=\"http://www.polyfacefarms.com/joels-bio/\"><span style=\"font-weight: 400;\">Joel’s Bio</span></a></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Tue, 26 May 2020 12:23:22 +0000", "duration": "01:25:31", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/resilient-agriculture-models-for-the-future-with-joel-salatin/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Resilient_Agriculture_Models_for_The_Future_with_Joel_Salatin.mp3?dest-id=698390", "size": "164403656", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}