{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Spicing Up the Food System and Our Careers with Meret Brotbek (Soul Spice)  | Ep. 6", "subtitle": "Spicing Up the Food System and Our Careers with Meret Brotbek (Soul Spice)  | Ep. 6", "summary": "<p>My guest on the show today is Meret Brotbek, a climate activist and social entrepreneur. Meret is co-founder and managing director of Soul Spice, a spice company that focuses on sustainable, organic and ethically sourced ingredients to make delicious and high quality spice blends. She is also a director at Climate KIC, an EU funded knowledge and innovation community that tackles climate change.</p><p>Meret shares her journey towards creating Soul Spice, from being a lawyer to an MBA graduate to working on sustainable procurement at Unilever to eventually find her passion at the interface of food systems and climate change.  She gives insights into the rarely talked about challenges in the spice industry and how they are tackling them to improve conditions for the farmers, as well as what she has learned about managing your own time and energy when being very impact driven.</p><p>During our chat we explore:</p><p>-        The story behind Soul Spice and her journey to create it</p><p>-        The murky history of the spice trade and the challenges that leaves today for both producers and consumers</p><p>-        Socioeconomic problems in the industry and how they try to tackle them</p><p>-        How they work directly with farmers to improve conditions on the ground</p><p>-        How this work has influenced her personal consumption choices</p><p>-        What helps her stay motivated in the face of challenges</p><p>-        What a portfolio career is and why this way of working fulfils her</p><p>-        The importance of saying no to avoid overwhelm</p><p>-        Meret’s leadership advice for people wanting to create change in food systems</p><p>-        Why communication and collaboration are important as an entrepreneur</p><p>-        What living a great and full life means for her</p><p>Further information: </p><p>Find more information about Soul Spice on <a href=\"https://soul-spice.com/\">https://soul-spice.com/</a></p><p>You can follow them on Instagram and Facebook @soulspice.tastethatmatters</p><p>For more information about EIT Climate-KIC visit <a href=\"https://www.climate-kic.org/\">https://www.climate-kic.org/</a></p><p>For more information about coaching and education opportunities at The Great Full to help you lead the change for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts. </p>", "publicationDate": "Sat, 19 Dec 2020 11:00:00 +0100", "duration": "2119", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/6921395-spicing-up-the-food-system-and-our-careers-with-meret-brotbek-soul-spice-ep-6.mp3", "size": "25467524", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}