{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Sustainable Sourcing and Building Personal Resilience with Irena Loloci (Founder Rena Roots) | Ep. 3", "subtitle": "Sustainable Sourcing and Building Personal Resilience with Irena Loloci (Founder Rena Roots) | Ep. 3", "summary": "<p>My guest today is Irena Loloci, founder and CEO of Rena Roots. Irena worked for many years as a humanitarian aid worker with the World Food Programme in various parts of the world. This experience motivated her to launch an ethical skincare brand Rena Roots which focuses on transparent and sustainable sourcing of ingredients to create opportunities for farmers in regions of crisis.</p><p>Irena shares insights from her work in the field, how she discovered beauty, humanity and resilience in times of crisis and how she found the inspiration and confidence to pivot from humanitarian assistance to setting up and running a social business. We also talk about the importance of maintaining your own energy and self-care when doing meaningful work in the world.</p><p>On the show we talk about:</p><p>-        How growing up in Albania during a crisis influenced her professional path in life</p><p>-        Her experiences and learnings from working with the United Nations World Food Programme to build food security in crisis situations</p><p>-        What to remind yourself when you feel like you’re not doing enough</p><p>-        How each of us can impact and make a difference in our daily lives</p><p>-        Why she started Rena Roots and her long-term vision</p><p>-        How she selects her suppliers to source ethically and sustainably</p><p>-        How she wants to bring the SDG 17 “partnerships for the goals” into the skincare industry</p><p>-        What has brought her the most joy on her journey with Rena Roots so far</p><p>-        How she built her confidence and found her voice</p><p>-        The importance of self-care during times of stress and crisis</p><p>-        How small rituals help her find a calm and grounded place to work from</p><p>-        What living a great and full life means for her</p><p><b>Further information:</b></p><p>For more information on Rena Roots: <a href=\"https://www.renaroots.com/\">https://www.renaroots.com/</a></p><p>You can also find her on Instagram @RenaRoots and on Facebook.</p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Fri, 06 Nov 2020 16:00:00 +0100", "duration": "2343", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/6251929-sustainable-sourcing-and-building-personal-resilience-with-irena-loloci-founder-rena-roots-ep-3.mp3", "size": "28163048", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}