{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "The Fallacy of Mainstream Potassium and Nitrogen Fertilization with Richard Mulvaney", "subtitle": "The Fallacy of Mainstream Potassium and Nitrogen Fertilization with Richard Mulvaney", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Professor Richard Mulvaney from the University of Illinois. Dr. Mulvaney is a prolific soil fertility scientist and researcher with many published papers relating to nitrogen and potassium uptake in crops. His work with Dr. Saeed Khan led to the development of the Illinois Soil Nitrogen Test (ISNT). John and Dr. Mulvaney discuss nitrogen uptake in crops, how soil should provide most of the needed nitrogen, and the fallacy that applying nitrogen builds soil organic matter. He also describes the “potassium paradox”, how significant amounts of potassium are available from the soil, and the damaging cycle that is created when applying potash. </span></p> <p><strong>Nitrogen Fertilization (00:00:53)<br /></strong><span style=\"font-weight: 400;\">Dr. Mulvaney began working in soil fertility in the 1980s with a focus on minimizing nitrogen fertilizer loss to increase crop uptake, specifically in regard to the isotope N-15. In collaboration with Dr. Saeed Khan in the 1990s, he found evidence that in some cases, fertilizer nitrogen on corn has no statistically significant response. At the time, most soil scientists were operating with the assumption that the optimal amount of fertilizer nitrogen is found by multiplying 1.2 times an expected yield goal, then deducting nitrogen credits such as a previous legume. In a project in Illinois studying on-farm plots, around 33 of 75 studied sites showed no significant response to fertilizer nitrogen, a finding inconsistent with the 1.2 method. The unfertilized yields, or check yields, were very high and not significantly increased with an application of nitrogen. Thus, Dr. Mulvaney hypothesized that the 1.2 calculation might not be as reliable as previously thought. Dr. Khan and Dr. Mulvaney conducted research to determine the difference between plots used in that study that were responsive and those that were unresponsive to fertilizer nitrogen applications. His wife noted that while soil scientists understand how carbon in plants is heterogeneous and decomposes at different rates, they assume that nitrogen is all the same. Examining the differences within nitrogen forms made clear that the plants at the non-responsive sites had sufficient levels of nitrogen available from the soil and so did not need nitrogen fertilizer applications. Using diffusion on the soil samples from the same study, they found that non-responsive soils were consistently testing higher in amino sugar nitrogen. </span></p> <p><span style=\"font-weight: 400;\">The prevailing thought at the time was that fertilizer is the primary source of nitrogen for crop uptake, especially for corn. However, Mulvaney’s and Khan’s data shows that at least two thirds of the nitrogen in the crop at harvest is supplied from the soils, rather than from applied fertilizer nitrogen. In soils with higher amounts of amino sugar nitrogen, applications of fertilizer nitrogen are a waste of money because most or all of the nitrogen is supplied by the soil. It follows that measured soil nitrogen is only correlated with crop response to applied nitrogen when soil tests measure amino sugar nitrogen. </span></p> <p><span style=\"font-weight: 400;\">The 1.2 method was developed from research trials on static plots. These corn plots received the same fertilizer treatments each year. On the unfertilized plots, corn used the nutrients from the soil with no nitrogen fertilizer added. Microbes will also use nitrogen from the soil to break down crop residues, depleting the following crop of nitrogen and depressing yields. The depletion of nitrogen resulting in depressed yields on the unfertilized plots makes the fertilizer effect appear more dramatic in comparison. Because the 1.2 method is based on static plots, it and its related assumptions are invalid when applied to farmer fields. Similarly, the assumption that one-third of the nitrogen will come from the soil is incorrect. In reality, two-thirds of the nitrogen is supplied from soils and only one third or less comes from fertilizer. These misconceptions have misled growers on the importance of nitrogen applications. </span></p> <p><span style=\"font-weight: 400;\">Because soil is the primary source of nitrogen for crop uptake, soils should be tested to determine how much nitrogen fertilizer should be applied. Dr. Mulvaney and Dr. Khan developed the Illinois Soil Nitrogen Test (ISNT) to estimate the amino sugar fraction for variable-rate nitrogen application recommendations. A former student of Dr. Mulvaney runs the lab at</span> <a href=\"https://www.cropsmith.com/\"><span style=\"font-weight: 400;\">Cropsmith</span></a><span style=\"font-weight: 400;\">, where the Illinois Soil Nitrogen Test is available. </span></p> <p><strong>Expansion on Amino Sugar Nitrogen (00:24:15)<br /></strong><span style=\"font-weight: 400;\">Amino sugars are an organic form of nitrogen produced by microbial activity. They occur in microbial cell walls, spores, and in chitin. The bacterial cell walls are more decomposable. Nitrogen shows up in asparagine and glutamine, essential amino acids, which contain one nitrogen atom each in the amino group and the amide group, which is prone to break down. It is estimated that 5-10% of soil organic nitrogen is in the form of amino sugars, but Dr. Mulvaney believes it is likely higher. Amino sugar nitrogen, more specifically referred to as alkali hydrolyzable nitrogen, will also increase with more soil biological activity. Manured soils have higher levels of it, and thus have a diminished need for synthetic fertilizer nitrogen. Although his lab has not studied cover crops directly, he believes having active plants in the soil will increase microbial activity and thus the amino sugar nitrogen.  </span></p> <p><span style=\"font-weight: 400;\">The</span> <a href=\"https://aces.illinois.edu/research/history/morrow-plots\"><span style=\"font-weight: 400;\"> Morrow Plots</span></a><span style=\"font-weight: 400;\">, located at the University of Illinois and established in 1876, are the oldest continuous research plots in North America. They are static plots with three rotations, continuous corn, corn-soybean, and corn-oats-hay. In his research, Dr. Khan noticed that the continuous corn plots were not as healthy and had lower yields than the corn-oats-hay plots, even though the continuous corn plots received significantly more nitrogen fertilizer. The results of the Illinois Soil Nitrogen Test were lower on the continuous corn plots, which shows that synthetic nitrogen fertilizer is not necessarily building soil organic matter. Research comparing samples from 1955, 1967, and 2005 showed decreases in organic matter on the fertilized subplots. Dr. Mulvaney explains that the fertilizer actually “burned” organic matter. Carbon metabolism requires nitrogen, in a ratio of about 7 carbon to 1 nitrogen, so microbes can only access carbon from crop residue with nitrogen availability. When the microbes have too much nitrogen, they burn off the excess carbon as carbon dioxide rather than building soil organic matter. Additionally, conventional fertilizers have an oxidizing effect on soil microbial communities and stimulate respiration, which releases carbon from the soil as carbon dioxide. </span></p> <p><span style=\"font-weight: 400;\">Dr. Mulvaney notes that William Albrecht published a</span> <a href=\"https://soilandhealth.org/wp-content/uploads/01aglibrary/010120albrecht.usdayrbk/lsom.html\"> <span style=\"font-weight: 400;\">paper in 1938</span></a> <span style=\"font-weight: 400;\">in a handbook from the USDA where he stated that adequate nitrogen is needed to build organic matter. Later that year, Albrecht published an</span> <a href=\"https://acsess.onlinelibrary.wiley.com/doi/10.2136/sssaj1939.036159950003000C0014x\"> <span style=\"font-weight: 400;\">article</span></a> <span style=\"font-weight: 400;\">in the Soil Science Society of America Proceedings based on results which showed that unfertilized plots had gained organic matter while fertilized plots had lost it. Albrecht never again said adequate nitrogen is needed. </span></p> <p><strong>Potassium Paradox (0:43:40)<br /></strong><span style=\"font-weight: 400;\">Dr. Mulvaney worked with Dr. Khan, an expert on potassium, to write papers on the</span> <a href=\"https://experts.illinois.edu/en/publications/the-potassium-paradox-implications-for-soil-fertility-crop-produc\"> <span style=\"font-weight: 400;\">potassium paradox</span></a><span style=\"font-weight: 400;\">. He was doing soil testing for potassium on the South Farm at Illinois, testing from the surface plow layer to about seven inches into the soil. The unfertilized plots increased in their average potassium levels, leading to the realization that the soil was releasing potassium. There are about 40,000 pounds of potassium per acre in just the top six inches of many Midwestern soils. A review of numerous potassium studies showed that there is no significant yield increase from potash fertilization. Clay layers, mostly found in the subsoil rather than the plow layer, hold significant quantities of potassium. When the plant roots reach those lower levels, they find large quantities of potassium that they extract with the biological functions of the root system. </span></p> <p><span style=\"font-weight: 400;\">Because potassium is a major plant cation, there are high levels of soluble potassium carbonate in crop residue. Salts are leached from crop residue during rainfall, resulting in most of the potassium in a corn crop returning to the soil and making potassium fertilization unnecessary. Potassium is also fixed in the clay due to its size, leading to high potassium retention in clay layers with sufficient moisture. These factors lead to sufficient potassium levels in the soil. A German researcher, Mengel, performed a greenhouse study where he removed the clay fraction from soil, and potassium uptake was still high. This led to the idea that potassium in the clay layers is unavailable to plants, but Dr. Mulvaney disagrees. He finds that the plants are able to make the potassium available by producing acids. Soil testers measure the exchangeable potassium in soils, and do not measure the non-exchangeable and mineral potassium. This means that they will underestimate the available potassium and will recommend potassium fertilization, though it may not be necessary. As further evidence that potassium fertilization is typically unnecessary, Dr. Mulvaney refers to</span> <a href=\"https://books.google.com/books?id=DM1FAQAAMAAJ&amp;pg=PA666&amp;lpg=PA666&amp;dq=cyril+hopkins+potassium+fertilization+not+necessary&amp;source=bl&amp;ots=nSIGPmz6bu&amp;sig=ACfU3U1ij8RdeQo6zwDCWEgnYhrxQHYA-A&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwj4jPjeysjqAhVPAp0JHcezCXgQ6AEwAHoECAQQAQ#v=onepage&amp;q=cyril%20hopkins%20potassium%20fertilization%20not%20necessary&amp;f=false\"> <span style=\"font-weight: 400;\">Cyril Hopkins</span></a><span style=\"font-weight: 400;\">, a 20th-century soil scientist, who claimed that potassium is not a necessary input because the soil already contains enough. </span></p> <p><span style=\"font-weight: 400;\">The potassium paradox is based on the fact that applying potash to soil makes potassium less available by collapsing the clay layers. To demonstrate, Dr. Mulvaney tells a story about a fertilizer dealer who applied potassium to soils that had tested low for potassium. When they re-tested the field, the potassium levels were even lower. They assumed they had the wrong field, re-applied potassium on the same field, and again found lower potassium levels afterward. Thus, applying potassium can worsen potassium deficiency. </span></p> <p><span style=\"font-weight: 400;\">Dr. Mulvaney advises growers to use the Illinois Soil Nitrogen Test or another similar test. It doesn’t test for nitrate, which is dynamic, but tests a more stable nitrogen, specifically amino sugar nitrogen. This allows many growers to save money on purchased inputs such as nitrogen fertilizer if they do not need it.  Rather than soil testing for potassium, he recommends strip trials comparing strips with no potassium fertilizer and strips with a small amount, as large amounts are never necessary. He also recommends using sulfate for potassium fertilizer, rather than Muriate of Potash, because the chloride content in Muriate of Potash diminishes nitrate uptake. </span></p> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://nres.illinois.edu/directory/mulvaney\"><span style=\"font-weight: 400;\">Richard Mulvaney, Professor</span></a></li> <li><a href=\"https://www.cropsmith.com/\"><span style=\"font-weight: 400;\">Cropsmith</span></a></li> <li><a href=\"https://solvita.com/\"><span style=\"font-weight: 400;\">Solvita, invented by Will Brinton</span></a></li> <li><a href=\"https://solvita.com/slan/\"><span style=\"font-weight: 400;\">Solvita SLAN Test</span></a></li> <li><a href=\"https://www.mdpi.com/2076-2607/6/3/95\"><span style=\"font-weight: 400;\">Rhizophagy Cycle: An Oxidative Process in Plants for Nutrient Extraction from Symbiotic Microbes by James White</span></a></li> <li><a href=\"https://www.agweb.com/author/ken-ferrie\"><span style=\"font-weight: 400;\">Ken Ferrie, Farm Journal</span></a></li> <li><a href=\"https://experts.illinois.edu/en/persons/richard-l-mulvaney/publications/\"> <span style=\"font-weight: 400;\">Dr. Mulvaney’s Research</span></a></li> <li><a href=\"https://experts.illinois.edu/en/publications/the-potassium-paradox-implications-for-soil-fertility-crop-produc\"> <span style=\"font-weight: 400;\">The Potassium Paradox, Mulvaney and Khan</span></a></li> <li><a href=\"https://aces.illinois.edu/research/history/morrow-plots\"><span style=\"font-weight: 400;\"> Morrow Plots</span></a></li> <li><a href=\"https://soilandhealth.org/wp-content/uploads/01aglibrary/010120albrecht.usdayrbk/lsom.html\"> <span style=\"font-weight: 400;\">William Albrecht, “Loss of Soil Organic Matter and Its Restoration” 1938</span></a></li> <li><a href=\"https://acsess.onlinelibrary.wiley.com/doi/10.2136/sssaj1939.036159950003000C0014x\"> <span style=\"font-weight: 400;\">William Albrecht, Variable Levels of Biological Activity in Sanborn Field after Fifty Years of Treatment</span></a></li> <li><a href=\"https://link.springer.com/article/10.1007/BF00418676\"><span style=\"font-weight: 400;\">Mengel paper, 1994</span></a></li> <li><a href=\"https://books.google.com/books?id=DM1FAQAAMAAJ&amp;pg=PA666&amp;lpg=PA666&amp;dq=cyril+hopkins+potassium+fertilization+not+necessary&amp;source=bl&amp;ots=nSIGPmz6bu&amp;sig=ACfU3U1ij8RdeQo6zwDCWEgnYhrxQHYA-A&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwj4jPjeysjqAhVPAp0JHcezCXgQ6AEwAHoECAQQAQ#v=onepage&amp;q=cyril%20hopkins%20potassium%20fertilization%20not%20necessary&amp;f=false\"> <span style=\"font-weight: 400;\">Bulletin No. 182 “Potassium From the Soil” Cyril Hopkins </span></a></li> </ul>", "publicationDate": "Tue, 14 Jul 2020 19:04:07 +0000", "duration": "01:06:54", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/episodes/the-fallacy-of-mainstream-potassium-and-nitrogen-fertilization-with-richard-mulvaney/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Nitrogen_and_the_Potassium_Paradox_with_Richard_Mulvaney.mp3?dest-id=698390", "size": "129055488", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}