{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "The Future of Fertilizer - Nitrogen, with Jupiter Ionics and Kula Bio", "subtitle": "The Future of Fertilizer - Nitrogen, with Jupiter Ionics and Kula Bio", "summary": "<p><i>This is the first episode in our series on the future of fertilizer, starting with Nitrogen - the N in NPK.</i></p><p><br />Russia’s war in Ukraine has collided with natural gas supply chain disruptions and sent the price of fertilizer skyrocketing. But, this isn’t the least of the crop nutrient industry’s problems. It’s a space renowned for being complex and confusing. It also relies on an emissions-intensive value chain that has been around now for more than a century.<br /></p><p><br />Today’s episode looks at two different visions for the future of nitrogen fertilizer. Our guests are Charlie Day, CEO of Jupiter Ionics, and Bill Brady, CEO of Kula Bio. Both lead teams that are attempting to bring cutting edge nitrogen production methods to market.<br /></p><p><br />Charlie and Bill join to speak about:</p><ul><li>Reducing the chemical intensity of production - How new approaches to producing nitrogen work and why they are key to a cleaner industry. </li><li>Reinventing nitrogen fertilizer - Why reinventing fertilizer production makes sense</li><li>Scaling the science - Why scaling production from grams to tonnes is so tough, let alone trying to get it into the hands of customers.<br /></li><li>Designing for adoption - What Charlie and Bill have learned from other novel ag inputs that failed to fit into the production systems of farmers.</li></ul><p>We’ll follow up with a Part 2 on the future of N - stay tuned! For more useful resources, <a href=\"https://feeds.backtracks.fm/feeds/tenacious/agtech-so-what/visit our websitehttps:/tenacious.ventures/podcast-episodes/the-future-of-fertilizer-nitrogen-with-jupiter-ionics-and-kula-bio\">visit our website</a>.<br /></p><p><br /></p>", "publicationDate": "Wed, 19 Oct 2022 19:00:00 +0000", "duration": "00:34:22", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664898202", "link": "https://tenacious.ventures/podcast-episodes/the-future-of-fertilizer-nitrogen-with-jupiter-ionics-and-kula-bio", "audio": [{"url": "https://backtracks.fm/tenacious/pr/6f7e77de-4f69-11ed-be00-12e663e7db43/ep151_futureofnfertilizer_part1.mp3?s=1&sd=1&u=1666155291", "size": "49548264", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}