{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "The Regenerative Orchard: Cherry Success with Mike Omeg", "subtitle": "The Regenerative Orchard: Cherry Success with Mike Omeg", "summary": "<p><span style=\"font-weight: 400;\">Mike Omeg is a 3rd generation cherry grower who has spent the last few decades farming 350 acres of cherries in The Dalles, Oregon. Mike is an innovator with the vision for new approaches and the analytical mind to measure results. He’s tested myriad techniques in his quest for the best and most profitable methods of growing cherries, and was awarded the Good Fruit Grower award by the Fruit Grower News in 2017.</span></p> <p><span style=\"font-weight: 400;\">In this conversation, John and Mike delve into the type of bio-intensive system Mike has developed and the data he has collected in his trials. Mike has shown that profitable large-scale agriculture and regenerative practices are entirely compatible and speaks to how his operation has scaled regenerative practices. He also thinks deeply about return on investment, the economic growth of his operation, and discusses the positive impact that regenerative methods have had.</span></p> <p><span style=\"font-weight: 400;\">Believing that one of the fastest ways to improve soils is to grow a healthy crop, Mike explains his view of the tree as the conduit for putting carbon into our soils more efficiently than mulch or compost. Supported with the correct nutrition, the tree is simultaneously building this year’s crop and boosting nutrient levels in the soil for building future crops.</span></p> <p><span style=\"font-weight: 400;\">In the episode, Mike gives in-depth information on his experiments with different types of cover crops saying, \"When we talk about having a return on our investment, we need to have every seed that goes into that mix be there because we know it’s going to earn us a return - not because we want to feel good that we're maybe doing something that we read in a book was important.”</span></p> <p><span style=\"font-weight: 400;\">Close to the end of this conversation, Omeg says, “I'm excited for every day to bring new challenges in farming. And focusing upon biological and restorative agriculture has just brought a real sense of joy to me when I walk through the orchard. It's exciting, and I love it.” Mike is truly an important figure in the landscape of stone fruit production. Check out his</span> <a href=\"https://www.youtube.com/user/oblrman\"><span style=\"font-weight: 400;\">YouTube channel</span></a> <span style=\"font-weight: 400;\">where he covers not only some of the most innovative stone-fruit production methods, but also a host of other fascinating topics.</span></p> <p><span style=\"font-weight: 400;\">Whether you grow cherries or cherry tomatoes, you will find this conversation between John and Mike to be fascinating and informative, with lessons that span all of agriculture.</span></p> <p><span style=\"font-weight: 400;\">Listen to this conversation to hear Mike explain:</span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">His very practical experience and cost/benefit analysis with mulch, compost, cover crops and interplanting</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How mow-and-blow replaced Mike’s use of compost</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How plant sap analysis influenced his inputs management process</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mike’s extensive trials, and thinking process, for finding cover crops suitable for orchard alleyways</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Specific information on Ajuga (Ajuga reptans), Moneywort (Lysimachia nummularia), and Comfrey (Symphytum officinale var. patens)</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Nutritional defenses against the two major cherry diseases, bacterial canker and powdery mildew that he never imagined possible</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">An interesting anecdote on freeze resistance</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The value of fish and other inputs on orchard plantings</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The ROI on a bio-intensive system based on increased cherry size and firmness</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How biologically intensive practices and large scale production fit together</span></li> </ul> <p><span style=\"font-weight: 400;\">Resources:</span></p> <p><a href=\"https://drive.google.com/file/d/1KjosdEu2xWvtlD3pFjENSiKwoXbJGBqf/view?usp=sharing\"> <span style=\"font-weight: 400;\">SeaShield</span></a> <span style=\"font-weight: 400;\">(fish product mentioned by Mike)</span></p> <p><span style=\"font-weight: 400;\">Mike’s recommended sources for information:</span></p> <p><a href=\"https://www.youtube.com/results?search_query=how+to+grow+cherries+largescale\"> <span style=\"font-weight: 400;\">YouTube</span></a></p> <p><a href=\"https://www.amazon.com/Farming-Ladder-G-Henderson/dp/144650879X\"><span style=\"font-weight: 400;\"> The Farming Ladder by G. Henderson</span></a></p> <p>Please remember to support our Community Impact featured partners! <a href=\"https://www.acresusa.com\">Acres USA</a> is North America’s premier publisher on production-scale organic and sustainable farming. For more than four decades they have been helping farmers, ranchers and market gardeners grow food organically and sustainably. Acres USA is dedicated to the mission of educating growers about the benefits of ecological farming, with content that is designed to help you grow your operation in an ecologically and economically sound way. Check out their <a href=\"https://www.acresusa.com/collections/books-videos\">books</a>, <a href=\"https://www.acresusa.com/pages/tractor-time-podcast\">podcast</a>, and monthly <a href=\"https://www.acresusa.com/pages/about-acres-usa-magazine\">magazine</a>!</p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/?utm_source=libsyn&amp;utm_medium=podcast&amp;utm_medium=libsyn&amp;utm_campaign=episode_2.2\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com?subject=Regenerative%20Agriculture%20Podcast%20listener%20reaching%20out\" rel=\"noopener noreferrer\" target=\"_blank\">hello@advancingecoag.com</a> or call <a href=\"\" rel=\"noopener noreferrer\" target=\"_blank\">800-495-6603 extension 344</a> to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or booking request have a Podcast episode recorded LIVE at your event to <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly at <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was Recorded by John Kempf and Mike Omeg, Edited by Nathan Harman, Produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Tue, 16 Apr 2019 12:45:09 +0000", "duration": "01:25:22", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/the-regenerative-orchard-cherry-success-with-mike-omeg/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Success_is_Like__a_Box_of_Cherries_with_Mike_Omeg.mp3?dest-id=698390", "size": "124113757", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}