{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Using your Voice for Change with Michelle Grant (Founder The Great Full) | Ep. 14", "subtitle": "Using your Voice for Change with Michelle Grant (Founder The Great Full) | Ep. 14", "summary": "<p>Season 2 of The Great Full will include solo episodes like this one, where we dive into challenges you might face in your work to create change in the world. </p><p>One of the most common questions I hear from my coachees and students is: What to do when you face an inner resistance to being visible, using your voice and taking up space to make the contribution you want to? It is a topic I am all too familiar with, and over the years have found a lot of useful tools that can help. That is exactly what we will explore in this episode.</p><p>This episode is for you if you are called to create something, to put something out into the world that you think can be of service or impact others, but you feel held back by a lot of doubts about your own value or the value of the idea that you had. <br /><br />It&apos;s for you if you&apos;re stepping into a new leadership role and you feel held back by a lot of questions about how to do that and how to really take up your space there. <br /><br />It&apos;s also for you if you&apos;re hovering in the background, like you have a lot of potential, a lot of things that you would like to share but you feel a lot of fear or procrastination holding you back from actually doing what you&apos;re called to do. </p><p>To help you move forward, this episode explores:</p><ul><li>Common situations where you might have trouble using your voice, sharing things with the world or taking up your space</li><li>The real reasons we procrastinate, resist or get stuck in these situations </li><li>Why not having enough time is never the reason</li><li>The mindset we need if we want to create change and lead ourselves</li><li>The underlying fears that may be coming into play and holding us back</li><li>The influence of culture, socialisation and your individual lived experience</li><li>The multiple costs of not using your voice, including your own happiness</li><li>Four practical tools and methods you can use to help yourself move forward; including how to manage your inner critic.</li></ul><p>For more information about career and leadership coaching and trainings for women working in sustainability, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Sun, 28 Nov 2021 17:00:00 +0100", "duration": "2081", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/9623943-using-your-voice-for-change-with-michelle-grant-founder-the-great-full-ep-14.mp3", "size": "25021637", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}