{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Weather Resilience Through Cover Cropping - A Panel Discussion", "subtitle": "Weather Resilience Through Cover Cropping - A Panel Discussion", "summary": "<p><span style=\"font-weight: 400;\">Record rainfall has resulted in an unprecedented number of unplanted acres in 2019. Farmers must now consider how best to manage these fields for the remainder of the season. In an otherwise fallow year, cover cropping options abound during a unique summer planting window.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John Kempf hosts a panel of American Midwestern agronomists and farmers, Steve Groff, David Kleinschmidt, Brad Hobrock, and David Chance, to discuss wet weather, the inability to plant in sodden areas and the options to sow cover crops in empty fields. </span></p> <p><span style=\"font-weight: 400;\">David Kleinschmidt, a midwestern agronomist, and owner of Progressive Agronomy Consulting Services, consults with growers across the Midwest where his in-depth knowledge of soils and soil health helps farmers realize better yields.</span></p> <p><span style=\"font-weight: 400;\">Brad Hobrock is the owner of AgriBio Systems in Illinois where he farms several thousand acres of corn and soybeans. His voice and experience show the issues of cover cropping and weather challenges from a farmer’s perspective.</span></p> <p><span style=\"font-weight: 400;\">David Chance, the owner of Chance Farms and several thousand acres in Indiana, shares his expertise on cover crop mixes, dry weather planting, and farm subsidies. </span></p> <p><span style=\"font-weight: 400;\">Steve Groff, the Cover Crop Coach and founder at Cover Crop Coaching, is based in Pennsylvania. He travels across the country teaching farmers the techniques and value of cover cropping systems.</span></p> <p><span style=\"font-weight: 400;\">John and his guests outline the challenges farmers are facing this season, with a record number of unplanted corn and soybean acres throughout the Midwest due to excessive rain and flooding. They explain how cover crops can pay for themselves by decreasing the need for fertilizer applications while improving soils and yields in subsequent years. </span></p> <p><span style=\"font-weight: 400;\">Listen to hear a broad array of perspectives on: </span></p> <ul> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The benefits and drawbacks of various species and their best uses</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How to determine your cover crop mix with your goals and budget in mind</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">A comparison of simple one or two-species blends versus a diverse mix of cover crops</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The differences between cool- and warm-season legumes</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The value of cover crops in diffusing herbicide residue </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The value of cover crops in managing carbon and nitrogen</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The importance of bacterial and fungal inoculation</span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The role of crop insurance programs </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Which cover crops can shift the soil’s microbial population from bacterial to fungal dominance </span></li> <li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Which cover crops speed up the bioremediation process of pesticide residues in the soil profile</span></li> </ul> <p><span style=\"font-weight: 400;\">This podcast serves as an invaluable resource for any grower whose planting window has passed without the ability to get in the field and for anyone considering the use of cover crops.</span></p> <p dir=\"ltr\"><strong>The Community Impact Partner </strong>for this episode is the <a href=\"http://nofasummerconference.org/2019-program/\">NOFA Summer Conference</a>, a three-day conference that offers a wide-range of seminars, workshops, and other educational opportunities. Immerse yourself in a community of like-minded practitioners and curious learners eager to share inspiration and ideas for organic food, farming, health, activism, and beyond. The NOFA Summer Conference is a family-friendly event in Massachusetts where you can bring the whole family to enjoy workshops for adults, kids and teens, over 60 vendors, live music, games, and amazing food! <a href=\"http://nofasummerconference.org/register-now-2/\">Learn more about the conference and register here</a>.</p> <p dir=\"ltr\"> </p> <p dir=\"ltr\"><strong>The Community Impact Partner</strong> for this episode is also the <a href=\"https://www.acresusa.com/pages/healthy-soil-summit\">Healthy Soil Summit</a>. This August, Acres USA will host the Healthy Soil Summit in Davis, California. Join farmers, consultants, researchers, and others for two days of engaging learning from world-renowned experts in the field of regenerative agriculture including John Kempf, Gary Zimmer, and Brendan Rocky. Wherever you are in your farming journey, this event will provide you the tools to enhance the productivity and profitability of your operation through biological practices. Go to <a href=\"https://www.acresusa.com/pages/healthy-soil-summit\">acresusa.com</a> to learn more about the Healthy Soil Summit. Email us at <a href=\"mailto:events@acresusa.com\">events@acresusa.com</a> or call us at <a href=\"\">1-800-355-5313</a>.</p> <p dir=\"ltr\"> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or a booking request: <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly: <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was recorded by John Kempf, Steve Groff, David Chance, Brad Hobrock, and David Kleinschmidt, and produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Wed, 17 Jul 2019 11:51:33 +0000", "duration": "53:50", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/weather-resilience-through-cover-cropping-a-panel-discussion/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Weather_Resilience_and_Cover_Cropping.mp3?dest-id=698390", "size": "78710851", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}