{"version": 5, "show": {"title": "Agtech - So What?", "summary": null, "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/images/main.png?1668664897675", "link": "https://www.agtechsowhat.com/"}, "title": "What Commodity Agriculture Can Learn from Organic Farming, with Amy Bruch, Cyclone Farms", "subtitle": "What Commodity Agriculture Can Learn from Organic Farming, with Amy Bruch, Cyclone Farms", "summary": "<p>While the term “organic” tends to be associated with small-scale production and a  preference for manual tools over the latest technology, organic farming  advocates claim their methods can reduce the need for expensive inputs like fertilizers and herbicides, improve soil health, and allow farmers to differentiate their product in otherwise global commodity markets. So, what can commodity agriculture learn from organic farming? <br /><br />Our guest this week is Amy Bruch, a sixth-generation farmer of row crops, small grains, pulses, and oilseeds, and 2021 Organic Trade Association Organic Farmer of the Year. After starting her career as a systems engineer in food manufacturing, Amy travelled to work on large-scale soil improvement projects in Brazil. This experience “farming in another postcode” then led to her approach managing the family farm back in Eastern Nebraska, and turning nearly 2,500 acres into organic production.</p><p><br />In this episode, Amy talks about:</p><ul></ul><ul><li>How her experience improving degraded, acidic soils in regional Brazil makes her a better farmer at Cyclone Farms today</li><li>The benefits of combining organic production techniques AND new innovations in technology</li><li>How a focus on soil health is a gateway for more farmers to not only sequester more carbon, but also realize meaningful benefits for their crops &amp; bottom line</li><li>Why current organic farming standards are a potential onramp for farmers to adopt more “climate smart” agricultural practices</li></ul><p>For more information and resources, <a href=\"https://tenacious.ventures/insights#podcast-episodes\">visit our website</a>.<br /></p><p><br /></p>", "publicationDate": "Wed, 24 Aug 2022 20:00:00 +0000", "duration": "00:33:42", "poster": "https://feeds.backtracks.fm/feeds/series/a19b8b0e-6913-11ec-800c-0e4caa76571f/episodes/1795dcd0-22a8-11ed-bac9-120f0f1367ef/images/main.png?1668664899252", "link": "https://tenacious.ventures/podcast-episodes/amy-bruch-organic-farming-technology-commodities", "audio": [{"url": "https://backtracks.fm/tenacious/pr/179247dc-22a8-11ed-bac9-120f0f1367ef/ep143_amybruch_cyclonefarms.mp3?s=1&sd=1&u=1661234231", "size": "48565146", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": null}