{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "\"Who feeds us?\" Episode 4: Whole meal", "subtitle": "\"Who feeds us?\" Episode 4: Whole meal", "summary": "At the start of lockdown, as supermarket shelves were cleared of flour, people who might not otherwise have thought to seek out a local bakery – let alone a local mill – started to do just that. In this episode, we’ll hear about how this sudden upsurge in demand presented a huge challenge for these small-scale bakers and millers – but it was a challenge they met with enthusiasm and ingenuity, as well as a deep sense of responsibility to their communities.\n\nAt one time, pretty much every town and village had its own flour mill, driven by wind or water. Today, across the whole of London, just one working windmill remains – Brixton Windmill. It’s a unique heritage site with a rich educational programme. But as lockdown began, the mill became much more than a historic curiosity – and its volunteers found themselves providing a vital service to the local community. Meanwhile, bakers across the country, from the city of Bristol to the highlands of Scotland, were baking nourishing loaves for the people who needed them most. \n\nThese bakers and millers, many of whom have spent the last few years investigating the connections between the bread, the mills, the farms that produce the grain, and, crucially, the soil in which that grain grows, are engaged in building a better system – one that looks very different to the one that produces most of the bread we eat in the UK today. When inflexible, centralised supermarket supply chains buckled, join us to learn how they were able to carry on producing flour, baking bread and feeding people – thanks to the localised, adaptable, human-scale infrastructure they’re part of.\n\nHow can we grow that infrastructure? How can we all become part of a more resilient, equitable, efficient and enjoyable bread system? How can we help local millers stock local takeaways with bread baked with their flour? How can we help people to understand that, if they care about good bread, they also have to care about healthy soil? And how can we make sure that we celebrate everyone involved in making our bread – and that we listen to what they have to say?\n\nFeaturing:\nAbigail Holsborough: https://www.brixtonwindmill.org/\nRosy Benson: https://www.fieldbakery.com/\nRosie Gray: http://www.revivingfood.co.uk/\n\nFarmerama.co\nProducer: Dave Pickering\nExecutive Producers: Jo Barratt, Katie Revell, Abby Rose\nCommunity Collaborators: Cathy St Germans, Col Gordon\nProject Manager: Olivia Oldham\nArtwork: Hannah Grace www.hgraceoc.com/\nMusic: Michael O'Neil\nPR & Comms: Fran Bailey, Kate Lam, Elma Glasgow, Nancy Brownlow\n\nWho Feeds Us? is possible thanks to the Farming the Future COVID Response Fund. We’re very grateful to The A Team Foundation, the Roddick Foundation, Thirty Percy and the Samworth Foundation for providing the funds to make this project happen.", "publicationDate": "Sun, 01 Nov 2020 17:25:31 +0000", "duration": "00:39:22", "poster": "https://i1.sndcdn.com/artworks-HsVnyrI0i8yZ6tcu-qJUB6w-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/who-feeds-us-episode-4-whole-meal", "audio": [{"url": "https://feeds.soundcloud.com/stream/921549865-farmerama-radio-who-feeds-us-episode-4-whole-meal.mp3", "size": "56764753", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}