{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "\"Who feeds us?\" Episode 2: Land, animal, journey", "subtitle": "\"Who feeds us?\" Episode 2: Land, animal, journey", "summary": "American poet and farmer Gary Snyder writes of the interconnectedness and interdependence of the food chain. He says, “To acknowledge that each of us at the table will eventually be part of the meal is not just being ‘realistic.’ It is allowing the sacred to enter and accepting the sacramental aspect of our shaky temporary personal being.” In this episode, we explore the ways in which a growing consciousness is developing around food, based on ideas of reverence, and gratitude.\n\nHow have the people who care for the animals that feed us – both in life and in death – changed during this time of crisis? How has the way they understand the future of food been altered by the pandemic, and their own responses to it? How do they see their own place in that future? Who Feeds Us? is a celebration of these key workers, a thank you and a call to action – so we don’t forget just how ‘key’ they are.\n\nFeaturing:\nDean Wright: https://www.ballyliskofarmagh.com/\nMuhsen Hassanin: https://abrahamshalalmeat.com/\nJohn Martin Tulloch: https://www.tasteofshetland.com/producers/island-fish-shetland-ltd\n\nFarmerama.co\n\nProducer: Phil Smith\nExecutive Producers: Jo Barratt, Katie Revell, Abby Rose\nCommunity Collaborators: Zain Dada, Col Gordon, Fern Towers\nArtwork: Hannah Grace https://www.hgraceoc.com/\nMusic: Michael O'Neil\n\nProject Manager: Olivia Oldham\nPR & Comms: Fran Bailey, Kate Lam, Elma Glasgow, Nancy Brownlow\n\nWho Feeds Us? is possible thanks to the Farming the Future COVID Response Fund. We’re very grateful to The A Team Foundation, the Roddick Foundation, Thirty Percy and the Samworth Foundation for providing the funds to make this project happen.", "publicationDate": "Sun, 18 Oct 2020 10:08:55 +0000", "duration": "00:43:50", "poster": "https://i1.sndcdn.com/artworks-9Z5yR3BNyO6J3I6L-MF24GQ-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/who-feeds-us-episode-1-land-animal-journey", "audio": [{"url": "https://feeds.soundcloud.com/stream/912619477-farmerama-radio-who-feeds-us-episode-1-land-animal-journey.mp3", "size": "63196517", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}