{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Youth Leading Change with Yumna and Nabeeha (Bite Back 2030 Youth Board) | Ep. 23", "subtitle": "Youth Leading Change with Yumna and Nabeeha (Bite Back 2030 Youth Board) | Ep. 23", "summary": "<p>This week I am chatting with Nabeeha and Yumna, two incredibly inspiring high school students who are on a mission to make healthy food accessible to all children in the UK through their engagement with Bite Back 2030. <br /><br />Founded by Jamie Oliver but fully youth-led, Bite Back 2030’s mission is to enable better access to healthy food for everyone and to create more sustainable food systems. Yumna and Nabeeha are on the youth board and in this episode we hear their inspiring stories of youth leading change.<br /><br />We chat about:</p><ul><li>How Yumna and Nabeeha started campaigning for healthier food for young people while still in school</li><li>How their own lived experience and personal stories motivated them to stand up and demand change</li><li>Bite Back’s most recent campaign to end junk food advertising in the UK</li><li>How fast food restaurants actively targeting young consumers</li><li>How Yumna and Nabeeha feel about the praise but lack of support from adults in their efforts to lead change</li><li>Important leadership skills they have learned from each other on their journey</li><li>The problems in the food system from a young person’s perspective</li><li>They action they want their government representatives to take</li><li>How they both navigate the overwhelm from juggling campaigning while they’re still at school</li></ul><p>“Our government needs to do more to make sure that young people’s voice and their concerns are not being taken as tick-boxes but are directly embedded within decision-making. And, you know, we aren’t necessarily asking for seats at the table any longer - we’re building our own tables, we’re building our own chairs and we’re making spaces where young people’s voices truly matter.” Yumna<br /><br />Further information:</p><ul><li>Find out more about Bite Back 2030 here: <a href=\"https://www.biteback2030.com/\">https://www.biteback2030.com/</a></li><li>Need support on your leadership journey to create sustainable change? Join the next cohort of the Be The Change group coaching and leadership training program starting in Sept 2022: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a></li><li>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a></li><li>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></li><li>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</li></ul><p><br /></p>", "publicationDate": "Mon, 06 Jun 2022 17:00:00 +0200", "duration": "2430", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/10745566-youth-leading-change-with-yumna-and-nabeeha-bite-back-2030-youth-board-ep-23.mp3", "size": "29201895", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}