{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "A Conversation With Plants & Pascal Fafard", "subtitle": "A Conversation With Plants & Pascal Fafard", "summary": "<p><span style=\"font-weight: 400;\">Pascal Fafard is a consultant and crop advisor in Quebec, Canada, working primarily with fruit and vegetable growers.</span></p> <p><span style=\"font-weight: 400;\">He holds a bachelor’s degree in agronomy and has been supporting and mentoring fruit and vegetable growers for more than 25 years. While working in IPM, nutrition and vitality advising, and the typical agronomic considerations, he realized that taking care of growers is as important as the grower taking care of plants.</span></p> <p><span style=\"font-weight: 400;\">This shift in focus led to his unique take on agriculture that has inspired advisors and growers to adopt more intuitive farming practices in the hopes of fostering greater peace of mind, increased clarity and enjoyment, better plant vitality and improved business productivity.</span></p> <p><span style=\"font-weight: 400;\">As you will hear, Pascal is committed to life in all its many forms and brings a perspective that stresses the importance of a close partnership between man and nature. His innovative approach encourages advisors and growers to unlock their full potential and to strive to realize what is most important to them.</span></p> <p><span style=\"font-weight: 400;\">This episode is largely the story of Pascal's</span> <span style=\"font-weight: 400;\">thought</span> <span style=\"font-weight: 400;\">journey on the nature of farming, the relationships we hold with nature, and the opportunity to make both more meaningful. He and John talk about the development of techniques to increase communication between growers and their plants, and a much more subtle way of interacting with our crops, which is intended to provide greater fulfillment to the grower, and better results.</span></p> <p><span style=\"font-weight: 400;\">We may be challenged to step outside our comfort zones, hearing what Pascal offers, but one may find it to be of great value.</span></p> <p><span style=\"font-weight: 400;\">\"If there is something I want to say today...my only desire is... open new possibility to the grower, and if there is something that resonates in themselves from what I say, just take it. If there is something that doesn't talk to you just...throw it in the garbage.”</span></p> <p><span style=\"font-weight: 400;\">In this episode, John asks the question \"What is it that plants desire from the grower?\"</span></p> <p><span style=\"font-weight: 400;\">This episode introduces a Regenerative Agriculture Podcast first: quotes from actual plants, as translated by Pascal.</span></p> <p style=\"padding-left: 30px;\"><span style=\"font-weight: 400;\">He notes that \"When you communicate with nature you can receive information as a thought, as an image, as an emotion, you can be pulled to go somewhere in the field. It depends on the person...be open minded...it's got to be your way.\"</span></p> <p><span style=\"font-weight: 400;\">There are many stories from the field and a few action items, but this interview is not about science and agronomy.</span> <span style=\"font-weight: 400;\">It's about a farmers relationship to life, and passion for the work of farming. These are esoteric concepts that Fafard presents eloquently and practically.</span></p> <p>Pascal's course suggestions:</p> <p style=\"padding-left: 30px;\">Maya Kincaid: <a href=\"https://animalcommunicationworld.com/\">The Sedona International School for Animal and Nature Communication</a></p> <p style=\"padding-left: 30px;\">Pranic Healing - International course offerings: (USA EAST site: <a href=\"https://pranichealingusa.com/\" rel=\"noopener noreferrer\" target=\"_blank\">https://pranichealingusa.com/</a>) (USA west site: <a href=\"https://pranichealing.com/\" rel=\"noopener noreferrer\" target=\"_blank\">https://pranichealing.com/</a>)</p> <p style=\"padding-left: 30px;\">And John's suggested reading on the topic: <a href=\"https://www.chelseagreen.com/product/the-lost-language-of-plants/\">The Lost Language of Plants</a> and <a href=\"https://www.amazon.com/Secret-Teachings-Plants-Intelligence-Perception/dp/1591430356/ref=asc_df_1591430356/?tag=hyprod-20&amp;linkCode=df0&amp;hvadid=312136634064&amp;hvpos=1o1&amp;hvnetw=g&amp;hvrand=6947769901133628588&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=1017003&amp;hvtargid=pla-457998667089&amp;psc=1\"> The Secret Teachings of Plants</a>, both by Stephen Harrod Buhner.</p> <p style=\"padding-left: 30px;\">If you have questions or would like to set up a consultation with Pascal, please reach out to him at <a href=\"mailto:info@pascalfafard.com\">info@pascalfafard.com</a></p> <p> </p> <p>Please remember to support all of our Community Impact featured partners! Chelsea Green is an employee-owned and mission-driven company and a leading publisher of hundreds of great titles, including Gabe Brown's recent book, <a href=\"https://www.chelseagreen.com/product/dirt-to-soil/?UTM_SOURCE=REGENERATIVE_AGRICULTURE_PODCAST\" rel=\"noopener noreferrer\" target=\"_blank\">From Dirt To Soil</a> -- which we <a href=\"http://regenerativeagriculturepodcast.com/from-dirt-to-soil\" rel=\"noopener noreferrer\" target=\"_blank\">featured Gabe & his book on this show, in Season 1</a>. If you like this podcast, you will love their books. And there is just enough winter left to read a few. Visit them at <a href=\"http://www.chelseagreen.com/\">www.chelseagreen.com</a> and enter the code \"REAG30\" at checkout, for a generous discount just for listeners of this show.</p> <p>And finally, w<span style=\"font-weight: 400;\">e are very pleased to announce the recent release of AEA’s new online learning platform, the Regen.Ag Academy,</span> <a href=\"https://academy.regen.ag/?utm_source=podcast&amp;utm_medium=email&amp;utm_campaign=season_2&amp;utm_term=episode_2&amp;utm_content=launch_email\"> <span style=\"font-weight: 400;\">https://academy.regen.ag/</span></a></p> <p><span style=\"font-weight: 400;\">The first course is ready and more are on the way. This self-paced series of courses, each comprised of multiple video lessons, and graded quizzes, is geared toward the agricultural professional, Certified Crop Advisor (CCA), student, or highly motivated grower who wants to further their studies in regenerative agronomy. It is an accredited course and can be taken for CEU points from the ASA. We've been working hard to set up a platform where the best of John Kempf's teachings can be received, and where you can assess your own knowledge. We look forward to your participation and feedback. <a href=\"https://academy.regen.ag/?utm_source=podcast&amp;utm_medium=email&amp;utm_campaign=season_2&amp;utm_term=episode_2&amp;utm_content=launch_email\"> Check out Regen.Ag Academy here</a>, and sign up to be notified of future course releases.</span></p> <p><span style=\"font-weight: 400;\">Thanks for Listening!</span></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/?utm_source=libsyn&amp;utm_medium=podcast&amp;utm_medium=libsyn&amp;utm_campaign=episode_2.2\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large-scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com?subject=Regenerative%20Agriculture%20Podcast%20listener%20reaching%20out\" rel=\"noopener noreferrer\" target=\"_blank\">hello@advancingecoag.com</a> or call <a href=\"\" rel=\"noopener noreferrer\" target=\"_blank\">800-495-6603 extension 344</a> to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or booking request have a Podcast episode recorded LIVE at your event -- to <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly at <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was Directed by Geoffrey Shively and Nathan Harman, Edited by Nathan Harman, Produced by Nathan Harman, Robin Kitowski, and Jenna Sodano.</p>", "publicationDate": "Tue, 12 Mar 2019 04:00:00 +0000", "duration": "01:19:06", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/a-conversation-with-plants-pascal-fafard/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/RAP_S2E2_Pascal_Fafard.mp3?dest-id=698390", "size": "113885013", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}