{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Encouraging Achievement on the Farm with Vernon Peterson", "subtitle": "Encouraging Achievement on the Farm with Vernon Peterson", "summary": "<p><span style=\"font-weight: 400;\">John Kempf and Vernon Peterson take the stage for a live-recorded conversation at the inaugural Acres U.S.A. Healthy Soil Summit, held at the University of California Davis Conference Center on August 21, 2019, for this Regenerative Agriculture Podcast episode. </span></p> <p><span style=\"font-weight: 400;\">Vernon’s experiences from 30 years of growing tree fruit and other crops on both conventional and organic acreage in California’s water, weather, and labor-challenged environment inform the wisdom he posits here. </span></p> <p><span style=\"font-weight: 400;\">Peterson was the recipient of the Grower of the Year Award from the California Certified Organic Farmers Association and the Organic Produce Network in 2017. He farms 300 acres of stone fruit, including peaches, plums, nectarines, and apricots. Vernon’s operation also packs fruit for almost 80 neighbors, including stone fruit, pomegranates, and citrus. </span></p> <p><span style=\"font-weight: 400;\">Listen to hear Vern’s strategies for activating employees to achieve their fullest potential, his knowledge of organic fruit production and marketing, and a call to farmers to tell their story through knowing the nutrient value of their food. Vernon also discusses how he’s formed a unique alliance of growers that work together in marketing, sales, operations, and compliance areas, resulting in successes for multiple small-scale organic operations.</span></p> <p><span style=\"font-weight: 400;\">Vernon describes the “aha!” moment when farmers realize that organic production is more than just the conventional input substitution. </span></p> <p><span style=\"font-weight: 400;\">He provides examples of measuring fruit tree production and worker productivity on his own operation, describing why it’s important for employees to have access to the data and tools needed for their own improvement. He shares how a simple pay scale increased the output quality without costing him more while paying the workers double. He makes the case for how extraordinarily close relationships with employees lead to greater business success.</span></p> <p><span style=\"font-weight: 400;\">Vernon also turns the ag production paradigm on its head when he suggests that growers should start by selling the crop, then focusing on marketing and packaging, before growing the fruit. He also shares his overarching goal of reinvigorating agriculture through organic production. He believes that documenting and publishing the nutritional quality of food holds the potential to turn the tide of agriculture in America.</span></p> <p><span style=\"font-weight: 400;\">Vernon’s recommended resources: </span></p> <p><a href=\"https://www.stockmangrassfarmer.com/index.php\"><span style=\"font-weight: 400;\">The Stockman Grass Farmer</span></a></p> <p><a href=\"http://www.bizbooksagsoftware.com/\"><span style=\"font-weight: 400;\">BizBooks Ag Software</span></a></p> <p><span style=\"font-weight: 400;\">The nutrient meter mentioned by John:</span></p> <p><a href=\"http://bionutrient.org/site/bionutrient-meter\"><span style=\"font-weight: 400;\">BioNutrient Food Association’s BioNutrient Meter</span></a></p> <p> </p> <p><span style=\"font-weight: 400;\">Our community impact spot for this episode is the cover crop provider,</span> <a href=\"https://www.greencoverseed.com/\"><span style=\"font-weight: 400;\">Green Cover Seed.</span></a> <span style=\"font-weight: 400;\">Green Cover Seed shares the benefits of cover crops with the farming community. They do an excellent job of conducting and disseminating research into cover crops species, blends, and uses. While there are many excellent cover crop providers out there, Green Cover Seed stands out for their education, outreach, and variety.</span></p> <p><span style=\"font-weight: 400;\">Website:</span> <a href=\"https://www.greencoverseed.com/\"><span style=\"font-weight: 400;\">https://www.greencoverseed.com</span></a></p> <p><span style=\"font-weight: 400;\">YouTube:</span> <span style=\"font-weight: 400;\"><a href=\"https://www.youtube.com/channel/UCfrK9tSdYXpHFxbhKxgcMbw\">https://www.youtube.com/channel/UCfrK9tSdYXpHFxbhKxgcMbw</a></span></p> <p> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or a booking request: <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly: <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was recorded live by John Kempf and Vernon Peterson at the <a href=\"https://www.acresusa.com/pages/healthy-soil-summit\">Healthy Soil Summit</a> and produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Tue, 27 Aug 2019 15:29:12 +0000", "duration": "57:15", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/encouraging-achievement-on-the-farm-with-vernon-peterson/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Vernon_Peterson_Encouraging_Achievement_on_the_Farm.mp3?dest-id=698390", "size": "110715816", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}