{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Episode #65: Jay Fuhrer", "subtitle": "Episode #65: Jay Fuhrer", "summary": "<p><span style=\"font-weight: 400;\">Jay Fuhrer is a Conservationist & veteran Soil Health Specialist from the Natural Resources Conservation Services, located out of Bismarck, North Dakota. With over 4 decades of experience, Jay’s work has been critical to the widespread implementation of regenerative agriculture across the globe. Of his many contributions, Jay is most known for developing the 5 Soil Health Principles: establishing soil armor, minimizing soil disturbance, continuing live plant and root presence, and integrating livestock grazing systems.</span></p> <p><span style=\"font-weight: 400;\">Throughout their conversation, Jay and John discuss:</span></p> <ul> <li><span style=\"font-weight: 400;\">Jay’s early years at the NRCS, and his desire to move forward with agriculture’s best interest at heart.</span></li> <li><span style=\"font-weight: 400;\">The story of how Jay and his colleagues started a 150-acre demonstration farm with a focus on natural resource education.</span></li> <li><span style=\"font-weight: 400;\">Examples of new research and discoveries being made at Menoken Farm, including the implications of water hydrology systems and the power of encouraging soil biology.</span></li> <li><span style=\"font-weight: 400;\">Jay’s observations from conducting Phospholipid fatty acid (PLFA) analysis and measuring infiltration rates over the years.</span></li> <li><span style=\"font-weight: 400;\">Assisting growers by “starting with the geology” and how Jay’s soil recommendations are rooted in the history of the land.</span></li> <li><span style=\"font-weight: 400;\">Proper livestock integration and the benefits of diversity when it comes to grazing.</span></li> <li><span style=\"font-weight: 400;\">The shortcomings of agricultural system labels and Jay’s reasoning for working with growers of all backgrounds.</span></li> <li><span style=\"font-weight: 400;\">Jay’s concerns with shrinking native range land in the Dakotas and why he believes it is an ecosystem that we should maintain into the future. </span></li> </ul>", "publicationDate": "Fri, 12 Mar 2021 18:35:58 +0000", "duration": "01:16:25", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/RAP_S4_EP_3_Jay_Fuhrer_FINAL_AUDIO.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/RAP_S4_EP_3_Jay_Fuhrer_FINAL_AUDIO.mp3?dest-id=698390", "size": "110262966", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}