{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "In Defense of Biological Systems with Robert Linderman", "subtitle": "In Defense of Biological Systems with Robert Linderman", "summary": "<p><span style=\"font-weight: 400;\">In our latest episode of the Regenerative Agriculture Podcast, John interviews plant pathology veteran & agricultural visionary, Dr. Robert Linderman, discussing the benefits of mycorrhizal fungi and other bio-control agents that protect crops from soil-borne pathogens. </span></p> <p><span style=\"font-weight: 400;\">After receiving his Ph.D. in Plant Pathology from U.C. Berkley in 1967, Robert would spend the next 40-plus years contributing pivotal research findings to the USDA and other agricultural organizations. During his time with the USDA, Robert was introduced to a colleague who was fascinated by the power of mycorrhizal fungi and their ability to keep pathogens at bay. Their conversation ignited Robert’s pursuit to understand mycorrhizae symbiosis.</span></p> <p><span style=\"font-weight: 400;\">Throughout the episode, John and Robert discuss the benefits of building up antagonistic organisms in the soil to create a disease suppressive environment, allowing crops to thrive. In addition to other educated approaches to battling pathogens in your soil, Robert also takes listeners into a deep dive of the Ashburner System, telling the story of how one Australian avocado grower utilized a mycorrhizal fungi strategy—without even knowing it—to suppress phytophthora outbreak across his orchard. </span></p> <p><span style=\"font-weight: 400;\">“Farms, whether they're seeding or transplanting or planting bulbs or whatever, need to treat that material where the infection is going to happen…to have something there waiting for the pathogen when it tries to get into the plant is the best chance. It's like immunizing a child for infections that might come. You build up some kind of resistance and the resistance is in a biological form.” -Linderman</span></p> <p><span style=\"font-weight: 400;\">Robert and John also discuss the thoughtful inoculation of propagules, mycorrhizal fungi’s effect on photosynthesis, concerns about single factor analysis found in agricultural research, and the true price of the “instant gratification” chemical fix.</span></p>", "publicationDate": "Tue, 11 Aug 2020 17:18:55 +0000", "duration": "01:19:38", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/Regen_Ag_Podcast_Linderman_FINAL.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Regen_Ag_Podcast_Linderman_FINAL.mp3?dest-id=698390", "size": "154102198", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}