{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Rebuilding Rural Economies with Ancient Grain and Regenerative Practices with Bob Quinn", "subtitle": "Rebuilding Rural Economies with Ancient Grain and Regenerative Practices with Bob Quinn", "summary": "<p><span style=\"font-weight: 400;\">Bob Quinn is a 30-plus year veteran of Regenerative Organic practices and founder of Kamut International, an organization devoted to high quality Khorasan wheat and sustainable agricultural practices.</span></p> <p><span style=\"font-weight: 400;\">After receiving his PhD in plant biochemistry from UC-Davis, Bob returned home to work on his family’s wheat and cattle ranch just outside of Big Sandy, Montana. In the mid 80’s, the farm became his “laboratory” as Bob began implementing regenerative organic systems long before they rose to prominence. The Quinn’s began planting a Khorasan wheat they would call “Kamut”—an ancient Egyptian word for “wheat”—which would end up seeing a lot of success with whole grain bakeries in Southern California.</span></p> <p><span style=\"font-weight: 400;\">“My business philosophy is start small and build on your success. I don't have a big pile of money, so I can't go out and just try big experiments, so I try small experiments. If they're successful, then I build on those. And that's what we did, we started with a half an acre [of Kamut®] which was all that seed that we had in 1988—30 years later, we are contracting with 250 organic regenerative farmers in Montana, Alberta, and Saskatchewan for over 100,000 acres of this stuff.”</span></p> <p><span style=\"font-weight: 400;\">Kamut® is a distant relative to the modern wheat crop that is known for its unique flavor and health benefits. Ancient Grains like Kamut® see much lower yield potential than modern wheat, which over time lead some manufacturers to mix Kamut® with lower quality grains. In an attempt to protect the quality of the grain and the end consumer, Bob decided to trademark the grain, guaranteeing an unhybridized, unmodified, and organic product for their growing list of customers—in fact today, a staggering 75% of their grain goes to Italy.</span></p> <p><span style=\"font-weight: 400;\">During the episode, Bob goes into detail about how improved testing equipment led to a surprising discovery about minute glyphosate levels in their crops. Kamut International has been organic since its inception, but at one point almost a third of their farmers were sending grain that tested slightly higher than ten parts per billion in glyphosate. Bob was astounded when he discovered that glyphosate is so prevalent in American agriculture that trace amounts can be found in the rain during the growing season. Since this discovery, Kamut International has overhauled their testing protocols and mitigated trace glyphosate levels whenever possible.</span></p> <p><span style=\"font-weight: 400;\">Whether you are the buyer, the manufacturer, or the consumer, Bob believes in a “everybody wins” approach to business. He believes his impact and scale was achieved by paying farmers more, so he prides himself in the ability to implement economic incentives anywhere he can. Bob recalls in his conversation with John that almost 30 years ago, he began offering three times the amount of the commodity wheat price for Kamut® wheat, which proved to be a very effective business move. Today, that incentive has grown to five times the commodity price.</span></p> <p><span style=\"font-weight: 400;\">Bob’s expertise goes way beyond wheat, for a farmer located in the Upper Great Plains he has an unlikely variety of successfully growing dryland produce. Throughout the episode, Bob goes into detail about how this production came to be and how regenerative organic practices allow him to grow things like watermelon and summer squash in Montana. Bob and John also discuss nutritional value of ancient grains, how the western diet has led to a jump in autoimmune disorders, and the concerning rise of glyphosate levels in our food. Bob also tells the story of how his company accidentally came upon creating cooking oil in the search to create a better diesel fuel. </span></p>", "publicationDate": "Tue, 15 Sep 2020 17:07:14 +0000", "duration": "01:06:46", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://traffic.libsyn.com/secure/regenerativeagriculture/Bob_Quinn_Final_Audio_RAP_S3_Ep_17.mp3", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Bob_Quinn_Final_Audio_RAP_S3_Ep_17.mp3?dest-id=698390", "size": "96355625", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}