{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "Relay Cropping Grain with Jason Mauck", "subtitle": "Relay Cropping Grain with Jason Mauck", "summary": "<p><span style=\"font-weight: 400;\">In this episode of The Regenerative Agriculture Podcast, John interviews Jason Mauck, an Indiana corn, soybean, wheat, and hog producer who thinks outside the borders of convention and who has pioneered a number of innovative practices.</span></p> <p><span style=\"font-weight: 400;\">Jason describes the guiding force behind his experiments and innovation as the desire to gain as much control over the variables in farming as possible. Rather than embracing traditional planting and application methods, Jason experiments with new approaches to farming, measuring whether they give him more resilience and control over his inputs and yields.</span></p> <p><span style=\"font-weight: 400;\">Jason is passionate about relay cropping, the practice of having a second crop growing before the first crop is harvested. An example of this is a cool grass cereal such as wheat or rye planted with a summer annual of corn or soybeans. He describes his experimentation with this approach, from the original plan of planting two crops together and doing all of the same things he would do for each crop planted separately, to his current understanding of the equilibrium needed to successfully bring both crops to maturity with a productive harvest. He has experimented with modifying the width of the rows to accommodate the needs of both growing crops. He also discusses the role manure management plays in his farming operation, and how his goal is to use this source of nitrogen to decrease his dependence on off-farm inputs.</span></p> <p><span style=\"font-weight: 400;\">In this interview, Jason talks about seldom discussed ideas, such as the phi angle of plant expression, which he describes as coordinating plantings so the solar angles reach the intercropped species. Also, he describes how a farmer can influence 6-ear corn or 200-seed wheat by following the principles of the Golden Mean. Jason talks about the conventional rationale of farmers, by which seed is planted with high hopes, given plenty of nitrogen and all the “by-the-book” fungicide and herbicide applications, and how his approach differs. Alternatively, he thinks of maximizing his yield with on-farm inputs and minimal costs, as well as considering the benefits of water absorption and soil biology the planting adds to the ecosystem.</span></p> <p><span style=\"font-weight: 400;\">Jason also talks at length about farm economics, and how to increase the contribution margin by decreasing the input costs while employing methods to increase yields. Listen to this episode to hear from one of the most innovative young farming voices in the United States, and follow his social media channels below to keep up with his stream of ideas and measured experiments.</span></p> <p><strong>Resources:</strong></p> <p><a href=\"https://twitter.com/jasonmauck1\"><span style=\"font-weight: 400;\">Jason Mauck’s Twitter</span></a></p> <p><a href=\"https://www.youtube.com/channel/UCF0lbgkWF2J2qStJYk2ih7w/featured\"> <span style=\"font-weight: 400;\">Jason Mauck’s YouTube</span></a></p> <p><a href=\"https://t.co/BvWU77avtN?amp=1\"><span style=\"font-weight: 400;\">Constant Canopy website</span></a></p> <p><span style=\"font-weight: 400;\"><br /> <br /></span></p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Mon, 24 Feb 2020 20:47:30 +0000", "duration": "50:22", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/relay-cropping-grain-with-jason-mauck/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/Relay_Cropping_with_Jason_Mauck.mp3?dest-id=698390", "size": "97656619", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}