{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "The Carbon Capture Business with Jerry Hatfield", "subtitle": "The Carbon Capture Business with Jerry Hatfield", "summary": "<p dir=\"ltr\">In this episode of the Regenerative Agriculture Podcast, John interviews Dr. Jerry Hatfield, Ph.D., a plant physiologist who runs the USDA’s Agricultural Research Service (ARS) National Laboratory for Agriculture and the Environment in Ames, Iowa. Jerry has done extensive research on the interactions between soils, plants, and the environment. Jerry describes his findings from some of these tests which track interactions among different types of cover crops with different soil and plant variables. Jerry also studies agriculture as a molecular geneticist, testing which genes are activated in plants during drought versus flood conditions and other environmental factors.</p> <p>John and Jerry also discuss the differences between the terms sustainable agriculture and regenerative agriculture, and answer the questions: What are the steps to regenerative agriculture? What is the return on this type of system?</p> <p>To quote Jerry, “If you go down this road of improving your soil, you increase your profitability, you increase your yield stability, and you'll sleep better at night.”</p> <p>In this episode John and Jerry cover:</p> <ul> <li>The carbon balance in terms of improving the soil-plant-health continuum</li> <li>The roadmap provided by regenerative agriculture for increased profitability</li> <li>The needs of biology and how to fuel those needs to provide climate resilience</li> </ul> <p dir=\"ltr\">Listen to learn how the carbon cycle can shift and change when growers begin to manage soils and crops differently with regenerative management, rather than with present mainstream management. Jerry says, “Agriculture is in the carbon capture business,” and this episode explains why, drilling into the role of carbon in regenerative agriculture.</p> <p dir=\"ltr\"><strong>The Community Impact Partner </strong>for this episode is the <a href=\"https://regenorganic.org/\" id=\"CmCaReT\" name=\"CmCaReT\">Regenerative Organic Alliance</a>, the developer of the Regenerative Organic Certification, a holistic agriculture certification encompassing pasture-based animal welfare, fairness for farmers and workers, and robust requirements for soil health and land management. Brands are already seeking to bring ROC-certified products into their supply chain. You are invited to research and join the ROC program. The first step is to <a href=\"https://regenorganic.org/pdf/ROC-Participant-Handbook.pdf\">download the ROC Participant Handbook</a> on their website.</p> <p dir=\"ltr\"> </p> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p> <p> </p> <p><strong>Sign Up For Email Updates</strong></p> <p>To be alerted via email when new episodes are released, and get special updates about John speaking, teaching, and podcast LIVE recordings, be sure <a href=\"http://eepurl.com/drP495\">to sign up for The Regenerative Agriculture Podcast email list</a>.</p> <p> </p> <p><strong>Feedback & Booking</strong></p> <p>Please send your feedback, requests for topics or guests, or a booking request: <a href=\"mailto:production@regenerativeagriculturepodcast.com\">production@regenerativeagriculturepodcast.com</a></p> <p>Email John directly: <a href=\"mailto:John@regenerativeagriculturepodcast.com\">John@regenerativeagriculturepodcast.com</a></p> <p> </p> <p><strong>Credits</strong></p> <p>This episode was recorded by John Kempf and Jerry Hatfield, and produced by Nathan Harman, Robin Kitowski, and Anna Kempf.</p>", "publicationDate": "Tue, 11 Jun 2019 11:44:00 +0000", "duration": "52:31", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/the-carbon-capture-business-with-jerry-hatfield/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/The_Carbon_Capture_Business.mp3?dest-id=698390", "size": "102592401", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}