{"version": 5, "show": {"title": "Regenerative Agriculture Podcast", "summary": "This is a show for professional growers and agronomists who want to learn about the science and principles of regenerative agriculture systems to increase quality, yield, and profitability.", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "http://www.regenerativeagriculturepodcast.com"}, "title": "The Role of Carbon in the Soil with Rattan Lal", "subtitle": "The Role of Carbon in the Soil with Rattan Lal", "summary": "<p><span style=\"font-weight: 400;\">In this episode of the Regenerative Agriculture Podcast, John interviews Dr. Rattan Lal, an acclaimed soil scientist, researcher, and author. Dr. Lal has published hundreds of journal articles on soil ecosystems, effects of tillage, global food security, sequestering carbon in the soil, and more. In the early 1990s, Dr. Lal was a pioneer of the now mainstream idea that healthy soils are a defense against rising levels of carbon dioxide in the atmosphere, leading groundbreaking research in Africa and later in South America.  After a long and storied career, he is currently the Director of the CFAES Carbon Management and Sequestration Center, where he works with graduate students to research soil carbon sequestration and climate change. In this episode of the podcast, Dr. Lal provides an in-depth description of the function of carbon. </span></p> <p><span style=\"font-weight: 400;\">Carbon is the determinant of healthy soil. As Dr. Lal describes, the reason that soil life is much more diverse in healthy soil is because organic carbon is the food for soil organisms. Thus, the healthier the soil, the higher the percentage of organic carbon, providing more diverse populations with the ability to thrive. This is also why, if crop residue isn’t returned to the soil frequently, the soil organisms will starve and the soil will eventually die. By dying, Dr. Lal means the soil will no longer contain enough living organisms to carry on the biogeochemical and biogeophysical processes needed for healthy plant growth. </span></p> <p><span style=\"font-weight: 400;\">Dr. Lal outlines the concentrations of organic carbon in the soil, which should be approximately 2% in the top 8 to 12 inches. Maintaining this level of soil carbon is essential for water retention and for controlling soil erosion and leaching. It’s also critical for nutrient cycling and improved soil structure. Dr. Lal states that CNPK should be the slogan for the application of elements, rather than NPK because carbon is such a critical component of a healthy soil system.</span></p> <p><span style=\"font-weight: 400;\">Dr. Lal details how carbon is essential for the utilization of the nutrients in the soil, whether they are native or applied, and illustrates the management of soil carbon levels by describing it in similar terms to managing a bank account. In a bank account, the goal is to increase the savings, and therefore what is deposited into the bank must always be more than what is withdrawn from the bank. Soil is exactly the same way. If we want the organic matter to increase in the soil, what we put in as a biomass carbon must be more than what is taken out. </span></p> <p><span style=\"font-weight: 400;\">We lose carbon from the soil for four different reasons. These reasons are erosion, leaching, decomposition, and volatilization. It’s important to know the amount of carbon loss happening from the soil so we can add a sufficient amount of biomass carbon back to the soil. The efficiency of humidification is about 15-20%, meaning the carbon added into the soil after harvest is 15 -20% of the original biomass after one year.</span></p> <p><span style=\"font-weight: 400;\">Dr. Lal says that the ratio of carbon to nitrogen in corn or wheat residue is approximately 80:100, while the carbon to nitrogen ratio of humus is 12:15. That means the humus is more enriched in nitrogen, phosphorus, and sulfur. Therefore, to make the most efficient use of the added biomass, microbes need nitrogen, phosphorus, sulfur, and other elements to transform the residue carbon into humus carbon. In an experiment on Dr. Lal’s current Columbus, OH research farm, he developed four plots with 4, 8, 12, or 16 tons of biomass per hectare respectively. He then cut each plot into two and added extra nitrogen and phosphorus on the one side of the plot and no additional nutrients on the other side. The results showed the percentage of residue converted into stable humus is substantially increased when extra nitrogen, phosphorus, and other nutrients are added then when there are none.</span></p> <p><span style=\"font-weight: 400;\">Dr. Lal also describes his thoughts on providing farmers with compensation for ecosystem services. As a society, we could ask farmers to provide services to the global community such as carbon sequestration and the improvement of water quality. Dr. Lal believes society should be willing to compensate farmers for these services. He describes how he’s calculated the cost farmers should be paid and has determined a baseline of $16 per acre per year by calculating in terms of tons of carbon and the worth of that carbon ($125 per ton) sequestered in soil as organic matter. Dr. Lal’s outlined system of ecosystem services is not similar to a subsidy but is rather a payment earned for services performed. Dr. Lal also describes the necessity of passing a Healthy Soil Act. Similar to the Clean Air and Clean Water Acts, the Healthy Soil Act would be critically important to human health and to the slowing of climate change. Dr. Lal believes the passage of this act is especially critical because of the impact soil has on both air and water. Soil is the link between the atmosphere, the environment, plants, animals, and people.</span></p> <p><span style=\"font-weight: 400;\">This episode is densely packed with information about soil health and how to achieve it, not only for farmers but also for policymakers and educators. As Dr. Lal says in his closing remarks, \"Agriculture, if done properly, has to be a solution to environmental issues.”</span></p> <p><strong>Resources:</strong></p> <ul> <li><a href=\"https://cfaes.osu.edu/stories/rattan-lal-our-soils-rock-star\"><span style=\"font-weight: 400;\"> Dr. Rattan Lal, Soil Rock Star</span></a></li> <li><a href=\"https://www.jswconline.org/content/69/6/186A\"><span style=\"font-weight: 400;\">Societal Value of Soil Carbon journal article</span></a></li> <li><a href=\"https://www.jswconline.org/content/74/4/81A\"><span style=\"font-weight: 400;\">Rights of Soil journal article</span></a></li> </ul> <p dir=\"ltr\"><strong>Support For This Show</strong></p> <p>This show is brought to you by <a href=\"http://www.advancingecoag.com/\" title=\"Regenerative agriculture products and services\">AEA</a>, helping professional growers make more money using regenerative agriculture since 2006.</p> <p>If you grow on a large scale and are looking to increase crop revenue and quality, email <a href=\"mailto:hello@advancingecoag.com\">hello@advancingecoag.com</a> or call <a href=\"\">800-495-6603 </a>to be connected with a dedicated AEA crop consultant.</p>", "publicationDate": "Mon, 11 May 2020 20:47:15 +0000", "duration": "34:46", "poster": "https://ssl-static.libsyn.com/p/assets/d/1/6/2/d1629a78885f4c0b/RegenerativeAgricultureShow-Show-main.png", "link": "https://podcast.vhostevents.com/uncategorized/the-role-of-carbon-in-the-soil-with-rattan-lal/", "audio": [{"url": "https://traffic.libsyn.com/secure/regenerativeagriculture/The_Role_of_Carbon_in_the_Soil_with_Rattan_Lal.mp3?dest-id=698390", "size": "68105366", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "John Kempf"}]}