{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Building a Better Food System with Jerusha Klemperer (Director FoodPrint) | Ep. 22", "subtitle": "Building a Better Food System with Jerusha Klemperer (Director FoodPrint) | Ep. 22", "summary": "<p>My guest this episode is Jerusha Klemperer, the Director of <a href=\"http://FoodPrint.org\">FoodPrint.org</a>, a media platform dedicated to helping people understand the impact of what they eat on animals, planet and people.<br /> <br />Prior to leading FoodPrint, Jerusha was a Co-Founder of FoodCorps, an organization that works with local communities around the US to serve healthy food in schools, and before that led campaigns at Slow Food USA. She has a 15+ year career working for places with “food” in the title, to support a food system that is better for the planet, more just, more humane and more delicious.<br /><br />We chat about the lessons Jerusha has learned in her various food roles,  how everyone can contribute towards a more sustainable food system, and how she sees the role of anger, storytelling and inspiration in communicating important issues.<br /><br />The topics we cover are:</p><ul><li>How Jerusha started working with food after starting her career as an actor</li><li>The one book that made her (and me!) aware of the problems in the food system</li><li>What she learned while working on improving school lunches with Slow Food USA and  FoodCorps</li><li>How to work out what your Foodprint is, and what to do to reduce it</li><li>How you can start eating more sustainably today</li><li>The role of anger in advocating for sustainability and change</li><li>What inspires and motivates Jerusha to stay positive in challenging times</li><li>The hype around plant-based meat alternatives, its consequences for people and the planet and the critical questions we should be asking</li><li>Leadership practices that have inspired Jerusha though her work</li><li>Storytelling and its role in creating change</li></ul><p>Resources mentioned in the episode:</p><ul><li>The book <a href=\"https://www.goodreads.com/en/book/show/1097.Fast_Food_Nation\">“Fast Food Nation” by Eric Schlosser</a></li><li>Guides by FoodPrint on how to start eating more sustainably: <a href=\"https://foodprint.org/eating-sustainably/\">https://foodprint.org/eating-sustainably/</a></li><li>The “What You’re Eating” Podcast: <a href=\"https://foodprint.org/what-youre-eating/\">https://foodprint.org/what-youre-eating/</a></li></ul><p>Further information:</p><ul><li>Learn more about Food Print on their <a href=\"https://foodprint.org/\">website</a>, <a href=\"https://twitter.com/foodprintorg\">Twitter</a>, <a href=\"https://www.facebook.com/FoodPrintOrg\">Facebook</a>, and <a href=\"https://www.instagram.com/foodprintorg/\">Instagram</a> (all @FoodPrintOrg).</li><li>Connect with Jerusha Klemperer on <a href=\"https://twitter.com/eathere2\">Twitter</a> and <a href=\"https://www.linkedin.com/in/jerusha-klemperer/\">LinkedIn</a>.</li><li>Need support on your leadership journey? Join the next cohort of women in the Be The Change group coaching and leadership training program starting in September 2022 - get on the waitlist here: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a></li><li>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a></li><li>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></li><li>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</li></ul><p><br /></p>", "publicationDate": "Fri, 13 May 2022 13:00:00 +0200", "duration": "2140", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/10611213-building-a-better-food-system-with-jerusha-klemperer-director-foodprint-ep-22.mp3", "size": "25719268", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}