{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Can Mushrooms Save the World? Circular Food Systems + Local Empowerment - Part 2 - with Natan (Nam Mushrooms, Portugal) and Ivanka (EkoFungi, Serbia) | Ep. 10", "subtitle": "Can Mushrooms Save the World? Circular Food Systems + Local Empowerment - Part 2 - with Natan (Nam Mushrooms, Portugal) and Ivanka (EkoFungi, Serbia) | Ep. 10", "summary": "<p>This episode is the second of our little series on “Can mushrooms save the world?”. My two guests this week are Natan, who’s the founder of a Lisbon-based startup called NAM mushroom and Ivanka, who’s the founder of Ekofungi, Serbia’s first circular economy company. Ivanka is sometimes referred to as the mother of mushrooms, and Natan learned the art of mushroom growing in Ivanka’s school.</p><p>In this episode, we dive into the science behind using mushrooms to create circular food systems and business models. They both share their wisdom and experience in mushroom growing, leading change and how they overcame obstacles and learned from failures in their journeys.</p><p>The topics we cover are:</p><p>·       The role of mushrooms in building a sustainable food system and circular economy</p><p>·       How Natan created a circular economy around coffee, mushrooms and fertilizer in Lisbon</p><p>·       How NAM recreates the natural growing environment for mushrooms inside of shipping containers</p><p>·       How growing mushrooms has influenced how Natan engages with food</p><p>·       Lessons he learned from failures and advice to anybody wanting to start a project shaping the food system</p><p>·       Natan’s favourite way to cook mushrooms</p><p>·       The story behind Ekofungi and how Ivanka was one of the first to start growing mushrooms on coffee waste</p><p>·       What makes her school and its educational approach special</p><p>·       How to translate nature’s circularity into sustainable business models</p><p>·       Ivanka’s surprising thoughts about the statement “Mushrooms can save the world”</p><p>·       How she faced obstacles as a female leader and entrepreneur</p><p>·       The importance of having social support when leading change or building something new</p><p>·       Ivanka’s favourite way to cook mushrooms</p><p> </p><p>Further information: </p><p>Find more information about NAM mushroom on https://nammushroom.com/ </p><p>You can follow them on Instagram and Facebook @nam.mushroomfarm</p><p>Find more information about Ekofungi on <a href=\"https://www.systemekofungi.com/\">https://www.systemekofungi.com/</a></p><p>You can follow them on Instagram and Facebook @ekofungi</p><p> </p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts:</p>", "publicationDate": "Tue, 30 Mar 2021 14:00:00 +0200", "duration": "2396", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/8239109-can-mushrooms-save-the-world-circular-food-systems-local-empowerment-part-2-with-natan-nam-mushrooms-portugal-and-ivanka-ekofungi-serbia-ep-10.mp3", "size": "28790711", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}