{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Finding Purpose in Our Food Systems and Our Lives with Ronni Kahn (Founder Oz Harvest) | Ep. 1", "subtitle": "Finding Purpose in Our Food Systems and Our Lives with Ronni Kahn (Founder Oz Harvest) | Ep. 1", "summary": "<p>My guest on this episode is the fabulous Ronni Kahn, founder and CEO of OzHarvest, the pioneering food rescue organization in Australia. Ronni was recently featured in the film Food Fighter, a documentary that followed her journey to build OzHarvest and replicate it around the world. I spoke to Ronni just before the release of her brand new book “A repurposed life”, a memoir about how she found her voice and stepped into her calling to nourish the country.</p><p>Ronni joined me to talk about how we can find purpose in our food system and our lives, shared some of the vast leadership experience she has gained setting up OzHarvest, and offers inspiration for how we can all make a contribution to a better world, and food system, each day. </p><p>On the show today we talk about:</p><ul><li>Ronni’s insights into leading a purpose driven organization</li><li>How to build a volunteer community that is engaged </li><li>The role of gratitude in managing the ups and downs of impact oriented work</li><li>The importance of mindset and attitude as a basis for leading change</li><li>How OzHarvest has faced COVID 19 </li><li>The importance of advocacy and lobbying for policy change as a key role to create lasting impact at the root of the issue</li><li>The dual issues of food waste and hunger and how to tackle both</li><li>The role of education to help us really value food and understand the true cost</li><li>Ronni’s insight into how her work has influenced how she eats and leads on a daily basis</li><li>How she stumbled onto her purpose in the food system and how it has changed her life</li><li>The small beginnings of what has grown into a leading model for food redistribution in the world</li><li>How a mindfulness practice supports her to do the work she does </li><li>Ronni’s perspective on what it means to live a great and full life</li></ul><p><br /><b>Full episode notes and links: <br /><br /></b>For the full show notes see: <a href=\"https://www.thegreatfull.com/podcast/ep1-ronni-kahn-finding-purpose-food-system-and-lives\">https://www.thegreatfull.com/podcast/ep1-ronni-kahn-finding-purpose-food-system-and-lives</a><br /><br />For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p>", "publicationDate": "Tue, 29 Sep 2020 16:00:00 +0200", "duration": "1884", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/5657668-finding-purpose-in-our-food-systems-and-our-lives-with-ronni-kahn-founder-oz-harvest-ep-1.mp3", "size": "22657875", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}