{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Food and Leadership for a Better World with Prof. Corinna Hawkes | Ep. 8", "subtitle": "Food and Leadership for a Better World with Prof. Corinna Hawkes | Ep. 8", "summary": "<p>In this episode Prof. Corinna Hawkes, director of the Centre for Food Policy at City University of London, joins me to chat about how changing the food system, and changing how we lead, can build a better word.  </p><p>Corinna is exactly the person to talk about these topics – she leads interdisciplinary research teams to work out how we can create policies that prevent malnutrition and build sustainable food systems. She also leads and contributes to more international processes and reports than I could possibly mention, but just to name a few: The Global Nutrition Report, The EAT Lancet Commission on Food, Health and Planet and London’s Child Obesity Task Force. </p><p>We talk all about the purpose of the food system, how it’s not serving everyone the way it should and different starting points where we can tackle challenges to create change. Corinna also discusses how creating a personally fulfilling life can fuel sustainable leadership and shares how she stays energized and works with overwhelm while engaging with work that tackles big global challenges.</p><p>Listen to our conversation to learn more about:</p><p>-        Childhood experiences that influenced Corinna’s work in food</p><p>-        What we should all know about the findings from the EAT Lancet report</p><p>-        How our economic system shapes food how we need to shift this</p><p>-        Why rethinking our political systems is important to create change in food systems</p><p>-        The role of human behavior change and the right type of leadership in building healthy food systems</p><p>-        How to create a life that is personally fulfilling while creating change in the world</p><p>-        Corinna’s insights on how she deals with overwhelm</p><p>-        Her favorite practices to stay energized and weave joy into her day-to-day life</p><p>-        What living a great and full life means for her</p><p>-        Corinna’s tribute and call to action to all the women working in food systems and her hopes for how women will shape the future of food.</p><p> </p><p>Further information: </p><p>You can follow Corinna’s work on Twitter @CorinnaHawkes </p><p>Read Corinna’s blog at <a href=\"https://www.thebetterfoodjourney.com/\">https://www.thebetterfoodjourney.com/</a> </p><p>To find out more about the Be The Change coaching and leadership program for aspiring women leaders in food and sustainability check out <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a> (applications closing soon!)</p><p>If you are interested in food and sustainability and how you can personally engage with change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Mon, 01 Feb 2021 10:00:00 +0100", "duration": "2376", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/7602781-food-and-leadership-for-a-better-world-with-prof-corinna-hawkes-ep-8.mp3", "size": "28560460", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}