{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Nature Protects Us When We Protect Nature with Dr. Jessica Hernandez (Author Fresh Banana Leaves)", "subtitle": "Nature Protects Us When We Protect Nature with Dr. Jessica Hernandez (Author Fresh Banana Leaves)", "summary": "<p>My guest this week is Dr. Jessica Hernandez (Maya Ch’orti’ &amp; Binnizá), the author of the new book “Fresh Banana Leaves - Healing Indigenous Landscapes through Indigenous Science”. Jessica is a postdoctoral research fellow at the University of Washington Bothell, a Climate Justice Policy Strategist at the International Mayan League and the Environmental Justice Representative of the City of Seattle Commission of Urban Forestry.<br /><br />In this episode, Jessica helps us understand how indigenous and western science can be complementary, and what we need to know about colonialism, eco-colonialism and ecological grief if we want to tackle climate change. Jessica shares the wisdom she has gathered on her leadership journey, particularly around framing and tackling imposter syndrome. </p><p>The topics we cover in our conversation are:</p><ul><li>The fascinating story behind the title of her book “Fresh Banana Leaves”</li><li>What it means to be an indigenous scientist</li><li>How settler colonialism impacts indigenous communities</li><li>What eco-colonialism means and why it is important</li><li>What people working in the field of sustainability need to understand about indigenous science</li><li>How Jessica is integrating her experiences as an indigenous and western scientist and how both approaches can complement each other</li><li>The concept of ecological grief</li><li>The restorative agricultural practice of Milpas</li><li>Spirituality and our relationship to nature</li><li>How Jessica found the courage to pursue her path integrating indigenous and western science</li><li>How Jessica frames and navigates imposter syndrome</li><li>What it means to her to be good ancestor</li><li>What we can learn from leadership in matriarchal pueblos of the Zapotec nation</li><li>Indigenous-led movements that inspire Jessica</li><li>What the food system would look like if it were returned to indigenous peoples</li><li>How Jessica stays grounded and manages her time and energy</li></ul><p>Find more information about Jessica Hernandez on <a href=\"https://www.jessicabhernandez.com/\">her website</a> and <a href=\"https://twitter.com/doctora_nature\">twitter</a>.</p><p>Order your copy of Fresh Banana Leaves - Healing Indigenous Landscapes through Indigenous Science <a href=\"https://www.penguinrandomhouse.com/books/675699/fresh-banana-leaves-by-jessica-hernandez/\">here</a>.</p><p>Find the book trailer <a href=\"https://www.youtube.com/watch?v=Q7kJFbBfu9A\">here</a>.</p><p>Need support on your sustainable leadership journey? Join the next cohort of women in the Be The Change group coaching and leadership training program starting in September 2022 - get on the waitlist here: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a></p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a></p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Mon, 25 Apr 2022 15:00:00 +0200", "duration": "2616", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/10498577-nature-protects-us-when-we-protect-nature-with-dr-jessica-hernandez-author-fresh-banana-leaves.mp3", "size": "31430635", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}