{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Sustainable Leading + Learning with Curiosity and Joy with Dr. Jess Schulschenk (Sustainability Institute, South Africa) | Ep. 11", "subtitle": "Sustainable Leading + Learning with Curiosity and Joy with Dr. Jess Schulschenk (Sustainability Institute, South Africa) | Ep. 11", "summary": "<p>On the show this week, I chat to Dr. Jess Schulschenk, the director of the Sustainability Institute (SI) in South Africa - a pioneer in transformative learning for just and generative futures. Jess and I talk about the essence of the unique work at the SI, what led her towards a career in sustainability, how she deals with some of the challenges that her work brings and how it all relates to the bigger picture of how live well while doing well. We discuss how tools like effective storytelling and changing narratives can be used to solve sustainability challenges while also being crucial for personal wellbeing and intentional leadership.</p><p>The topics we cover are:</p><p>·       The unique approach to learning and research at the Sustainability Institute</p><p>·       An overview of how the Sustainability Institute is embedded into an ecologically designed community that is deeply intentional about integrating mixed income households from diverse backgrounds</p><p>·       Insights from her PhD research on leadership and sustainability across the African continent</p><p>·       The importance of narratives and storytelling in creating change</p><p>·       How Jess became interested in sustainability and how she created her own career path</p><p>·       The role of community in finding the confidence to become active in sustainability</p><p>·       Personal and leadership challenges people working in sustainability face and practices she uses to manage these</p><p>·       Balance and the narratives around self-care in the sustainability world</p><p>Further information: </p><p>Find more information about the Sustainability Institute at <a href=\"http://www.sustainabilityinstitute.net\">www.sustainabilityinstitute.net</a>. </p><p>You can follow them on Instagram and Facebook @sustainability.institute</p><p>For more information about other offerings at The Great Full to help you eat, live and lead for a more sustainable world, check out: <a href=\"http://www.thegreatfull.com\">www.thegreatfull.com</a> </p><p>Interested in leadership and sustainability? Check out the Be The Change program: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a> </p><p>If you are interested in food and sustainability and what you can do to create change, you might like The Great Full cookbook: <a href=\"http://www.thegreatfull.com/book\">www.thegreatfull.com/book</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts.</p><p> </p>", "publicationDate": "Fri, 23 Apr 2021 13:00:00 +0200", "duration": "2264", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/8389838-sustainable-leading-learning-with-curiosity-and-joy-with-dr-jess-schulschenk-sustainability-institute-south-africa-ep-11.mp3", "size": "27215491", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}