{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Systemic Regeneration and Feminine Leadership with Jehane Akiki (Co-Founder Farms not Arms, Lebanon) | Ep. 15", "subtitle": "Systemic Regeneration and Feminine Leadership with Jehane Akiki (Co-Founder Farms not Arms, Lebanon) | Ep. 15", "summary": "<p>My guest on this episode is Jehane Akiki, a Lebanese social entrepreneur and systems designer.  She’s the Co-Founder and Managing Director of Farms not Arms, a collective bringing Lebanese people and refugees together to build food security and social cohesion. </p><p>Jehane is also the Co-Founder of ioi Strategic Design and Learning Blocks. All of these efforts have seen her acknowledged as one of the World Economic Forum Global Shapers.</p><p>Jehane and I talk about the philosophy and vision behind Farms Not Arms and her personal leadership journey to work at the interface of food systems, social justice and sustainable development. </p><p>The topics we cover are:</p><p>·       The catalyst for Jehane’s work in food and agriculture</p><p>·       What her work has taught her about about social integration and the refugee crisis </p><p>·       How she worked with a collective from around the world to create Farms Not Arms using a  collaborative systemic design process</p><p>·       The idea, philosophy, and principles behind Farms Not Arms</p><p>·       How this internationally co-designed project was able to be locally embedded</p><p>·       The biggest challenges they faced when implementing the project</p><p>·       Gender issues that emerged during her work</p><p>·       Personal challenges Jehane has overcome on her leadership journey</p><p>·       How to manage the self-doubt that can arise when we tackle complex challenges</p><p>·       Moments that have personally touched her while working with Farms not Arms</p><p>·       How Jehane creates space for feminine leadership values </p><p>·       What living a great and full life mean for her </p><p> </p><p>Further information: </p><p>Need support on your leadership journey? Join the next cohort of women in the Be The Change group coaching and leadership training program starting in Feb 2022: <a href=\"http://www.thegreatfull.com/bethechange\">www.thegreatfull.com/bethechange</a> </p><p>Follow The Great Full on Instagram: <a href=\"https://www.instagram.com/thegreatfull/\">https://www.instagram.com/thegreatfull/</a></p><p>Find more information about Farms Not Arms on <a href=\"https://www.designfarmsnotarms.org/\">https://www.designfarmsnotarms.org/</a></p><p>You can follow them on Instagram and Facebook @farmsnotarms <br /><br />Find out more about Jehane at https://www.jehaneakiki.com/  </p><p>Don’t want to miss an episode of The Great Full podcast? Subscribe wherever you get your podcasts!</p>", "publicationDate": "Fri, 17 Dec 2021 16:00:00 +0100", "duration": "2083", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/9740222-systemic-regeneration-and-feminine-leadership-with-jehane-akiki-co-founder-farms-not-arms-lebanon-ep-15.mp3", "size": "25045015", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}