{"version": 5, "show": {"title": "The Great Full", "summary": null, "poster": "https://storage.buzzsprout.com/variants/uxtdmhgybt8ennexx2m3g3ofql56/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg", "link": "http://www.thegreatfull.com"}, "title": "Trailer - The Great Full Podcast", "subtitle": "Trailer - The Great Full Podcast", "summary": "<p>&lt;p&gt;The Great Full podcast is here to help you contribute to a more sustainable world through how you eat, live and lead.&lt;p&gt;&lt;p&gt;Join me on a journey around the world to connect with thinkers and doers working to build more sustainable food systems, communities and lives. They share insights into the challenges we collectively face, highlight the solutions they are bringing to life and offer up wisdom they have gained along their journey.&lt;p&gt;&lt;p&gt;This is all to inspire and empower you to explore how you want to make a contribution, both personally and professionally, and give you some tools to do so in a way that is impactful, fulfilling and supports your own wellbeing.&lt;p&gt;&lt;p&gt; As an author, educator and coach who is continually navigating this path, I also share the tools I have found supportive and transformational for how I eat, live and lead. Insights that will help you combine purpose and joy, contribution and wellbeing and personal development and sustainable development.&lt;p&gt;&lt;p&gt;It is my intention to share a diversity of voices and perspectives, to connect you to inspiring stories and new insights and to help you reflect on your own role in building a more sustainable world and food system.&lt;p&gt;&lt;p&gt;For more information and other resources, check out &lt;a href=&quot;https://www.thegreatfull.com&quot;&gt;The Great Full&lt;/a&gt;&lt;p&gt;</p>", "publicationDate": "Mon, 14 Sep 2020 13:00:00 +0200", "duration": "54", "poster": "https://static.wixstatic.com/media/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg/v1/fill/w_1277,h_753,al_c,q_85,enc_auto/0c655a_b260b8cf3e1c4d30aaa970cdd38e742c~mv2.jpg", "link": null, "audio": [{"url": "https://www.buzzsprout.com/1303834/5430184-trailer-the-great-full-podcast.mp3", "size": "691095", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Michelle Grant"}]}