{"version": 5, "show": {"title": "The Natural Lifestylist Podcast", "summary": "Tony Riddle devised his Natural Life-stylist philosophy as a way to recharge, reboot and re-educate on the importance of re-aligning ourselves with Nature for emotional, spiritual and physical health. Tony’s work is based around the premise that if we can recognise where nature is missing from our lives, we can reconnect with it and fall back in love with it, and in doing so can shake the angst-inducing monkey off our collective back.", "poster": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded/2244572/2244572-1567535924043-712a035e2cb6.jpg", "link": "https://anchor.fm/s/df98870/podcast/www.tonyriddle.com"}, "title": "Abby Rose - Regenerative Farming and Our Natural Norms", "subtitle": "Abby Rose - Regenerative Farming and Our Natural Norms", "summary": "<p><strong>Hello and welcome to the natural lifestylist podcast</strong></p>\n<p><strong>Happy New Year all you beautiful beings of Planet Earth.</strong></p>\n<p><strong>I recorded this podcast way back in the first half of2020 but then I dropped into hyper-focus mode in preparation for the crazy one man, two feet, three peaks barefoot event.</strong></p>\n<p><strong>Then on returning from the 17 marathons, 3 barefoot peaks in 9 days I hit a massive comedown and had to go into save my own ass mode. This included the whole Riddle Tribe moving out of London and into the country.</strong></p>\n<p><strong>One could say I somewhat dropped the ball on this podcast. Apologies to the wonderful Abby and all those who have waited for this.</strong></p>\n<p><strong>But in keeping with my push don't flow philosophy I suspect this will be exactly the right, devine time to drop this episode.</strong></p>\n<p><strong>There has been lots of talk recently on the new norm but as far as I'm concerned the only new norm we should be moving towards is, actually, the natural norm. Which, ain’t that new.</strong></p>\n<p><strong>This conversation has certainly helped me better understand and articulate my message around the natural food norm.</strong></p>\n<p><strong>It takes a huge amount of skill in our modern, industrialized world to get our fundamental needs met. I hope this conversation will help you refine your food filter and make that journey a little easier to understand.</strong></p>\n<p><strong>Abby Rose is the co-creator and co-host of Farmerama, a platform for the regenerative farming movement; for them to share their voices.</strong></p>\n<p><strong>Abby is also the co-founder of Vida Cycle apps, creating digital tools to create ecology, profitability and beauty on farms around the World. Their tech tools are built to support a paradigm shift towards regenerative farming where farmers are empowered through learning from their observations.</strong></p>\n<p><strong>I really hope you enjoy this chat. I learnt a hell of a lot from Abby and I feel like it's just the start. Enjoy the conversation.</strong></p>\n<p><strong>Where can you find Abby and her work?</strong></p>\n<p><strong>Farmerama Radio </strong><a href=\"https://farmerama.co/\"><u><strong>https://farmerama.co/</strong></u></a><strong>&nbsp;</strong></p>\n<p><strong>www.instagram.com/farmerama_radio</strong></p>\n<p><strong>https://tech.vidacycle.com/</strong></p>\n<p><strong>www.instagram.com/abby_super</strong></p>\n<p><br /></p>\n<p><a href=\"https://tonyriddle.com/nat-life-tribe/\"><strong>To learn about and join the NAT LIFE TRIBE click here.</strong></a></p>", "publicationDate": "Thu, 21 Jan 2021 08:53:17 GMT", "duration": "01:30:22", "poster": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode/2244572/2244572-1611219205310-1a0ac5c4ab8d3.jpg", "link": "https://anchor.fm/tony-riddle/episodes/Abby-Rose---Regenerative-Farming-and-Our-Natural-Norms-eotbl2", "audio": [{"url": "https://anchor.fm/s/df98870/podcast/play/25128034/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2021-0-13%2Fd76c218a-6fa3-217b-09bf-a3e698f0be88.mp3", "size": "66383287", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Tony Riddle"}]}