{"version": 5, "show": {"title": "The Natural Lifestylist Podcast", "summary": "Tony Riddle devised his Natural Life-stylist philosophy as a way to recharge, reboot and re-educate on the importance of re-aligning ourselves with Nature for emotional, spiritual and physical health. Tony’s work is based around the premise that if we can recognise where nature is missing from our lives, we can reconnect with it and fall back in love with it, and in doing so can shake the angst-inducing monkey off our collective back.", "poster": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded/2244572/2244572-1567535924043-712a035e2cb6.jpg", "link": "https://anchor.fm/s/df98870/podcast/www.tonyriddle.com"}, "title": "James Thornton - Client Earth. Protecting People, Nature & The Planet.", "subtitle": "James Thornton - Client Earth. Protecting People, Nature & The Planet.", "summary": "<p><strong>Welcome to The Natural Lifestylist Podcast</strong></p>\n<p><strong>It’s been quite some time since I last released a new podcast, even though this one's been in the bank and I've been itching to put it out. It didn't feel appropriate to put it out, especially in these coronavirus times.</strong></p>\n<p><strong>Then, as if by magic, &nbsp;I was presented with some research that suggests that high levels of air pollution, specifically diesel may be one of the contributing factors to deaths from COVID-19.</strong></p>\n<p><strong>You can check out that research by </strong><a href=\"https://amp.theguardian.com/environment/2020/apr/20/air-pollution-may-be-key-contributor-to-covid-19-deaths-study\"><u><strong>clicking here</strong></u></a><strong>. That was then a brilliant opportunity for me to release this episode since air pollution is a topic that we speak about in our conversation.</strong></p>\n<p><strong>My guest on this episode is James Thornton.</strong></p>\n<p><strong>The New Statesman has named him as one of 10 people who could change the world.</strong></p>\n<p><strong>James Thornton is an environmental lawyer and writer. He is the founding CEO of Client Earth, a global, non-profit, environmental law organization. James launched Client Earth in 2007 sparking fundamental change in the way environmental protections are made and enforced across Europe. Now operating globally, Client Earth uses advocacy, litigation, and research to address the greatest challenges of our time; including nature loss and climate change.</strong></p>\n<p><strong>I hope you enjoy this conversation.</strong></p>\n<p><strong>I absolutely love what Client Earth is about and what they're doing. I've been on board ever since the book landed in my lap. They were one of the organisations that I raised funds for on my crazy barefoot Land's End to John O’Groats shenanigans last year</strong></p>\n<p><strong>If you want to get behind James and support Client Earth you can head over to Amazon and buy the book or you can head to clientearth.org. On the website, you can make donations, fundraise, or even join their leadership circles.</strong></p>\n<p><strong>You can help James, Client Earth, and Mother Earth by sharing this conversation wide and far. Don't just do it for Client Earth, &nbsp;for me, or even for you. But rather the bigger picture of doing this for the next generation and generations to come.</strong></p>\n<p><strong>Don’t forget to check out my weekly </strong><a href=\"https://clients.mindbodyonline.com/classic/ws?studioid=435972&amp;stype=-7&amp;sTG=27&amp;sView=day&amp;sLoc=0\"><u><strong>online Move Breath Chill Experience</strong></u></a><strong> and also </strong><a href=\"https://clients.mindbodyonline.com/classic/ws?studioid=435972&amp;stype=40&amp;prodid=100\"><u><strong>The NATLIFE Tribe</strong></u></a><strong>.</strong></p>\n<p><strong>Until the next time stay wild, stay connected, and stay empowered! You are loved!</strong></p>", "publicationDate": "Mon, 27 Apr 2020 15:30:00 GMT", "duration": "01:24:07", "poster": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode/2244572/2244572-1588034062076-060f29716849a.jpg", "link": "https://anchor.fm/tony-riddle/episodes/James-Thornton---Client-Earth--Protecting-People--Nature--The-Planet-eda40l", "audio": [{"url": "https://anchor.fm/s/df98870/podcast/play/12963285/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fproduction%2F2020-3-27%2F67988692-44100-2-8f9176bf88f9b.mp3", "size": "123875412", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Tony Riddle"}]}