{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "16: Agroforestry, small data, food sovereignty and people’s food policies", "subtitle": "16: Agroforestry, small data, food sovereignty and people’s food policies", "summary": "Farmerama have learnt that farming’s best economic models mimic nature’s clever ways and make many things from the same piece of land.\n\nFarmer Stephen Briggs tells us about one of these clever models. He fills us in on his  agroforestry setup or ‘3D farming’, where he grows organic apples and cereals on his 150 acres in Cambridgeshire. We also hear a few thoughts from Ben Raskin, head of horticulture at the Soil Association, who is just starting a new agroforestry project in Wiltshire at Helen Browning’s Organic Farm.\n\nOur co-host Abby shares a tool she initially created for her family’s farm to help them build a more resilient business using ‘small data’. Now other farmers are using it in the UK and Chile, in particular we hear from Davenport Vineyards about how they have used it to help their vineyard prosper.\n\nWe finish with a bit of a food sovereignty focus – two reports from different ends of Britain both building people’s food policies: in Scotland we hear about the ‘Good Food Nation Bill’ and Dee Butterly, talks us through ‘The People’s Food Policy’ supported by The Landworker’s Alliance. In our divided world we wonder if food and farming could be a web that will connect us all.", "publicationDate": "Fri, 10 Mar 2017 18:53:54 +0000", "duration": "00:31:55", "poster": "https://i1.sndcdn.com/artworks-000211940648-5bk7rn-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/farmerama-16", "audio": [{"url": "https://feeds.soundcloud.com/stream/311734636-farmerama-radio-farmerama-16.mp3", "size": "30704161", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}