{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "47: Women farmers in Chile, woodchip, pasture-happy pigs and regenerative vineyard management", "subtitle": "47: Women farmers in Chile, woodchip, pasture-happy pigs and regenerative vineyard management", "summary": "This month, Abby spends some time with Josephina, a former art teacher, on her ranch in the Chilean mountains. Josephina started a group for women farmers in the region, which has grown to become a network of community support and friendship.\n\nThen, we hear about the Woodchip for Fertile Soils project run by Sally Westaway from the Organic Research Centre. As part of the project, Robert Benford of Down Farm takes in wood from William Hamer’s Hampshire Woodfuel Cooperative, and uses it to improve his soil. \n\nNext, we speak with Fred Price from Gothelney Farm, Somerset, who was on the show back in January. This time, he talks to us about a key part of his system: the pastured pigs. Fred explains how he uses a forage-based system to build soil, keep the pigs happy, and make sure the farm is ecologically and financially resilient. \n\nWe also hear back from another old friend from a few episodes ago, Dan Rinke. As well as his farming experiments with Kim Hamblin at Art and Science, Oregon, Dan manages Johan Vineyards in the Willamette Valley, and he walks us through his regenerative vineyard management system. \n\nFinally, we return to the nuances of no-till and conservation agriculture, focusing this month on the application of glyphosate right before harvest in the UK, also known as pre-harvest crop desiccation. We can understand why farmers might want to do this, but this use of herbicides makes us uneasy. What do you think?\n\nThanks for listening to Farmerama this month, and every month. Farmerama is made by Abby Rose, Katie Revell and Jo Barratt. This month, editing was by Suzie McCarthy, Louis Hudson and Zack Ekpe. Community support for the show comes from Hanna Soderlund, Annie Landless, Eliza Jenkins and Olivia Oldham, and our theme music is by Owen Barratt.", "publicationDate": "Sun, 30 Jun 2019 12:57:35 +0000", "duration": "00:32:09", "poster": "https://i1.sndcdn.com/artworks-000559540428-s76sfx-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/47-women-farmers-in-chile-woodchip-pasture-happy-pigs-and-regenerative-vineyard-management", "audio": [{"url": "https://feeds.soundcloud.com/stream/644199288-farmerama-radio-47-women-farmers-in-chile-woodchip-pasture-happy-pigs-and-regenerative-vineyard-management.mp3", "size": "77188701", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}