{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "58: Cooperative land, holistic management, FMNR and the secret life of insects", "subtitle": "58: Cooperative land, holistic management, FMNR and the secret life of insects", "summary": "This month, two new farmers share their experience of getting land through the Ecological Land Cooperative, and tell us why having a stake in the land is so crucial. Then, we hear from a farmer on a small Scottish island about moving from conventional agriculture to a more holistic way of farming, and making a living from marginal land. We learn how a simple system of nurturing chopped down trees back to life is restoring soils and supporting rural communities in Uganda. And, finally, a naturalist shares his research into insect migrations – and tells us why they’re so important to agriculture.\n\nThis month’s episode is supported by Treedom - a platform that makes it easy to support a farmer in Africa or South America to plant a tree. When you buy a tree with Treedom you’re financing farmers to plant trees as part of small agroforestry systems, and providing the local know-how and support to ensure those trees have the best start in life and truly benefit the farmers, their communities and the soil. Once you buy a tree you can also follow its journey online. Since they started in 2010, Treedom have planted over a million trees. Let’s green the planet.\n \nWebsite: http://go.treedom.net/rh5f\nInstagram: https://www.instagram.com/treedom_trees/\nFacebook: https://www.facebook.com/treedomtrees/\nYoutube: https://www.youtube.com/channel/UC4LB9MIGsvGknvcSzA9Affg", "publicationDate": "Sun, 26 Jul 2020 14:24:06 +0000", "duration": "00:41:24", "poster": "https://i1.sndcdn.com/artworks-Tbd9G3rY8xtxPf6g-rCX21w-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/episode-58-cooperative-land-holistic-management-farmer-managed-natural-regeneration-and-the-secret-life-of-insects", "audio": [{"url": "https://feeds.soundcloud.com/stream/864857239-farmerama-radio-episode-58-cooperative-land-holistic-management-farmer-managed-natural-regeneration-and-the-secret-life-of-insects.mp3", "size": "39815672", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}