{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "'Cereal', Episode 1: Flour, water, salt", "subtitle": "'Cereal', Episode 1: Flour, water, salt", "summary": "Bread. How did something so basic, so fundamental, get so complicated – and even start making us ill?\n\nHow have the needs of industrial production come to dictate the way that seeds are bred, grain is grown, flour is milled, and bread is baked and eaten? And why are more and more people cutting this age-old staple out of their diets? In this episode, we hear from bakers and researchers who reveal the hidden truths about what goes into our bread, and explain how that’s impacting our health. And we’re introduced to the Real Bread Campaign, a movement promoting bread that’s nourishing, tasty and environmentally sound.\n\nThe radical changes that our bread has undergone are revealing of much wider truths about our relationships with food, farmers, the land, the environment, and each other. If you eat food, you have a stake in this story.\n\nThis if the first episode in a 6 part series, Cereal, uncovering the hidden truths behind our bread and the people who are building a new grains movement.\nCereal is made possible by the generous support of the Roddick Foundation.\n\nThis episode features:\nChris MacCormack, a home baker (Govanhill Bread Man)\nKimberley Bell, founder of Small Food Bakery, Nottingham\nChelsea Marshall, Trustee of Scotland the Bread\nAndrew Whitley, Bread Matters, co-founder of the Real Bread Campaign, and Scotland the Bread\nTheo Laffargue, Riverside Bakery, Stirling", "publicationDate": "Sun, 24 Nov 2019 10:14:07 +0000", "duration": "00:28:42", "poster": "https://i1.sndcdn.com/artworks-000645359185-o5fnx4-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cereal-episode-1-flour-water-salt", "audio": [{"url": "https://feeds.soundcloud.com/stream/717399967-farmerama-radio-cereal-episode-1-flour-water-salt.mp3", "size": "41410395", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}