{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 2", "subtitle": "Cultivating Justice: Episode 2", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nEpisode 2 is hosted by Assistant Producer Nadia Mehdi and Farmerama’s Abby Rose. Woven throughout we are taken to the fields, pots and allotments of the chorus of land-based practitioners. We hear from Maymana Arefin, a community gardener, spoken-word poet, and artist. They talk to us about their cultural connections to growing, as well as speaking about a series of foraging walks that they help run with Misery Party - a mental health and harm reduction collective - called “Misery Medicine, Plant Magic”, which focus on healing for Black people, and people of colour.\n\nWe dip into a clip from a performance by Turner Prize nominated artist Sin Wai Kin (this is the first of a few clips we will hear from them across the series). It was commissioned by the Queer Ecologies collective as part of their Microbe Disco. The piece mixes Sin Wai Kin's original sounds and poetry with music from the Butterfly Lovers violin concerto, and recordings from oceans and compost piles. We also hear a field recording by Amu Gibbo, taken by a canal in London.\n\nSam Siva of Land In Our Names (LION) digs into the experiences and wisdom of community gardener, beekeeper and proud South Londoner Carole Wright. We tune into their conversation at Carole’s community garden where they chat about liberation through healing, building resilient communities, and the ways that access to land and the living world are key to this.\n\nThe Cultivating Justice podcast series is made by Sam Siva, Katie Revell, Hester Russell, Dora Taylor, Abby Rose and Nadia Mehdi. This episode featured conversations with Maymana Arefin and Carole Wright; reflections from our chorus of voices – Tinisha Williams, Sasha, a.k.a. MindYourOwnPlants, Dani Foster, Dav Singh, Anna Barrett, and Nancy Winfield, along with Maymana Arefin; clips from a performance by Sin Wai Kin mixed for the Microbe Disco and field recordings by Amu Gibbo. Our series music is by Taha Hassan.\nThank you to our funders, Farming the Future and the Roddick Foundation. And a big thank you to everyone who’s contributed in any way!\nVisit landworkersalliance.org.uk/cultivating-justice/ to find out more.", "publicationDate": "Sun, 03 Jul 2022 10:07:43 +0000", "duration": "00:43:35", "poster": "https://i1.sndcdn.com/artworks-7FzDwLEte51eAtFy-0A0Hyg-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-2", "audio": [{"url": "https://feeds.soundcloud.com/stream/1298864653-farmerama-radio-cultivating-justice-episode-2.mp3", "size": "41855616", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}