{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 5", "subtitle": "Cultivating Justice: Episode 5", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nOur host for episode 5 is Marcus MacDonald – Land in Our Names member, grower, tour manager and organiser. Marcus takes us on an auditory journey centring on the banjo, and we learn why this instrument is intricately connected to Black culture, food growing and justice.\n\nWe sit in on a banjo lesson with Marcus and his friend and teacher Bianca Wilson, aka Island Girl. They play together, chat about country music, and discuss the history of the banjo, including how this instrument from African and Caribbean culture became mainstreamed in white culture throughout Europe and the United States. Marcus talks about how growing gourds to make banjos has become an important part of his cultural identity.\n\nNext, we hear from Hannah Mayree – grower, herbalist and founder of the Black Banjo Reclamation Project, which aims to re-appropriate Black culture by returning banjos, instruments of African origin, to the descendants of their original makers. Hannah talks to us about how the project works, and how growing gourds to build banjos can be an immensely healing practice.\n\nThe Cultivating Justice podcast series is made by Sam Siva, Katie Revell, Hester Russell, Dora Taylor, Abby Rose and Nadia Mehdi. This episode featured conversations with Marcus Macdonald, Bianca Wilson and Hannah Mayree. \n\nOur series music is by Taha Hassan. Our artwork is by @Blkmoodyboi.\n\nThank you to our funders, Farming the Future and the Roddick Foundation. And a big thank you to everyone who’s contributed in any way!\n\nVisit landworkersalliance.org.uk/cultivating-justice/ to find out more.", "publicationDate": "Sun, 24 Jul 2022 17:59:50 +0000", "duration": "00:46:25", "poster": "https://i1.sndcdn.com/artworks-zM2xp9hjzyrqhtY6-YdTdwQ-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-5", "audio": [{"url": "https://feeds.soundcloud.com/stream/1310966422-farmerama-radio-cultivating-justice-episode-5.mp3", "size": "44575104", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}