{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 1", "subtitle": "Cultivating Justice: Episode 1", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nEpisode 1 is hosted by OOTL’s Hester Russell and LION’s Sam Siva. Woven throughout we are taken to the fields, pots and allotments of a chorus of land-based practitioners. We are treated to a sound piece ‘Eating your castings’ by Jas Butt and Hari Byles, made up of sounds that were recorded inside a wormery and a compost heap in an urban nature reserve in East London.\nWe hear from Paula Gioia about the organising work happening in Europe on issues relevant to LGBTQIA+ landworkers, as well as the roots of European Coordination Via Campesina (ECVC)’s gender and sexuality articulation, and their Embracing Rural Diversity report. \nWe drop in on a conversation between Sam Siva and Professor Corinne Fowler, recorded shortly after their keynote session at the ORFC22 on Land, Race and Empire. They discuss how systems of oppression are rooted in land ownership, issues around access to rural spaces for BPOC and people living in cities, and how to truly decolonise regenerative agriculture.\n\nThe Cultivating Justice podcast series is made by Hester Russell, Abby Rose, Dora Taylor, Katie Revell, Nadia Mehdi and Sam Siva. This episode featured conversations with Paula Gioia and Corinne Fowler. Reflections from Sasha aka MindYourOwnPlants, Dani Foster, Dav Singh, Tinisha Williams, Nancy Winfield, Srikanth Narayanan and Philomena de Lima and music by Jas Butt – a.k.a. Guest and Hari Byles, as well as Bianca Wilson, a.k.a. Island Girl. Our series music is by Taha Hassan.\nThank you to our funders, Farming the Future and the Roddick Foundation. And a big thank you to everyone who’s contributed in any way! \n\nVisit https://landworkersalliance.org.uk/cultivating-justice/ to find out more.", "publicationDate": "Sun, 26 Jun 2022 20:41:13 +0000", "duration": "00:51:09", "poster": "https://i1.sndcdn.com/artworks-dKWSDmySEdfz67qy-vkD6Gg-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-1", "audio": [{"url": "https://feeds.soundcloud.com/stream/1294809430-farmerama-radio-cultivating-justice-episode-1.mp3", "size": "49115136", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}