{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Cultivating Justice: Episode 3", "subtitle": "Cultivating Justice: Episode 3", "summary": "Welcome to Cultivating Justice! Our 6-part series in collaboration with Land In Our Names (LION) and Out on the Land (OOTL, part of The Landworker’s Alliance) which weaves together interviews, conversations, music and reflections from Black people, people of colour, trans people, queer people and women, on their relationships with land, growing, and identity.\n\nEpisode 3 is hosted by LION’s Sam Siva and Farmerama’s Dora Taylor. In this episode, we dig into the practices and meanings around callaloo, a plant that’s commonly used in Caribbean food, and can also be grown in the UK. \n\nGlenda Trew is a workshop facilitator, community grower and gardener who lives in London. She talks to us about: teaching callaloo growing to growers from Lewisham’s Ital Garden; her personal history and connection to the plant; and the importance of being able to access culturally appropriate crops.\n\nWe also join Sam and Dora in Sam’s kitchen as they cook some callaloo dishes together. As they cook, eat and swap recipes, they chat about the links between food, growing, history and their own identities. \n\nThe Cultivating Justice podcast series is made by Sam Siva, Katie Revell, Hester Russell, Dora Taylor, Abby Rose and Nadia Mehdi. This episode featured conversations with Glenda Trew, Dora Talyor and Sam Siva and banjo music by Bianca Wilson aka Island Girl. Our series music is by Taha Hassan. Our artwork is by @Blkmoodyboi \n\nThank you to our funders, Farming the Future and the Roddick Foundation. And a big thank you to everyone who’s contributed in any way!\nVisit landworkersalliance.org.uk/cultivating-justice/ to find out more.", "publicationDate": "Sun, 10 Jul 2022 17:11:46 +0000", "duration": "00:31:34", "poster": "https://i1.sndcdn.com/artworks-iCCxWH4luErCzjii-BhWIqA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/cultivating-justice-episode-3", "audio": [{"url": "https://feeds.soundcloud.com/stream/1302827596-farmerama-radio-cultivating-justice-episode-3.mp3", "size": "30310272", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}