{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Landed part 2: Re-storying the landscape", "subtitle": "Landed part 2: Re-storying the landscape", "summary": "Over the last 250 years, Gaelic culture in the Highlands of Scotland has experienced what academic Iain MacKinnon refers to as “cultural devastation”. For farmer’s son, Col Gordon, the forced displacement of people during the Highland Clearances, and the dismantling of Gaelic language and traditions, are best understood through the lens of colonisation. Now, only small pockets of Gaelic culture remain, detached from the conditions and ways of life that they evolved in.\n\nIn this episode, Col learns about the pre-colonial attitudes of the Gaels towards the land, investigating the question of what came before the family farm. What he finds is a system based on community and collective work, with a yearly migration to the hillside “shieling” to graze the cattle and rejuvenate the spirit. Above all, what he finds is a fundamentally different way of relating to the land – an understanding that people belong to the land, not the other way around.\n\nCould a revival of these “indigenous” practices, and these relationships to the land, provide a route forward? And, if so, how might we “re-indigenise” in an open and inclusive way?\n\nLanded is produced by Col Gordon and Katie Revell, with Executive Producer Abby Rose. Our Project Manager is Olivia Oldham. Huge thanks to Josina Calliste for her guidance and input and to Sarah Nicholas for all her help and support. Thanks also to Jo Barratt. The music for Landed is by Dagger Gordon and Col Gordon.", "publicationDate": "Sun, 11 Jul 2021 16:31:20 +0000", "duration": "00:47:41", "poster": "https://i1.sndcdn.com/artworks-l3Eq5jKqvGVg2M2Z-NWtbyA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/landed-part-2-re-storying-the-landscape", "audio": [{"url": "https://feeds.soundcloud.com/stream/1085657899-farmerama-radio-landed-part-2-re-storying-the-landscape.mp3", "size": "45785088", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}