{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "Landed part 3: Colonial connections", "subtitle": "Landed part 3: Colonial connections", "summary": "In Part 2, farmer’s son Col Gordon explored the ways in which the colonisation of Highland Scotland destroyed a rich pre-colonial culture and relationship to the land. But in Part 3, he learns that the story of Scotland as the victim of colonial practices is just one part of a much bigger narrative. \n\nThe Highlands is one of the least racially diverse parts of the UK, and it would be easy to think of the area as far removed from the UK’s grim colonial history – a place where racial justice and reparations have no direct relevance. But, as Col discovers, this would be far from the truth.\n\nCol traces the connections – some indirect, others very concrete – between the rural landscape he grew up in and global patterns of displacement, exploitation and enslavement. To dig deeper, he speaks with Josina Calliste, co-founder of Land in Our Names (LION) – a Black-led, grassroots collective committed to reparations in Britain by connecting land and climate justice with racial justice – and explores what it means to be a person of colour in rural Scotland today.\n\nLanded is produced by Col Gordon and Katie Revell, with Executive Producer Abby Rose.\n\nOur Project Manager is Olivia Oldham.\n\nHuge thanks to Josina Calliste for her guidance and input and to Sarah Nicholas for all her help and support. Thanks also to Jo Barratt.\n\nThe music for Landed is by Dagger Gordon and me, Col Gordon.\n\nThis episode featured David Alston, Josina Calliste, Iain MacKinnon, Srik Narayanan and Philomena de Lima\n\nFunding for the project was provided by the funding platform Necessity.\n\nFarmerama is committed to keeping all our episodes free, and to paying our team a living wage. To do so, we rely on support from you, our community of listeners. If you’d like to help us make more podcasts, you can become a Patron at patreon.com/farmerama", "publicationDate": "Sun, 25 Jul 2021 13:59:30 +0000", "duration": "00:52:30", "poster": "https://i1.sndcdn.com/artworks-uRgfJIC1QYKiJOho-bxzjjA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/landed-part-3-colonial-connections", "audio": [{"url": "https://feeds.soundcloud.com/stream/1093807225-farmerama-radio-landed-part-3-colonial-connections.mp3", "size": "50408064", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}