{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "\"Who feeds us?\" Episode 1: The hungry gap", "subtitle": "\"Who feeds us?\" Episode 1: The hungry gap", "summary": "As the COVID-19 lockdown hit the UK in early 2020, our nation suddenly looked very different. Supermarket shelves were empty and, for the first time in most people's lives, we started to question how we were going to feed ourselves, and our families. Almost overnight, localised food systems went from being niche fantasies to a vital source of sustenance for many people around the country.\n\nBut who – and what – made up those localised food systems? Where did this sudden burst of community provision come from? In this episode we hear from four very different corners of the food system. From people supplying high-end restaurants to people on the frontlines of emergency food response. They all share what the lockdown meant for them and their communities, as well as how what they are doing helps feed us every day – the strength of close farm-restaurant relationships, the difficulties dairy farmers have faced in the last few decades, the health benefits of local honey, and the need for culturally appropriate food. All of these stories begin to hint at what a food system woven with dignity might look like.\n\nThis is only part 1; we will be meeting each of these people again in the final episode to hear their visions for the future and what’s next for those who feed us. \n\nAs we learn in many different ways throughout this series: Food is not just a question of calories. Food is nourishment for the body and soul. Food is about community, culture and our relationship with each other and with the Earth. We are all the food system.\n\nInterviews with\nSkye Gyngell https://springrestaurant-shop.co.uk/\nJane Scotter http://fernverrow.com/\nAngus Buchanan-Smith https://www.the-free-company.com/\nSalma & Khalil Attan ttps://www.bushwoodbees.co.uk/ // https://www.youtube.com/channel/UCVrsm10F2zp_KO26MBCGRUw\nUrsula Myrie https://www.adira.org.uk/\n\nFarmerama.co\nProducer: Suzie McCarthy\nExecutive Producers: Jo Barratt, Katie Revell, Abby Rose\nAdditional Interviews: Lovejit Dhaliwal\nCommunity Collaborators: Cathy St Germans, Zain Dada, Col Gordon\nArtwork: Hannah Grace www.hgraceoc.com/\nMusic: Michael O'Neil\nPR & Comms: Fran Bailey, Kate Lam, Elma Glasgow, Nancy Brownlow\n\nWho Feeds Us? is possible thanks to the Farming the Future COVID Response Fund. We’re very grateful to The A Team Foundation, the Roddick Foundation, Thirty Percy and the Samworth Foundation for providing the funds to make this project happen.", "publicationDate": "Sun, 11 Oct 2020 18:57:21 +0000", "duration": "00:42:40", "poster": "https://i1.sndcdn.com/artworks-hla7QcZ29vZDOFBA-Z66zbA-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/who-feeds-us-episode-1-the-hungry-gap", "audio": [{"url": "https://feeds.soundcloud.com/stream/908855488-farmerama-radio-who-feeds-us-episode-1-the-hungry-gap.mp3", "size": "61520083", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}