{"version": 5, "show": {"title": "Farmerama", "summary": null, "poster": "https://i1.sndcdn.com/avatars-000615700872-y2kyn7-original.jpg", "link": "http://farmerama.co"}, "title": "\"Who feeds us?\" Episode 3: Growing our own", "subtitle": "\"Who feeds us?\" Episode 3: Growing our own", "summary": "As lockdown came into effect, and supermarkets struggled to restock their fruit and vegetable aisles, the idea of “growing your own” took on a new significance. In towns and cities across the UK, those of us lucky enough to have access to gardens or balconies – even if we’d never grown anything before – suddenly started looking for compost, tools, and seeds.\n\nMany of us discovered, perhaps for the first time, the joy of eating freshly picked, homegrown fruit and veg. It’s a joy that you just don’t get when you bite into something that’s been harvested unripe on the other side of the world, flown across oceans to be processed somewhere else, then eventually picked up from a supermarket chiller here in the UK – maybe weeks later.\n\nBut, to grow your own food, the first thing you need are seeds. For millennia – for the vast majority of our agricultural history, in fact – farmers saved their own seed. Over time, plants adapted to the specifics of the area they were growing in, and local varieties emerged. But when seed companies developed F1 hybrids, which can’t be harvested and re-sown year after year, things changed. The genetics of these hybrids are too unstable – there’s no knowing how your crop will turn out. So farmers and growers reliant on F1 hybrids have to buy their seeds every single year.\n\nBy saving and sharing open-pollinated seed, farmers and growers – and communities – are helping make sure our food supply can withstand the shocks of climate change. And, they’re also reclaiming collective control of the seeds we all depend on to feed ourselves – ensuring that we all have access to those seeds, even during a crisis – like a pandemic.\n\nFeaturing:\nAstrid Guillabeau:\nNeville Portas: https://nodiggitygdns.wordpress.com/ \nDee Woods: https://granvillecommunitykitchen.wordpress.com/\nHelene Schulze: https://www.seedsovereignty.info/ \n\nFarmerama.co\nProducer: Alice Armstrong\nExecutive Producers: Jo Barratt, Katie Revell, Abby Rose\nCommunity Collaborators: Andre Reid, Dhelia Snoussi\nProject Manager: Olivia Oldham\nArtwork: Hannah Grace www.hgraceoc.com/\nMusic: Michael O'Neil\nPR & Comms: Fran Bailey, Kate Lam, Elma Glasgow, Nancy Brownlow\n\nWho Feeds Us? is possible thanks to the Farming the Future COVID Response Fund. We’re very grateful to The A Team Foundation, the Roddick Foundation, Thirty Percy and the Samworth Foundation for providing the funds to make this project happen.", "publicationDate": "Sun, 25 Oct 2020 10:57:23 +0000", "duration": "00:31:36", "poster": "https://i1.sndcdn.com/artworks-CoGtElf7sMfzkZ6f-mCUBOw-t3000x3000.jpg", "link": "https://soundcloud.com/farmerama-radio/who-feeds-us-episode-3-growing-our-own", "audio": [{"url": "https://feeds.soundcloud.com/stream/917330441-farmerama-radio-who-feeds-us-episode-3-growing-our-own.mp3", "size": "75846969", "title": "MP3 Audio (mp3)", "mimeType": "audio/mpeg"}], "contributors": [{"name": "Farmerama"}]}